{"articles": [{"source": "Carnegie Mellon University", "title": "Parrot Genome Analysis Reveals Insights Into Longevity, Cognition", "link": "/news/parrot-genome-analysis-reveals-insights-longevity-cognition", "date": "12/6/2018", "content": "\nParrots are famously talkative, and a blue-fronted Amazon parrot named Moises – or at least its genome – is telling scientists volumes about the longevity and highly developed cognitive abilities that give parrots so much in common with humans. Perhaps someday, it will also provide clues about how parrots learn to vocalize so well.\nMorgan Wirthlin, a BrainHub post-doctoral fellow in Carnegie Mellon University’s Computational Biology Department and first author of a report to appear in the Dec. 17 issue of the journal Current Biology, said she and her colleagues sequenced the genome of the blue-fronted Amazon and used it to perform the first comparative study of parrot genomes.\nBy comparing the blue-fronted Amazon with 30 other long- and short-lived birds — including four additional parrot species — she and colleagues at Oregon Health and Science University (OHSU), the Federal University of Rio de Janeiro and other entities identified a suite of genes previously not known to play a role in longevity that deserve further study. They also identified genes associated with longevity in fruit flies and worms.\n''In many cases, this is the first time we’ve connected those genes to longevity in vertebrates,'' she said.\nWirthlin, who began the study while a Ph.D. student in behavioral neuroscience at OHSU, said parrots are known to live up to 90 years in captivity — a lifespan that would be equivalent to hundreds of years for humans. The genes associated with longevity include telomerase, responsible for DNA repair of telomeres (the ends of chromosomes), which are known to shorten with age. Changes in these DNA repair genes can potentially turn cells malignant. The researchers have found evidence that changes in the DNA repair genes of long-lived birds appear to be balanced with changes in genes that control cell proliferation and cancer.\nThe researchers also discovered changes in gene-regulating regions of the genome — which seem to be parrot-specific — that were situated near genes associated with neural development. Those same genes are also linked with cognitive abilities in humans, suggesting that both humans and parrots evolved similar methods for developing higher cognitive abilities.\n''Unfortunately, we didn’t find as many speech-related changes as I had hoped,'' said Wirthlin, whose research is focused on the evolution of vocal behaviors, including speech. Animals that learn songs or speech are relatively rare — parrots, hummingbirds, songbirds, whales, dolphins, seals and bats — which makes them particularly interesting to scientists, such as Wirthlin, who hope to gain a better understanding of how humans evolved this capacity.\n''If you’re just analyzing genes, you hit the end of the road pretty quickly,'' she said. That’s because learned speech behaviors are thought be more of a function of gene regulation than of changes in genes themselves. Doing comparative studies of these ''non-coding'' regulatory regions, she added, is difficult, but she and Andreas Pfenning, assistant professor of computational biology, are working on the computational and experimental techniques that may someday reveal more of their secrets.\nThis work was supported through the Brazilian Avian Genome Consortium and by the National Institutes of Health/National Institute on Deafness and Other Communication Disorders.\nSee coverage of this research by New Scientist.\n \n  "}, {"source": "Carnegie Mellon University", "title": "Bible Readings Help Create New Multilingual Dataset", "link": "/news/bible-readings-help-create-new-multilingual-dataset", "date": "12/6/2018", "content": "\nIt's the Christmas season, which means that beloved Bible verses are being read and recited innumerable times — and in a vast number of languages. The Bible's global reach as evidenced this time of year has enabled a Carnegie Mellon University professor to create a language resource that could enhance communication in hundreds of languages.\nBy tapping online text and audio recordings of the New Testament in more than 700 languages, Alan Black, a professor in CMU's Language Technologies Institute, has created a dataset that can be used to build text-to-speech computer systems and other modern speech technologies for so-called low-resource languages. These languages, such as Kaqchikel in central Guatemala, Lun Bawang of Malaysia and Indonesia, and Mamprusi in northern Ghana, often are spoken by relatively small groups of people and generally lack the kind of technological tools for recognizing or translating language that are routinely available for high-resource languages such as English, Spanish or Mandarin Chinese.\nBlack said it generally isn't profitable to build such systems — or often even basic tools such as dictionaries or pronunciation guides — for low-resource languages. But that never mattered to Christian missionaries, he added.\n\"They don't care about commercial aspects,\" Black explained. \"They care about the Word.\" In many cases, what few resources exist for these languages are the work of missionaries. \"I suspect that for some of these languages these are the only written texts that exist.\"\nBlack was able to tap one of those evangelical resources — an online service called Bible.is that provides recordings of the New Testament in more than a thousand languages — to create what he calls the CMU Wilderness Multilingual Speech Dataset. This dataset, available for free download online via GitHub, includes audio, word pronunciations and other tools necessary to build text-to-speech systems.\nFrom Bible.is, Black downloaded recordings of more than 700 languages for which both audio and text were available. That represents about 10 percent of the world's languages, he noted.\n\"They are languages that missionaries would care about,\" Black said, including those spoken in areas such as Central and South America, West and East Africa, and Southeast Asia.\nHe then set about aligning the text with the audio, determining which words in the text corresponded with spoken words. By so doing, he was able to establish pronunciation rules that make it possible to vocalize any word in that language, not just those included in the Bible.\nTo make those alignments, Black and his CMU students were aided by the similar spelling and pronunciations across languages of three Hebrew names — Jesus, David and Abraham — and the first verse of the Book of Matthew: \"The book of the genealogy of Jesus Christ, the son of David, the son of Abraham.\"\n\"I now probably know that first sentence in Matthew better than anyone else,\" Black added.\nA computer program that makes a best guess at pronunciation helps create an initial alignment of text and audio. This first attempt often is incomprehensible, Black noted, but a machine learning program then analyzes the alignment and fine-tunes it.\nThus far, he and his students have completed alignments for 600 of the languages and hope to finish the remaining, more troublesome languages soon. In some cases, poor quality recordings, misidentified languages and unrecognizable writing systems have thwarted their efforts.\nDevelopment of the dataset was an outgrowth of a Defense Advanced Research Projects Agency program called Lorelei, which sought ways to develop speech recognition tools for low-resource languages within a matter of hours or days. Such tools would be useful, for instance, in responding to epidemic outbreaks or other humanitarian crises.\nRather than build such tools on demand — which requires intensive work — Black worked to identify existing resources, such as Bible.is, that could be tapped to create these tools inexpensively in advance. He and his students have demonstrated that tools such as a speech synthesizer can indeed be created using the Wilderness dataset.\nTools for processing and translating speech are particularly important for low-resource languages because many of their speakers are illiterate, Black explained.\nThe dataset also should be useful for linguists, he added, noting it makes it possible to do studies of how languages vary across the planet. For instance, the dataset includes about 100 languages from the Amazon basin, enabling studies of how words are formed and how they relate to words in other languages. "}, {"source": "Carnegie Mellon University", "title": "Hodgins Named 2018 ACM Fellow", "link": "/news/hodgins-named-2018-acm-fellow", "date": "12/5/2018", "content": "\nThe Association for Computing Machinery (ACM) has named Jessica Hodgins, professor of robotics and computer science, one of 56 new ACM fellows honored for their significant contributions to computer science.\nHodgins, who leads the Facebook AI Research lab in Pittsburgh in addition to her faculty duties, was cited by the ACM for her contributions to character animation, human simulation and humanoid robotics.\nHodgins's research focuses on computer graphics, animation and robotics with an emphasis on generating and analyzing human motion. Formerly vice president for research at Disney Research, she last year was elected president of the ACM's Special Interest Group on Computer Graphics and Interactive Techniques (SIGGRAPH). She has received numerous awards, including SIGGRAPH's Steven Anson Coons Award for Outstanding Creative Contributions to Computer Graphics. She received her Ph.D. in computer science at CMU in 1989.\nFormer CMU professor Bruce Maggs, now a professor of computer science at Duke University, also was named an ACM fellow \"for contributions to the development of content distribution networks and the theory of computer networks.\"\nACM will formally recognize its 2018 fellows at its annual awards banquet, to be held June 15 in San Francisco. Additional information about new and current ACM fellows is available on the ACM website. "}, {"source": "Carnegie Mellon University", "title": "Three SCS Faculty Members Named 2019 IEEE Fellows", "link": "/news/three-scs-faculty-members-named-2019-ieee-fellows", "date": "12/5/2018", "content": "\nThree School of Computer Science faculty members — Venkatesan Guruswami, Mor Harchol-Balter and Eric Xing — have been elevated to fellows in the Institute of Electrical and Electronics Engineers (IEEE), the world's largest technical professional organization.\nFellow status is a distinction reserved for select members who have demonstrated extraordinary accomplishments in an IEEE field of interest.\nGuruswami, a professor in the Computer Science Department (CSD), was cited \"for contributions to list error-correction and algorithmic coding theory.\" His research spans a number of topics in theoretical computer science, including the theory of error-correcting codes, probabilistically checkable proofs, computational complexity theory and algebraic algorithms. He joined the CMU faculty in 2009.\nHarchol-Balter, a professor in CSD since 1999, was cited \"for contributions to performance analysis and design of computer systems.\" Her work on designing new resource-allocation policies includes load-balancing policies, power-management policies and scheduling policies for distributed systems. She is heavily involved in the SIGMETRICS/PERFORMANCE research community and is the author of a popular textbook, \"Performance Analysis and Design of Computer Systems.\"\nXing, a professor in the Machine Learning Department since 2004, was cited \"for contributions to machine learning algorithms and systems.\" His research interests lie in machine learning, computational biology and statistical methodology. He and his collaborators have developed a framework called Petuum for distributed machine learning with massive data, big models and a wide spectrum of algorithms. Petuum is now established as a company, of which Xing is founder, CEO and chief scientist.\nThe total number of fellows selected in any one year cannot exceed one-tenth of one percent of the total voting IEEE membership. A complete list of the Class of 2019 is available on the IEEE site. "}, {"source": "Carnegie Mellon University", "title": "SCS Master's Student Named Schwarzman Scholar", "link": "/news/scs-masters-student-named-schwarzman-scholar", "date": "12/3/2018", "content": "\nSchool of Computer Science master's student Hima Tammineedi has been named to the 2020 class of Schwarzman Scholars, a highly competitive graduate fellowship inspired by the Rhodes Scholarships that features one year of study at Tsinghua University in China.\nLaunched in 2016, the Schwarzman Scholars program prepares future global leaders to meet the geopolitical challenges of the 21st century. During their year of study, the world's best young minds explore the economic, political and cultural factors that have contributed to China's growth as a global power. Tammineedi is the second CMU student to be named a Schwarzman Scholar. Chrystal Thomas, who graduated from the Mellon College of Science, earned the award in 2016.\n\"The program brings the world's future leaders to China because it is and will continue to be one of the largest factors influencing the future of the world — politically, economically and technologically,\" said Tammineedi, who earned his bachelor's degree in computer science with a minor in machine learning from CMU this past May. \"Having an understanding of the country will be essential in order to be a global leader. This directly aligned with my interests for my future, and given that I already had a big interest in China, it's the perfect opportunity for me.\"\nTammineedi is one of 147 students worldwide selected for the program. More than 2,800 students applied for the fellowship, which begins in August.\n\"Our newest class includes a diverse group of future leaders from around the world,\" said Stephen A. Schwarzman, co-founder and CEO of Blackstone and chair of Schwarzman Scholars. \"They join a global network of scholars who have committed themselves to being a force for change, regardless of where their professional or personal passions take them. My hope is that a year in Beijing will inspire and challenge these students in ways they haven't even imagined. I look forward to seeing how this new class will leave its mark.\"\nSchwarzman Scholars spend a year in Beijing, where they earn a master's degree in global affairs from Tsinghua's Schwarzman College. In addition to taking classes in the core curriculum, scholars pursue an individually designed concentration in public policy, international studies, or economics and business. Outside the classroom, scholars gain exposure to China through internships, mentorship opportunities, special speakers and travel.\nTammineedi, who will earn a master's degree in machine learning in May 2019, will study public policy as a Schwarzman Scholar. He first became interested in the scholarship when it caught his eye on the website for CMU's Fellowships and Scholarships Office. He then worked with Richelle Bernazzoli, the office's assistant director, to complete the grueling application process that included in-person interviews.\n\"Hima is a budding expert in artificial intelligence whose interests span machine learning, transportation and urban issues. It was clear from our first meeting that he has been on an impressive trajectory since high school,\" Bernazzoli said. \"Every step of the way, Hima has approached his work with humility, thoughtfulness and a sense of responsibility to society. These qualities will make him an excellent Schwarzman Scholar and leader in his field for years to come.\"\nWhile Tammineedi said he's excited to learn from global leaders and the strong group of peers that will surround him during his scholar experience, he's also looking forward to expanding his education beyond computer science.\n\"I've studied computer science and machine learning at CMU, and that's where a lot of my interests lie. But my ultimate goals involve effecting change in the world at a large level,\" he said. \"While I do believe that a deep understanding of tech could make this change possible, I don't think just knowing tech can lead to the best changes. I want to develop a better understanding of how the world and its countries and governments function in order to understand the best ways technology can help.\"\nFor more about this year's class of Schwarzman Scholars, visit the organization's website. "}, {"source": "Carnegie Mellon University", "title": "PopSci Recognizes Wheel-Track With \"Best of What's New\" Award", "link": "/news/popsci-recognizes-wheel-track-best-whats-new-award", "date": "11/27/2018", "content": "\nA wheel that can transform into a triangular track, developed by Carnegie Mellon University's National Robotics Engineering Center with funding from the Defense Advanced Research Projects Agency, has won a Popular Science \"Best of What's New\" Award for 2018.The reconfigurable wheel-track can transform from one mode to the other in less than two seconds while the vehicle is in motion, enabling a vehicle in wheel mode to operate at high speeds on roads and switch rapidly to track mode to negotiate challenging off-road terrain.The device was recognized by Popular Science with a Best of What's New Award in the security category. The magazine presents the awards annually to 100 new products and technologies in 10 categories, including aerospace, entertainment and health.\"The Best of What's New Awards allow us the chance to examine and honor the best innovations of the year,\" said Joe Brown, editor-in-chief of Popular Science. \"This collection shapes our future, helps us be more efficient, keeps us healthy and safe, and lets us have some fun along the way.''The innovative wheel-track was one of the technologies developed in DARPA's Ground X-Vehicle Technologies (GXV-T) program, which aimed to reduce the need for armor by making combat vehicles faster, more maneuverable and capable of operating in a wide variety of environments.Dimi Apostolopoulos, a CMU Robotics Institute senior systems scientist and principal investigator for the wheel-track project, said the shape-shifting wheel-track has a number of potential civilian applications as well, including uses in agriculture, mining, construction, forestry and transportation. It can also be used in vehicles ranging in size from heavy equipment to recreational vehicles.\"Creating a reconfigurable wheel-track system that works on a moving vehicle and at high speeds was an exceptional challenge, but our NREC team came up with a design that works and has the potential to transform ground mobility.\" Apostolopoulos said. \"We are appreciative of DARPA's GXV-T program and we thank the editors of Popular Science for this recognition.\"The wheel-track has a rubberized tread that sits atop a frame that can change shape. The spinning wheel is transformed into a track by extending a Y-shaped support, which pushes the frame into a triangular shape. Simultaneously, application of a brake to stop the wheel from spinning causes the transmission to automatically shift from turning the wheel to turning a set of gears that drives the track.Though other research groups have built devices similar to NREC's reconfigurable wheel-track, those previous designs have required halting the vehicle to transform from one mode to the other, Apostolopoulos noted. The ability to make these transformations on the fly, he added, is a critical requirement for vehicles that must handle changing terrain at high speed.In testing to date, vehicles have been able to achieve 50 miles an hour in wheel mode and almost 30 mph in track mode. The device has been able to transform from wheel mode to track mode at speeds as high as 25 mph and from track mode to wheel mode at speeds of around 12 mph.Previous winners of Best of What's New Awards from Carnegie Mellon include Tartan Racing's Boss self-driving SUV, a self-landing helicopter, a snake-like robotic neck surgery tool, an automated method for editing video, a panoramic video camera and a photo editing tool that can manipulate objects in a photo as if they were three-dimensional.NREC is a part of Carnegie Mellon's Robotics Institute that performs contract research and development for a variety of governmental and industrial clients. "}, {"source": "Carnegie Mellon University", "title": "Farber Elected 2018 AAAS Fellow", "link": "/news/farber-elected-2018-aaas-fellow", "date": "11/27/2018", "content": "\nDavid Farber of the Institute for Software Research is one of two Carnegie Mellon University faculty members named 2018 fellows of the American Association for the Advancement of Science (AAAS).\nThe AAAS honor recognizes Farber, sometimes called the \"Grandfather of the Internet,\" for distinguished contributions to programming languages and computer networking. Farber joined CMU in 2002. He served as Distinguished Career Professor of Computer Science and Public Policy, and is now an adjunct professor.\nEarlier this year, Farber became a Distinguished Professor at Keio University in Tokyo, where he is co-director of the Cyber Civilization Research Center.\nThis year, 416 members have been named AAAS fellows because of their scientifically or socially distinguished efforts to advance science or its applications. In addition to Farber, they include Gregory V. Lowry, the Walter J. Blenko Sr. Professor of Civil and Environmental Engineering, who is cited for his contributions to safe and sustainable use of nanomaterials, remediation methods for contaminated sediments and brines, and mitigation of fossil fuel use impacts.\nFarber's distinguished career spans more than 50 years, including a stint as chief technologist for the Federal Communications Commission. He was the Alfred Fitler Moore Professor of Telecommunication Systems at the University of Pennsylvania's Wharton School before joining CMU.\nFarber has made foundational contributions to electronics, programming languages and distributed computing. He also is moderator of the long-running Interesting People email list, which focuses on internet governance, infrastructure and other topics he favors. He also is known for his way with words and known Farberisms, such as \"another day, a different dollar,\" and \"don't look for a gift in the horse's mouth.\"\nHis work has earned him countless awards and honors, including induction as an IEEE fellow, ACM fellow, the 1995 SIGCOMM Award for lifelong contributions to computer communications, and a spot in the Pioneers Circle of the Internet Hall of Fame.\nThe new AAAS fellows will be inducted on Saturday, Feb. 16, at the AAAS Fellows Forum during the AAAS Annual Meeting in Washington, D.C. "}, {"source": "Carnegie Mellon University", "title": "Bajpai, Wang Earn Stehlik Scholarships", "link": "/news/bajpai-wang-earn-stehlik-scholarships", "date": "11/21/2018", "content": "\nThe School of Computer Science has named current seniors Tanvi Bajpai and Serena Wang the recipients of its 2018 Mark Stehlik SCS Alumni Undergraduate Impact Scholarship. The award, now in its fourth year, recognizes undergraduate students for their commitment and dedication both in and beyond the classroom. Bajpai and Wang have made noteworthy contributions both to SCS and the computer science field in general. And they both plan to continue doing so after graduation.\nBajpai, who hails from West Windsor, NJ, said that she felt out of place in high school, surrounded by students who were less passionate about learning and more preoccupied with padding their resumes. She cultivated her interest in computer science by participating in programming competitions at the University of Pennsylvania, and attended a summer program at Princeton called the Program in Algorithmic and Combinatorial Thinking (PACT). Her exposure to discrete math and algorithm design fueled a desire to pursue computer science at CMU, where she was pleased to finally be surrounded with peers, faculty and mentors who were all just as passionate about the field as she was.\n\"I didn't want to get my hopes up about anything when I arrived at CMU,\" Bajpai said. \"I just wanted to learn as much as I could.\"\nDuring her time at CMU, Bajpai has performed research with Ramamoorthi Ravi, the Andris A. Zoltners Professor of Business and Rohet Tolani Distinguished Professor in SCS and the Tepper School of Business. In the summer of 2017, she interned at Microsoft, and this past summer she traveled to the University of Maryland to work on research with Samir Khuller, the Distinguished Scholar Teacher and Professor of Computer Science. Despite her many accomplishments, Bajpai believes that her biggest achievement at CMU was being a teaching assistant for a series of computer science and discrete math classes including 15-451: Algorithms, 15-151: Mathematical Foundations of Computer Science, and 21-128: Mathematical Concepts and Proofs.\n\"My outreach has been primarily toward encouraging diversity in the undergraduate computer science program, because although we have a 50/50 male to female ratio, we still need to push diversity at the teaching assistant and research level,\" Bajpai said. \"I've been very passionate about addressing the imposter phenomenon that goes on at CMU, and I've planned events with Women @ SCS to address both of these topics.\"\nWang, a Bay Area native, wasn't interested in computer science until her junior year of high school, even though she grew up in Silicon Valley. After a field trip to visit Google and Facebook's offices, and joining the National Center for Women and Information Technology (NCWIT) Facebook group, she was inspired by all of the initiatives proposed by young women.\n\"It made me realize that just like any field, computer science had many diverse topics,\" Wang said. \"There were many other young women just like me who were pursuing the field.\"\nWang has been a teaching assistant every semester since fall of her sophomore year, because of the positive impact her own teaching assistants had on her education at CMU. Beyond that, she has been involved with ScottyLabs and Women @ SCS since her freshman year, holding executive positions in ScottyLabs including both director of finance and director. She has also performed research on provable security and privacy with SCS Assistant Professor Jean Yang, and developed a passion for entrepreneurship while participating in the Kleiner Perkins Engineering Fellows Program.\nWang believes the most incredible opportunity she's had at CMU was organizing TartanHacks, a CMU-wide hackathon.\n\"Organizing a large event like TartanHacks takes a lot of preparation and teamwork,\" Wang said. \"But in the end, the rest of the ScottyLabs executive board members and I felt so accomplished and satisfied when we finished successfully hosting the event.\"\nWith their senior years nearly half completed, both students are focusing on their post-graduation goals. Bajpai hopes to pursue a Ph.D. in theoretical computer science and Wang will join an enterprise data infrastructure startup called Akita. Both students are incredibly grateful for the resources and opportunities that were theirs for the taking in the School of Computer Science.\n\"Receiving the Stehlik Scholarship has made me look back at what I've accomplished during my time at CMU, and as a freshman, I never would have expected to be able to do everything I've achieved,\" said Wang. Bajpai added, \"I don't think I'd be where I am today had I not had the support from some of my professors and advisors here, and I will always be grateful for that.\" "}, {"source": "Carnegie Mellon University", "title": "Carnegie Mellon University, Microsoft Join Forces to Advance Edge Computing Research", "link": "/news/carnegie-mellon-university-microsoft-join-forces-advance-edge-computing-research", "date": "11/14/2018", "content": "\nCarnegie Mellon University today announced it will collaborate with Microsoft on a joint effort to innovate in edge computing, an exciting field of research for intensive computing applications that require rapid response times in remote and low-connectivity environments. By bringing artificial intelligence to the \"edge,\" devices such as connected vehicles, drones or factory equipment can quickly learn and respond to their environments, which is critical to scenarios like search and rescue, disaster recovery, and safety.To enable discovery in these areas and more, Microsoft will contribute edge computing products to Carnegie Mellon for use in its Living Edge Laboratory, a testbed for exploring applications that generate large data volumes and require intense processing with near-instantaneous response times. Intel, which already is associated with the lab, is also contributing technology to the lab.Edge computing is a growing field that, in contrast to cloud computing, pushes computing resources closer to where data is generated — particularly mobile users — so that a host of new interactive and augmented reality applications are possible. It's the focus of intense commercial interest by network providers and tech companies, even as researchers continue to investigate its possibilities. Carnegie Mellon is at the forefront of this major shift in computing paradigms.Under a two-year agreement, Microsoft will provide edge computing products to the Living Edge Lab, including Azure Data Box Edge, Azure Stack (with hardware partner Intel) and Microsoft Azure credits, which provide access to cloud services including artificial intelligence, internet of things, storage and more. The new hardware is powered by Intel® Xeon® Scalable processors to support the most high-demand applications and actionable insights.The lab, run by edge computing pioneer and Carnegie Group Professor of Computer Science Mahadev Satyanarayanan, now operates on the CMU campus, as well as in shopping districts and parks in Pittsburgh's Oakland and Shadyside neighborhoods.\"It's easy to talk about edge computing, but it's hard to get crucial hands-on experience,\" said Satyanarayanan. \"That's why a number of major telecommunications and tech companies have joined our Open Edge Computing Initiative and helped us establish the lab. We validate ideas and provide unbiased, critical thinking about what works and what doesn't.\"With the addition of Microsoft products and Intel technology to the lab, faculty and students will be able to use them to develop new applications and compare their performance with other components already in the lab. Microsoft partners also will be able to use the lab.\"The intelligent edge, with the power of the intelligent cloud, can and is already driving real-world impact. By moving AI models and compute closer to the source, we can surface real-time insights in scenarios where milliseconds make a critical difference, and in remote areas where 'real time' has not been possible,\" said Tad Brockway, general manager of Azure Storage and Azure Stack. \"Microsoft offers the most comprehensive spectrum of intelligent edge technologies across hardware, software and devices, bringing the power of the cloud to the edge. We are excited to see what Carnegie Mellon researchers create.\"Speed — both of computation and communication — is a driving force for edge computing. By placing computer nodes, or \"cloudlets,\" near where people are, edge computing makes it possible to both perform intensive computation and to communicate the results to users at near real-time. This enables solutions better designed to for latency-sensitive workloads where every millisecond matters.\"Intel is at the heart of solutions needed to run the most demanding AI applications on the edge,\" said Renu Navale, senior director of Edge Services and Industry Enabling in the Network Communications Division. \"We are excited to extend our existing networking edge collaboration with the Open Edge Computing Initiative to include Microsoft solutions like Azure Data Box Edge and Azure Stack, powered by Intel Xeon processors.\"One example class of applications are wearable cognitive assistance applications based on the Gabriel platform, a National Science Foundation-sponsored project led by Satyanarayanan. A Gabriel application is intended as an angel on your shoulder, observing a user and providing advice on a task. This technology might provide expert guidance to a user who is assembling furniture, or troubleshooting a complex piece of machinery, or helping someone use an AED device in an emergency.A second example of the value edge computing brings to applications is OpenRTiST, which allows a user to see the world around them in real time, through the eyes of an artist. The video feed from the camera of a mobile device is transmitted to a cloudlet, transformed there by a deep neural network trained offline to learn the artistic features of a famous painting, and returned to the user's device as a video feed. The entire round trip is fast enough to preserve the illusion that the artist is continuously repainting the user's world as displayed on the device.Another class of applications envisioned for the Living Edge Laboratory are real-time assistive tools for visually impaired people to help them detect objects or people nearby. The video feeds of a stereoscopic camera on a user are transmitted to a nearby cloudlet, and real-time video analytics is used detect obstacles. This information is transmitted back to the user and communicated via vibro-tactile feedback.\"The Living Edge Laboratory can help determine not only what types of applications are possible, but also what kind of equipment or software works best for a given application,\" Satyanarayanan said.The lab was established through the Open Edge Computing Initiative, a group of leading companies, including Intel, Deutsche Telekom, Vodafone and Crown Castle who have provided equipment, software and expertise.\"We welcome Microsoft as a new member of the Open Edge Computing Initiative and we very much look forward to exploring Microsoft technologies in our Living Edge Laboratory,\" said Rolf Schuster, director of the Open Edge Computing Initiative. \"This is a great opportunity to drive attractive new business opportunities around edge computing for both the telecom and the cloud industries.\" "}, {"source": "Carnegie Mellon University", "title": "Neural Nets Supplant Marker Genes in Analyzing Single Cell RNA Sequencing", "link": "/news/neural-nets-supplant-marker-genes-analyzing-single-cell-rna-sequencing", "date": "11/13/2018", "content": "\nComputer scientists at Carnegie Mellon University say neural networks and supervised machine learning techniques can efficiently characterize cells that have been studied using single cell RNA-sequencing (scRNA-seq). This finding could help researchers identify new cell subtypes and differentiate between healthy and diseased cells.\nRather than rely on marker genes, which are not available for all cell types, this new automated method analyzes all of the scRNA-seq data to select just those parameters that can differentiate one cell from another. This enables the analysis of all cell types and provides a method for comparative analysis of those cells.\nResearchers from CMU's Computational Biology Department explain their method today in the online journal Nature Communications. They also describe a web server called scQuery that makes the method usable by all researchers.\nOver the past five years, single cell sequencing has become a major tool for cell researchers. In the past, researchers could only obtain DNA or RNA sequence information by processing batches of cells, providing results that only reflected average values of the cells. Analyzing cells one at a time, by contrast, enables researchers to identify subtypes of cells, or to see how a healthy cell differs from a diseased cell, or how a young cell differs from an aged cell.\nThis type of sequencing will support the National Institutes of Health's new Human BioMolecular Atlas Program (HuBMAP), which is building a 3D map of the human body that shows how tissues differ on a cellular level. Ziv Bar-Joseph, professor of computational biology and machine learning and a co-author of today's paper, leads a CMU-based center contributing computational tools to that project.\n\"With each experiment yielding hundreds of thousands of data points, this is becoming a Big Data problem,\" said Amir Alavi, a Ph.D. student in computational biology who was co-lead author of the paper with post-doctoral researcher Matthew Ruffalo. \"Traditional analysis methods are insufficient for such large scales.\"\nAlavi, Ruffalo and their colleagues developed an automated pipeline that attempts to download all public scRNA-seq data available for mice — identifying the genes and proteins expressed in each cell — from the largest data repositories, including the NIH's Gene Expression Omnibus (GEO). The cells were then labeled by type and processed via a neural network, a computer system modeled on the human brain. By comparing all of the cells with each other, the neural net identified the parameters that make each cell distinct.\nThe researchers tested this model using scRNA-seq data from a mouse study of a disease similar to Alzheimer's. As would be expected, the analysis showed similar levels of brain cells in both healthy and diseased cells, while the diseased cells included substantially more immune cells, such as macrophages, generated in response to the disease.\nThe researchers used their pipeline and methods to create scQuery, a web server that can speed comparative analysis of new scRNA-seq data. Once a researcher submits a single cell experiment to the server, the group's neural networks and matching methods can quickly identify related cell subtypes and identify earlier studies of similar cells.\nIn addition to Ruffalo, Alavi and Bar-Joseph, authors of the research paper include Aiyappa Parvangada and Zhilin Huang, both graduate students in computational biology. The National Institutes of Health, the National Science Foundation, the Pennsylvania Department of Health and the James S. McDonnell Foundation supported this work. "}]}