{"articles": [{"source": "University of Illinois", "title": "Gropp Named AAAS Fellow ", "link": "/news/gropp-named-aaas-fellow", "date": "November 27, 2018", "content": "\nIllinois Computer Science Professor William D. Gropp has been named a Fellow of the American Association for the Advancement of Science (AAAS).\nAs part of the Information, Computing and Communication section, Gropp, who is Director and Chief Scientist of the National Center for Supercomputing Applications (NCSA) and the Thomas M. Siebel Chair in the Department of Computer Science at Illinois, was elected as an AAAS Fellow for his distinguished contributions to scalable algorithms and software for high performance computing.\nElection as an AAAS Fellow is an honor bestowed upon AAAS members by their peers. This year, 416 members have been awarded this honor by AAAS because of their scientifically or socially distinguished efforts to advance science or its applications. New Fellows will be presented with an official certificate and a gold and blue (representing science and engineering, respectively) rosette pin at the AAAS Fellows Forum during the 2019 AAAS Annual Meeting in Washington, D.C. this February and will be announced in the \"AAAS News & Notes\" section of the journal Science on November 29, 2018.\n\nThroughout his nearly 40-year career, Gropp has explored parallel computing, software for scientific computing, numerical methods for partial differential equations, and the development of efficient and scalable parallel algorithms for the solution of linear and nonlinear equations. He has played a major role in the development of the MPI message-passing standard and was one of the designers of the PETSc parallel numerical library. Gropp is also recognized as a fellow of the ACM, IEEE, SIAM, and an elected a member of the National Academy of Engineering.\n“The AAAS is the premier society representing all of science, and it is a leader in communicating science to the public. I’m proud to be a member and I am honored by this recognition,” said Gropp.\nOther 2018 Fellows from the University of Illinois at Urbana-Champaign include Dr. Narayana Aluru of the Department of Mechanical Science and Engineering in the Engineering section, for outstanding contributions to computational, physical, and engineering aspects of nanofluidics and micro/nanoelectromechanical systems including the development of novel multiphysics and multiscale methods; Dr. Andrew D.B. Leakey of the Department of Crop Sciences in the Agriculture, Food and Renewable Resources section, for distinguished contributions to plant science, particularly for advancing integrative understanding of crop carbon and water relations in the context of global environmental change; and Dr. Ray Ming of the School of Integrative Biology, also in the Agriculture, Food and Renewable Resources section, for distinguished contribution to the field of sex chromosome evolution, particularly using genomic technologies to study early stages of sex chromosomes relevant to crop improvement.\nThe tradition of AAAS Fellows began in 1874. Currently, members can be considered for the rank of Fellow if nominated by the steering groups of the Association’s 24 sections, or by any three Fellows who are current AAAS members (so long as two of the three sponsors are not affiliated with the nominee’s institution), or by the AAAS chief executive officer. Fellows must have been continuous members of AAAS for four years by the end of the calendar year in which they are elected. AAAS Fellow’s lifetime honor comes with an expectation that recipients maintain the highest standards of professional ethics and scientific integrity.\n\nEach steering group reviews the nominations of individuals within its respective section and a final list is forwarded to the AAAS Council, which votes on the aggregate list. The Council is the policymaking body of the Association, chaired by the AAAS president, and consisting of the members of the board of directors, the retiring section chairs, delegates from each electorate and each regional division, and two delegates from the National Association of Academies of Science.\n \n\n\nABOUT AAAS\nThe American Association for the Advancement of Science (AAAS) is the world’s largest general scientific society and publisher of the journal Science (www.sciencemag.org) as well as Science Translational Medicine, Science Signaling, a digital, open-access journal, Science Advances, Science Immunology, and Science Robotics. AAAS was founded in 1848 and includes nearly 250 affiliated societies and academies of science, serving 10 million individuals. Science has the largest paid circulation of any peer-reviewed general science journal in the world. The non-profit AAAS is open to all and fulfills its mission to “advance science and serve society” through initiatives in science policy, international programs, science education, public engagement, and more. For the latest research news, log onto EurekAlert! (www.eurekalert.org), the premier science-news Web site, a service of AAAS.\n"}, {"source": "University of Illinois", "title": "Preventing the Spread of Misinformation Online ", "link": "/news/preventing-spread-misinformation-online", "date": "November 26, 2018", "content": "\nSocial media bot accounts have been a hot topic around the country since Russian-controlled accounts were suspected to have influenced the 2016 election. These accounts, regardless of origin, share inaccurate and often politically divisive information.\nIllinois Computer Science Professor and Willett Faculty Scholar Tarek Abdelzaher is working with his students on a unique way to identify these bots among millions of existing Twitter accounts. Rather than focus on individual account actions, Abdelzaher looks at the larger picture of misinformation campaigns.\n“Sometimes if you look at one account by itself it looks normal, but if you look at it compared to others in you realize it’s a bot,” said Abdelzaher, who is also a member of the Coordinated Science Laboratory. “You realize, geez for some reason the groups of accounts tweet exactly the same things at exactly the same time. The odds of humans being so in sync that they tweet the exact same thing at the exact same time is impossible. It’s a race against escalating attacker sophistication, where more complex statistical analysis is used to expose more complex bot group behaviors”\nThe intentions of the bot controllers vary, but they are frequently used to intimidate, motivate, or recruit people, or to change people’s minds via mass messaging. This is what prompted Abdelzaher to look at groupings of identical tweets rather than single accounts to identify bots. The strategy led Abdelzaher’s team to assist with uncovering an ISIS information campaign last year, showing that there are significant military applications to this technology as well as social.\n“The goal of the research was to identify these types of propaganda sources and isolate them,” Abdelzaher said. “We wanted to expose them for what they are. Or at least show that the information they are sharing isn’t genuine, it’s coming from a set of bots coming from such and such foreign country.”\nOriginally, the technology behind the bot detection was used for communicating social events. The tool, Apollo – also created by Abdelzaher, would gather information about an event on social media and provide a summarized and condensed version of what was happening. Of course, not everything on the internet is true, so additional research was necessary to determine the credibility of information.\nThe technology – which has so far only been used on the Twitter platform – uses only public information. Any information collected by the tool is already searchable by any twitter user and is collected using Twitter’s public interface in compliance with the company’s user agreements. But the hope is that is can be used across multiple social media platforms.\n“The main value-added function is that it cleans up the information a bit, sort of like a spam filter for your email or a Brita for your water,” Abdelzaher said. “That's where all the research is. So, for example, if a disaster occurs and people publicly ask for help by posting on Twitter, Apollo can report that, but it'll be smart enough to detect if something does not seem genuine, in which case it may discard it as misinformation/spam.”\nSocial media platforms and the people who use them for malicious purposes aren’t going away anytime soon. With better detection research and technology, identifying the real users from the bots will make it more difficult for the nonhuman users to spread their message.\nThis project is funded by the Army Research Lab’s Internet of Battlefield Things project.\n\nSee the original CSL story.\n"}, {"source": "University of Illinois", "title": "Cohens Give Back Because of Opportunities Illinois CS Provided, Hope Others Will Follow ", "link": "/news/cohens-give-back-because-opportunities-illinois-cs-provided-hope-others-will-follow", "date": "November 15, 2018", "content": "\nOn campus in October for the Illinois Computer Science Celebration of Excellence Student Awards Ceremony, Debra and Ira Cohen had a chance to see their own generosity at work.\nIra Cohen (BS CS ’80) is an Illinois CS graduate and he and Debra Cohen have long donated – funding three scholarships and a fellowship -- to help students finance the kind of education that he received, and give them the ability to take full advantage of the department and the university around them. The couple regularly enjoy the chance to meet with the students they help, and see how that help can transform those students and their trajectories.\n“These kids become mentors to other students,” Ira Cohen said. “That’s really what our goal is: not just set somebody up for life but to allow them to not work 40 hours while they’re going to school.”\nThe Cohens said they see themselves as part of a living and, they hope, growing cycle – people who gain from and then give back to the university and the Department of Computer Science.\n“Our hope going forward is that those people who have received the awards will hopefully will look back at their time at the university and say, ‘Hey, I was given an opportunity, let me do the same thing.’ Pay it forward,” Debra Cohen said.\nThe Cohens have been doing just that for years.\nIn 2005 they established the Ira & Debra Cohen Graduate Fellowship in Computer Science, primarily supporting graduate research in bioinformatics.\nThree years later, the Sara and Louis Cohen Undergraduate Scholarship was first awarded. It was established to honor Ira Cohen’s grandparents.\nAnd the next year, 2009, the Cohens added the William and Ruth Witt Scholarship in honor of Debra Cohen’s parents.\nThe Cohens also served on the Advisory Board when the Engineering Visionary Scholarship Initiative was launched.\nIn 2011, Ira Cohen was recognized among the department’s Alumni Award winners, taking home the Distinguished Service Award.\n“If we can provide impact, that’s the best thing,” Debra Cohen said.\nThe Cohens are also regulars on campus, holding season tickets for both football and basketball and supporting the golf program.\nTheir ties to the university run deep, and started, for Ira, almost the moment he graduated from high school in Wilmette in the Chicago suburbs.\n“About 37 of my high school class wound up going to Illinois,” he said, as well as a sister and cousin who were already on campus when he enrolled.\nOnce at Illinois Computer Science, Cohen found himself immersed in CS in ways he couldn’t have imagined, including exposure to legendary faculty like numerical analysis pioneer Bill Gear.\nBefore that, “I had a programmable calculator -- that was my computer experience,” Cohen said. “My first class was taught by Bill Gear. I still have the textbook.”\nEventually Cohen went on to cofound Advanced Systems Concepts, in Schaumburg, Illinois, and to meet Debra.\nShe graduated from Robert Morris University, but says she, too, found a home at Illinois.\n“I have a lot of orange and blue in my wardrobe,” she said. “I think a lot of it is that everybody has welcomed me.”\nFor Ira Cohen, a driving factor remains the challenging, dynamic environment he found around him as an Illinois CS student.\n“MOSAIC, I got exposed to email for the first time,” he said, remembering the revolution that was happening around him at the time. “It was kind of nice be networked into that and be exposed to the innovation that was going on.”\n“This revolution has happened in the last 30-plus years,” he added, “and a lot of it came out of Illinois.”\n \n"}, {"source": "University of Illinois", "title": "Solomonik Recognized for Early Career Work Aimed at Improving HPC Performance ", "link": "/news/solomonik-recognized-early-career-work-aimed-improving-hpc-performance", "date": "November 14, 2018", "content": "\nAs a high school student, Edgar Solomonik was already focused on a career in computer science, working as an intern at a downtown Chicago trading firm.\nCommuting by train back and forth between home in the Chicago suburbs and the office in the Loop, he learned about the sort of dedication and thinking it takes to work and succeed.\n“I already had a mindset for how to debug codes and kind of solve problems by myself, and how to work independently, the kind of work ethic that is associated with that,” said Solomonik, now an assistant professor at Illinois Computer Science and a graduate of the department (BS CS ’10).\nSolomonik’s focus also has guided his research, which last month was recognized with the IEEE Computer Society’s TCHPC Award for Excellence for Early Career Researchers in High Performance Computing.\nThe award recognizes the 28-year-old Solomonik for research that “has developed more scalable numerical algorithms and high-performance computing libraries. His research group, the Laboratory for Parallel Numerical Algorithms, leads the development of the CYCLOPS library for tensor computations, which encapsulates optimized communication-avoiding algorithms using a high-level language for tensor algebra. CYCLOPS has enabled groundbreaking simulations of electronic structure and quantum circuits, while also being applied to graph and data analysis.”\nSolomonik was nominated for the TCHPC Award by Professor James Demmel, the chair of Electrical Engineering and Computer Sciences at the University of California, Berkeley, and Solomonik’s PhD advisor.\nIn nominating his former student, Demmel noted the motivation of Solomonik’s work, and the advances for which he is responsible.\n“Edgar’s work … is motivated by avoiding communication, i.e. minimizing data movement, since moving data (between levels of memory or over networks) is more expensive in time and energy than arithmetic,” Demmel wrote, noting that in some cases his work led to operations that improved efficiency by many times and that CYCLOPS is widely used in computational chemistry.\nSolomonik noted that communication avoidance is a common theme in high performance computing.\n“My research is especially focused on supercomputers and large clusters where you have many, many nodes connected across a large network and they’re sending a little bit of data from one machine to another, which can cost a few orders of magnitudes more than doing some on that machine,” he said. “So that kind of changes the perspective on how algorithms should be designed and also how software should be designed.”\nSolomonik, as Demmel noted, created the first algorithms for fundamental matrix computations that achieve minimal communication cost.\nThe TCHPC Award is the second in just over a year recognizing Solomonik as a promising young scientist. He won the Householder Prize in 2017.\nThe latest honor, he said, both feels good and adds to the drive and focus that have so far characterized his career.\n“I think adds drive, to try to do more and succeed more,” Solomonik said. “If people are recognizing what you’re doing is valuable, it makes you want to do more.”\n \n"}, {"source": "University of Illinois", "title": "Jacobson Recognized for Research That Transformed Passenger Screening After 2001 Attacks ", "link": "/news/jacobson-recognized-research-transformed-passenger-screening-after-2001-attacks", "date": "November 12, 2018", "content": "\nAs Professor Sheldon Jacobson watched the September 2001 terrorist attacks unfold, he was among the many Americans who realized that life was about to change.\nWhat he did not know was that a National Science Foundation-funded research project he began just days before would be part of that change, creating the groundwork for The Transportation Security Administration’s PreCheck system. Precheck uses risk profiles to try to focus air security resources on higher-risk passengers.\nThe work Jacobson and three of his PhD students carried out while he was part of Department of Mechanical & Industrial Engineering has now been recognized with an IMPACT Prize from The Institute for Operations Research and the Management Sciences. The IMPACT Prize is awarded every two years and recognizes operations research that has had widespread impact.\nThe award highlights work whose effects have played out over a generation, from the morning of Sept. 11, 2001, through PreCheck’s adoption in 2011 to the recognition of the prize itself this month.\n“It's a real tribute to a number of people. The students did a phenomenal job in implementing this. (And) Ken Fletcher -- without him, we wouldn't be getting the award because someone had to make it into reality and we didn't have the power to do that,” Jacobson said, referring to the now-retired chief risk officer of the TSA who used the research to design PreCheck. “This is something that really has changed a lot of people's lives.”\nAnd their taxes.\nUsing his own research and the work of other researchers, Jacobson put what he calls a conservative estimate of the amount of money saved by the program at more than $350 million a year in direct costs alone.\nThe key is the roughly 1 million airline-passenger screenings a day that are PreCheck-qualified passengers. They use dedicated lanes available at more than 200 U.S. airports that require fewer TSA staff members than enhanced screening lanes.\n\n\n\nResoundingly Human podcast\n\n\nDuring the The Institute for Operations Research and the Management Sciences' conference, Professor Sheldon Jacobson also appeared on the organizatioon's \"Resoundingly Human\" podcast. You can listen here.\n\n\n\nFor the first decade after the attacks, the TSA essentially assumed that all passengers carried the same potential security risks and screened them all accordingly. That situation required either an expensive commitment of resources and time or, assuming that the agency would never have enough of either, the probability that some passengers would inevitably be underscreened.\nThe NSF-funded work that Jacobson had just begun when the attacks happened included a cost-benefit analysis of whether all baggage should be screened using essentially the same technology used in CAT scans.\n“We can't treat everybody like a terrorist. You have to treat people commensurate with their risk and that was the kind of nascent idea of what became risk-based security,” Jacobson said. “How can we take security resources and passenger risk and bring them together in an optimal way? So we used optimization models to analyze systems.”\nThe three students Jacobson worked with over a period of years and who share in the award were Laura Albert, who is now an associate professor of Industrial and Systems Engineering and assistant dean for Graduate Affairs, at the University of Wisconsin, Madison; Alexander Nikolaev, now an associate professor of Industrial and Systems Engineering at University at Buffalo; and Adrian Lee, who is president of Central Illinois Technology and Education Research Institute.\nAlbert, Jacobson said, was part of what he called the “Ah ha! moment” when the use of dynamic rather than static models for passenger screening – looking at passenger risk over a period of time rather than focusing on any particular moment – started to make sense.\nLater, Nikolaev came up with the policies that would be best for implanting the system. And Lee, whose background was in control theory, worked to sort out a balance between underscreening and overscreening passengers.\n“How do you do that? Every person has a risk profile,” Jacobson said.\nThe prize represents a form of validation, not so much for Jacobson or his former students as for the power and reach of a major research university, he said.\n“So often we're criticized in academia, that we're not doing anything relevant,” he said. “The prize recognizes the fact that this institution, the University of Illinois, can facilitate things like this, and I'm just one of 2,000 faculty members doing things, working hard, and serving.”\n"}, {"source": "University of Illinois", "title": "Acun’s Focus on HPC Energy Efficiency Leads to Dissertation Recognition from SIGHPC ", "link": "/news/acun-s-focus-hpc-energy-efficiency-leads-dissertation-recognition-sighpc", "date": "November 9, 2018", "content": "\nAs an undergraduate, Bilge Acun was drawn to supercomputers and the scientific discovery they made possible. But as she learned more about the tremendous amounts of power they consume, Acun focused on ways to make them more energy efficient, eventually writing her PhD dissertation on the subject.\nAcun’s dissertation has been recognized with an honorable mention in the inaugural Doctoral Dissertation Award competition of the Association for Computing Machinery Special Interest Group on High Performance Computing (SIGHPC).\nAcun (PhD CS ’17) said the recognition of her dissertation, “Mitigating Variability in HPC Systems and Applications for Performance and Power Efficiency,” is a gratifying reflection of the increasing importance of efficiency in high-performance computing.\n“It is great to see a work on energy efficiency being recognized with this award,” she said. “The HPC community is traditionally solely focused on performance, but metrics beyond execution time are becoming increasingly important, including energy and power, and the award signifies that importance to me.”\nImproving energy efficiency is important to Acun, she said, because of concerns about climate change and the growing need for energy to power high-performance computers. As noted in her dissertation, a petaflop supercomputer requires millions of dollars’ worth of machine and cooling power each year.\n“(And) the size of the data-centers and supercomputers keeps growing,” she said.\nAcun, who is now a researcher at IBM’s Thomas J. Watson Research Center in New York, began working on processor variability as a PhD student following a suggestion by a fellow student, Phil Miller (PhD ’16 and now the owner of a computing consultancy firm). Miller and Acun were both part of Professor Laxmikant “Sanjay” Kale’s Parallel Programming Laboratory.\nIn her dissertation, Acun analyzed frequency, temperature, power, and application-level variations in large-scale HPC systems, identifying their causes and proposing solutions:\n\nFrequency variations, she found, were a result of differences in the power efficiency of chips because of the manufacturing process. She proposed speed-aware dynamic load balancing strategies to mitigate those variations.\nThe manufacturing process was also the culprit behind power variations, leading Acun to propose variation-aware node-assembly methods.\nAcun pointed to inefficiencies in fan-based cooling systems as the cause of temperature variations, and settled on decoupled fan-control mechanisms with a learning-based temperature prediction model as a solution.\nAnd finally she pinpointed characteristics of the applications themselves (such as different kernel types) as the source of variance at the application level. Her solution was a fine-grained runtime based technique to mitigate those variations.\n\n“Energy and performance efficiency improvements are historically enabled by hardware improvements, however I see runtime systems as a big opportunity for computer scientists to help,” she said.\nAt IBM Research, Acun is continuing to work on improving the power efficiency as well as the performance of heterogeneous systems.\nFor inspiration she draws on the scientific applications that current large-scale computers and future exascale systems could make possible – new ways to treat cancer, for instance, and giving doctors a better understanding of the brain and heart through simulations.\nAcun says she finds inspiration in her experience in the Parallel Programming Laboratory, where Kale – her PhD advisor – fostered a culture of collaboration and respect.\n“Professor Kale has a wealth of technical knowledge in parallel computing and HPC area,” she said. “He allowed me to grow as an independent researcher and work on the topics that I cared about.\"\n"}, {"source": "University of Illinois", "title": "SENSELET Provides Sensory-Driven IoT Network for Scientific Instruments ", "link": "/news/senselet-provides-sensory-driven-iot-network-scientific-instruments", "date": "November 8, 2018", "content": "\nWhen fabricating new semiconductors for computer chips, the external environment – such as the humidity, temperature, or vibration from nearby machines – can make or break the experiment. That holds true for many types of research involving scientific instruments, including the discovery of new materials or biomedical processes.\nA team of researchers at the University of Illinois is building a wireless and scalable sensory infrastructure that will help scientists better understand the conditions under which their experiments succeed or fail, with the idea of accelerating scientific discovery and the introduction of new technology to the marketplace. The National Science Foundation is funding the two-year, $500,000 project, titled “SENSELET: Sensory Network Infrastructure for Scientific Laboratory Environments.\"  \n“Our goal is to help scientists not have to repeat experiments so many times to find the winning formula,” said principal investigator Klara Nahrstedt, director of the Coordinated Science Lab and the Ralph and Catherine Fisher Professor of Computer Science at Illinois. “Ultimately, we want to speed up the discovery cycle for new innovations.”\nThe team’s goal is to deploy a diverse wireless and sensory infrastructure that collects data and sends it to the cloud, where it will be correlated and synched with instrument data in real-time and on demand.  Along with providing valuable information to researchers, the technology will also help lab managers better understand conditions in the facilities they are in charge of maintaining.\n“Lab environment data gives present status, information on changes and trends, and conditions during a process or measurement,” said Mark J. McCollum, principal research engineer at the Micro & Nanotechnology Laboratory. “Having this history and using it with 4CeeD provides important meta-data as well as a predictive path for management and operational needs in a physical device laboratory. It is exciting how SENSELET will make this conveniently available.”\nSENSELET builds on previous NSF-funded work, which includes the development of the 4CeeD Distributed Data Infrastructure, a Web-based distributed capture, curation, and coordination tool that bridges the network and computing gap between scientific instruments and the remote cloud infrastructure. As part of the work, researchers also developed BRACELET, an edge device infrastructure that enhances security and performance issues that arise when connecting old instruments with the modern 4CeeD cloud infrastructure. 4CeeD operates on a cloud-based smart data management system called Clowder, developed by Illinois’ National Center for Supercomputing Applications.\nIn addition to Nahrstedt, the research team includes Roy Campbell (Computer Science), Kenton McHenry (NCSA), John Dallesasse (MNTL), and Tracy Smith (Campus IT).\n\nSee the original CSL story.\n"}, {"source": "University of Illinois", "title": "Illinois CS Alumni Awards Recipients Talk Chicago, Teamwork, and Procrastination ", "link": "/news/illinois-cs-alumni-awards-recipients-talk-chicago-teamwork-and-procrastination", "date": "November 6, 2018", "content": "\nIllinois Computer Science graduates being honored during October’s Alumni Awards celebration spent more than an hour on October 19 talking about their own experiences and answering student questions.  The panel discussion, moderated by Chair of the Association for Computing Machinery Caren Zeng, touched on, among other things, procrastination, teamwork, and whether it’s best to start a career in Chicago or elsewhere (spoiler: there is no single right answer).\n\n\n\n\n\nIllinois Computer Science Alumni Awards\n\n\nThirteen distinguished Illinois Computer Science alumni were recognized for their professional, technical, educational, or service contributions during the department’s annual Alumni Awards Ceremony and Banquet.\nThe list of awards and honorees included (for more information on each, see our earlier story):\nDistinguished Achievement Alumni Award, Douglas MacGregor (MS CS ’80).\nEarly Career Achievement Alumni Award, Vilas Dhar (BS ’04, along with a BS Bioengineering ’04).\nDistinguished Educator Alumni Awards, Professor Ron K. Cytron, (MS CS ’82, PhD CS ’84), Professor Won Kim (PhD CS ’80), and University of Hawai’i President David Lassner (BA Economics ’76, MS CS ’81).\nEarly Career Educator Alumni Awards, Associate Professor Eric Gilbert (BS Math and CS ’01, PhD CS ’10) and Associate Professor Ron. K. Cytron (MS CS ’04, PhD CS ’09).\nDistinguished Service Alumni Award, Ross Erlebacher (BS CS ’88, MS CS ’89).\nDistinguished Achievement Memorial Award, Professor Gene Gene Golub (BS Math '53, MA Stats '54, PhD Math '59).\nScott H. Fisher Computer Science Teaching Award, Associate Professor Craig Zilles.\nC.W. Gear Outstanding Junior\nFaculty Award, Assistant Professor Ranjitha Kumar.\nDavid J. Kuck Outstanding Thesis Awards, Assistant Professor Matthew Sinclair (PhD CS ’17) and Dimitrios Skarlatos\n(MS CS ’16).\n\n\nMembers of the panel included Douglas MacGregor (MS CS ’80, who is building a cybersecurity program as an adjunct professor at Western State Colorado University); Vilas Dhar (BS ’04, along with a BS Bioengineering ’04, now an investor, entrepreneur, and lawyer); Professor Ron K. Cytron (MS CS ’82, PhD CS ’84, associate chair of Computer Science & Engineering at Washington University); Professor Won Kim (PhD CS ’80, a distinguished professor in the Department of Software at Gachon University in Seongnam, Korea); David Lassner (BA Economics ’76, MS CS ’81, president of the University of Hawai’i); Associate Professor Eric Gilbert (BS Math and CS ’01, PhD CS ’10, John Derby Evans Associate Professor in the University of Michigan’s School of Information); Associate Professor Karthik Pattabiraman (MS CS ’04, PhD CS ’09, University of British Columbia); Ross Erlebacher (BS CS ’88, MS CS ’89, a senior director with Cognizant); and Dimitrios Skarlatos (MS CS ’16, currently a PhD student at Illinois CS).\nRita Patel Jackson (BS Math and CS, ’88, head of global marketing for GE Healthcare’s Healthcare Analytics) also joined the panel. She delivered the keynote address at the previous night’s Women in Computer Science Alumni-Student Dinner.\nSome of the highlights from the panel:\nHOW VIABLE IS CHICAGO AS A PLACE TO BEGIN A TECH CAREER?\nERLEBACHER (who lives and works in the Chicago area): “I think the city’s committed to doing more. Many of the universities – Illinois, Northwestern, (the University of) Chicago – come help build Chicago. I’d say it’s definitely on the upswing.”\nGILBERT: “I’m from Chicago, I think Chicago’s great. … I think for most of my career, I’ve felt the inexorable pull of the Bay Area. And I feel like that’s changing. So in Ann Arbor where I (live), you saw Duo Security get (started), stay there, exit, and continue to stay there. That was unthinkable 10 years ago.”\nMACGREGOR: “I guess my job today is to be the contrarian. … The bigger question’s not where you’re going to go, but what you’re going to be doing through the first 10 years of your career. Work your butt off. The idea that you can just go in and spend eight hours and ‘I’m balanced and I’m more productive’ is total baloney.\n“Go wherever that best opportunity is. And then when you get into your mid-30s and you want to have a family, you want more balance, you want to spend time with kids, that’s great. But you’ve got your career foundation built.”\nLASSNER: “You can do great work anywhere,” citing the example of University of Hawaii Emeritus Professor Norman Abrahamson, who led the development of the ALOHAnet, the first wireless packet network, after beginning his career at Stanford University and the University of California-Berkeley.\n“He decided he wanted to move to Hawaii because he wanted to surf more, joined the Electrical Engineering Department, and invented the ALOHAnet.”\n\n\n\n\n\n\nAlumni Awards Week\n\n\nIn addition to the panel and dinner and awards ceremony, honorees and students enjoyed a keynote address by Mark Tebbe (BS CS '83). (Watch the video.) He is chairman of ChicagoNEXT at World Business Chicago and an adjunct professor of entrepreneurship at the University of Chicago Booth School of Business.\nAward winners enjoyed a working breakfast at the University of Illinois Research Park and your of the National Center for Supercomputing Applications’ National Petascale Computing Facility.\nAs part of the awards weekend, the annual Women in Computer Science Alumni-Student Dinner was also held, including a keynote address by Rita Patel Jackson (BS Math and CS, ’88). (Watch the video.) She is the head of global marketing for GE Healthcare’s Healthcare Analytics organization.\n\n\nWHAT IS YOUR BEST METHOD FOR AVOIDING PROCRASTINATION?\nCYTRON: “You want a healthy balance in life, right? My son, who is now 20 years old, would get up from dinner, go play the piano, go play the ukulele, go play ‘Fortnite’ for a while. So the problem is you do that indefinitely to the effect of never getting your work done. The goal in life is, what you want to do and have to do become the same thing eventually.”\nERLEBACHER: “Usually the things that I procrastinate on were the things that were too big, they were daunting. So my suggestion is find a way to break it down into bits so you can have that satisfaction of, ‘Oh, step one of five, I’ve completed step one.’ Just break it down into smaller problems. That’s what we teach in computer science, right?”\nPATEL JACKSON: “Sometimes (procrastination is) OK. I know how long physically, mentally it’s going to take me to get things done, and I work well under pressure. And not everybody does. … So if you work good under pressure and you can get it done, it’s good quality work, have at it.”\n\nWHAT IS THE KEY TO PRODUCTIVE AND HAPPY TEAMWORK?\nGILBERT: “I think it’s a lot of psychology, actually. Go south of Green Street, take a psychology class.\n“You have to have a shared goal, you have to buy into the goal, you have to have trust with the people who are working that you’re going to have their back – that if I need help you’ll pitch in and help me, but it’s going to be reciprocal.”\nDHAR: “I had an internship when I was a CS student here. I was pretty young, I think it was my first job ever. So I had an assignment and one day, I worked until around 6:30 or so, and most of the people had left. I decided ‘OK, I’m going to go home now.’\n“I walked back in the next morning and I had one of those moments that defined the rest of my career, where the person who was supervising me asked me to come in and we sat down. He said ‘Is this thing done yet?’ I said ‘No, I’m going to do it today.’ He said, ‘Listen, you didn’t get your thing done, so nobody else on the team was able to do their work. Now they’re waiting for you.’\n“And I didn’t go home before 9 p.m. one more night that summer. But more to the point, what happens on teams is you let people own their work. If you really think about them as the owners, the people who make the team succeed, then you don’t have to manage anybody. You let people manage themselves and everybody comes together and gets something done.”\n"}, {"source": "University of Illinois", "title": "Adve’s Research on Memory Consistency Models, Influence on Hardware and Software Worlds Recognized with Kennedy Award ", "link": "/news/adve-s-research-memory-consistency-models-influence-hardware-and-software-worlds-recognized", "date": "October 31, 2018", "content": "\nIllinois Computer Science Professor Sarita Adve has been named the recipient of the 2018 ACM/IEEE-CS Ken Kennedy Award by the Association for Computing Machinery and IEEE Computer Society. The award recognizes her influential work and leadership at the interface of hardware and software.\nAdve is the third Illinois CS professor to win the prestigious award in the past nine years, joining 2010 winner David J. Kuck and 2016 winner William D. Gropp.\nThe 2018 Kennedy Award, which was announced Oct. 31, recognizes Adve “for research contributions and leadership in the development of memory consistency models for C++ and Java, for service to numerous computer science organizations, and for exceptional mentoring.”\nAdve, who is the Richard T. Cheng Professor of Computer Science, said the research behind the award began in her earliest work, at the University of Wisconsin-Madison, where she earned a PhD in 1993.\n“This is an area I started working on as a grad student and continue to work on. That’s quite unusual, but just happened to be a problem that was a really hard problem,” she said. “One of the reasons that it’s hard is that this problem affects both hardware and software. … It’s at the heart of the notion of correct behavior of a computer, and yet this is a part of that puzzle that has been really hard to solve.”\nAdve co-developed the memory models for C++ and Java (with Hans Boehm, Bill Pugh, and others), based on her early work on data-race-free (DRF) models (with her PhD advisor, Mark Hill).  The memory model specifies what value a read of a memory address will return, and is key to the correctness and performance of threaded programs, languages, compilers, and hardware. By impacting the models of the most widely used programming languages, Adve’s work has influenced the worldwide software community and hardware design.\nBut she notes the idea did not take hold overnight.\n“We wrote the first paper in 1990,” she said. “It was very well received. But it took a long time for people to really understand our idea that a memory model should be viewed as a contract between hardware and software where software obeys certain rules (data-race-free) and hardware promises sequential consistency. That this idea struck the sweet spot between programmability and performance took over a decade to really take hold.”\nMore recently, with her students, Adve questioned the conventional wisdom for memory models for heterogeneous systems and showed that DRF is a superior model even for such systems.\nOne of the students who played a key role in that research was Matt Sinclair (PhD CS ’17), now an assistant professor at the University of Wisconsin.\n“Sarita is an excellent mentor, and I've benefited tremendously from the opportunity to work with her and learn from her,” Sinclair said. “In particular, Sarita is really good at treating each person uniquely, and identifying the best way to mentor them and bring out their best.  This is something I strive to emulate in my post-graduate career.”\nAdve’s broader research interests are at the hardware-software interface and span the system stack from hardware to applications. She is also known for her innovations in cache coherence, hardware reliability, and power management.\nPennsylvania State University Emeritus Professor and Illinois Computer Science graduate Mary Jane Irwin (MS CS ’75, PhD ’77) nominated Adve for the award and called her \"a natural and right choice,\" based on her teaching, mentoring, and community service, as well as the impact of her research.\n\"Sarita’s long-term and impactful work on designing and formally specifying memory consistency models has had profound, real-world impact on programmability and productivity in computing,\" Irwin wrote. \"The memory consistency model lies at the heart of the semantics of any threaded software or hardware. Arguably, it has been one of the most challenging and contentious areas in concurrent hardware and software specification for many years.\"\nThe award also recognizes Adve, in part, for her extensive service to the computing community.\n“To be a good researcher is not sufficient in my mind, we need to give back,” she said.\nHer service includes working as the current chair of the ACM Special Interest Group on Computer Architecture (SIGARCH), where she instituted changes that have inspired new energy in the executive committee, leading to new programs in communications, research visioning, and mentoring. With colleagues, she also has made diversity and inclusion a key focus and led the creation of CARES, a committee to provide support to those who experienced harassment at SIGARCH and SIGMICRO sponsored events.\nAdve also serves on the ACM Council and the DARPA ISAT study group and previously served on the board of the Computing Research Association and the NSF CISE advisory committee.\nAdve is a recipient of the Anita Borg Institute Women of Vision award in innovation, the ACM SIGARCH Maurice Wilkes award, and an Alfred P. Sloan Research Fellowship. She is a Fellow of the ACM and IEEE and was named a University Scholar by the University of Illinois.\nThe award will be presented at SC 18: The International Conference for High Performance Computing, Networking, Storage and Analysis, in Dallas, Texas on Nov. 13.\nKuck, who is an emeritus professor, won the 2010 Kennedy Award for “pioneering contributions to compiler technology and parallel computing, the profound impact of his research on industry, and the widespread and long-lasting influence of his teaching and mentoring.” Gropp, who is both the director of the National Center for Supercomputing Applications and the Thomas M. Siebel Chair in Computer Science, was recognized with the 2016 award for “highly influential contributions to the programmability of high-performance parallel and distributed computers, and extraordinary service to the profession.”\nACM and IEEE-CS co-sponsor the Kennedy Award, which was established in 2009 to recognize substantial contributions to programmability and productivity in computing and significant community service or mentoring contributions. It was named for the late Ken Kennedy, founder of Rice University’s computer science program.\n"}, {"source": "University of Illinois", "title": "ThinkChicago Brings City’s Tech Message and Leaders to Illinois CS Students ", "link": "/news/thinkchicago-brings-city-s-tech-message-and-leaders-illinois-cs-students", "date": "October 31, 2018", "content": "\nFrom his office in downtown Chicago, Steve Benni leads a team of technologists for JP Morgan Chase & Co. When it’s time to hire, he loves to compete with his colleagues in New York and Silicon Valley.\nHis edge? Chicago.\n“You talk to people who work in New York, they live in Jersey City. You talk to people who live in Silicon Valley and they’re on the bus an hour and a half,” Benni, the financial firm’s executive director of global technology, said during the ThinkChicago Roadshow on Oct. 25. “I love competing against my peers in JP Morgan. We can beat them on all these metrics.”\nBenni (BS CS ‘00) was part of a panel of tech executives and entrepreneurs who talked to students during the Roadshow stop at Illinois Computer Science.\nThe Roadshow holds events at college campuses around the state and beyond, working to spread the message of ThinkChicago – the public-private partnership that works to develop the city’s technology sector -- and encouraging students to explore the professional possibilities the city holds.\nThe Roadshow stop at Illinois CS offered students the chance to connect with representatives of a number of top Chicago-area companies and the opportunity to listen to a panel of tech leaders talk about the city and the resources it offers.\nIn Benni’s case, he told students that Chicago gives him both the career he wants with JP Morgan and the ability to live nearby with his family.\n“I live about a mile and a half from our office in downtown Chicago, and I’m very much a Chicagoan at heart,” he said. “I’ve raised my kids in the city.”\nLike Benni, Chicago is both home and a professional advantage for Joe Jablonski.\nJablonski (BS EE ‘93) is the co-founder and CTO of Ocient, a data analytics startup, and a veteran of other area tech startups.\n“We hire a ton of young engineers, and they all walk or bike to work,” he told students. “That is an amazing lifestyle.”\nBut Chicago provides advantages to the company beyond a nice way of life for employees, Jablonski said.\nThe past successes of Jablonski and his co-founders – including the $1.3 billion sale of Cleversafe, which two of them were part of -- meant they could have started Ocient anywhere, but chose Chicago, he said.\n“There’s one overwhelming reason, and that’s because of the talent that’s in Chicago,” he said. “It’s worth working there and living there for that reason.”\nAnd Ocient is making the most of the region’s talent. About 75 percent of the 21 employees and interns it hired last summer came from the University of Illinois.\nChicago also has a strong track record of founders who have chosen to remain in the city, and a pool of financing that makes more possible, Jablonski said.\n“In 2004, me and some buddies started a poker game,” he said. “That group (included) the founders of Grubhub, the founders of Groupon, the founders of Cleversafe, and myself,” he said. “At Ocient we probably had 50 venture capitalists begging us to put money into Ocient. It really isn’t a problem.”\nMuch of the discussion also focused on hiring. Most of the members of the panel emphasized that they’re looking for people who are skilled technologists and data scientists, but also have broader aspirations.\n“Are you a good cultural fit? Are you passionate? I don’t want somebody who chose engineering just because they wanted to make a lot of money,” said Miranda Kemp, who is director of AARP’s technology labs at the University of Illinois Research Park. She is also a University of Illinois MBA student.\nLong Hei, who is director of Data Science for CCC Information Services in Chicago, said data science comes first when he hires, but “I’m looking for people who want to put on other hats, not just data science hats, but think about the users -- what do they want?”\n“A good data scientist should be trilingual,” he added, able to dive into math, technology, and business.\nBeth Ladd, who is analytics R&D manager and director of the Caterpillar Data Innovation Lab and CAT Digital Lab at the Research Park, looks for students with a similarly varied skill set.\n“We want folks who are curious, love technology, who are interested in human-centered design,” she said.\nBut at Benni’s group, he said, a love of technology is key.\n“What I’m looking for is somebody who really wants a career in technology, 10 years from now is still going to be doing something technical.”\n"}, {"source": "University of Illinois", "title": "New Center to Accelerate Quantum Information Science and Engineering ", "link": "/news/new-center-accelerate-quantum-information-science-and-engineering", "date": "October 29, 2018", "content": "\nThe University of Illinois at Urbana-Champaign is making a $15 million investment in the emerging area of quantum information science and engineering, a field poised to revolutionize computing, communication, security, measurement and sensing by utilizing the unique and powerful capabilities of quantum mechanics.\nThe centerpiece of the campus effort will be the formation of the Illinois Quantum Information Science and Technology Center.  This will include a major hiring initiative to expand the number of quantum science experts at Illinois across multiple departments throughout the College of Engineering and the campus.  The center will also enable the development of a focused program to educate the next-generation quantum workforce.  The investment will also include state-of-the-art equipment for the fabrication of quantum materials and devices. \nThe center will bring together Illinois’ physicists, engineers, computer scientists and many others to develop new paradigms in quantum information science and technology. They will discover and develop novel quantum algorithms, materials and devices. One of the center’s key projects will be the construction of a multi-node quantum testbed, enabling researchers to explore and implement new ideas for distributed quantum processing and applications of quantum networks. This work will continue the legacy of the contributions of the University of Illinois to the digital information revolution.\n“Quantum science and technology researchers are bold, and they face immense and difficult challenges – like any trailblazer,” said Rashid Bashir, who will become dean of Illinois’ College of Engineering on Nov. 1. “IQUIST will serve as the launching pad of innovations in quantum science and engineering. Building on our past and our current strengths, our scientists and engineers will lead the quantum information revolution to develop a new paradigm in computing and information processing.”\nWith IQUIST, the College of Engineering will also launch new educational initiatives to train the future leaders of quantum scientists and engineers at the graduate and undergraduate levels.  “The New York Times reported on the lack of quantum science and technology talent just last week. It’s crucial, as one of the largest and best engineering and physics programs in the country, to address both the technical and research challenges and the educational and workforce challenges that we face,” Provost Andreas Cangellaris said.\nIQUIST will foster and expand collaborations with industry, national labs and other academic institutions, such as the University of Chicago, Argonne National Laboratory and Fermilab.  As a participant in the Discovery Partners Institute’s Illinois Innovation Network, IQUIST will contribute to strengthening Illinois’ economy through high-tech workforce and next-generation technology development.\n“Our campus has a legacy of groundbreaking contributions to fundamental science and the development of technologies that have shaped society over the past century, including the first automatic computer, magnetic resonance imaging, light-emitting diodes and the first modern internet browser. Not to mention the first computer built and owned by an educational institution,” Chancellor Robert Jones said. “Today, we are pleased to announce near-term concrete actions that will advance this critical area of national need and importance.”\n\nSee the original Illinois News Bureau story.\n"}, {"source": "University of Illinois", "title": "Illinois CS Professors Win NSF Grant To Target Improvements In Computer Efficiency ", "link": "/news/illinois-cs-professors-win-nsf-grant-target-improvements-computer-efficiency", "date": "October 15, 2018", "content": "\nFor many researchers, the quest to continue improving computational speed as Moore’s Law winds down focuses on finding an alternative to the silicon chip. But three Illinois Computer Science professors believe improvements could be found in the inefficiencies of computing systems, and the National Science Foundation believes their idea holds some promise.\nThe NSF has awarded a $1.2 million, four-year grant to Professors Josep Torrellas, Laxmikant V. Kale, and David Padua to work on ways to make existing systems consistently more efficient, which they believe could exponentially improve performance of large servers and data centers. Torrellas is the principal investigator for the project, for which the three will collaborate with chip-maker Advanced Micro Devices.\nThe bottom line, Torrellas said, is CMOS-based computers use energy very inefficiently, for a variety of reasons.\nData has to be gathered from the memory, other chips, or the disk, requiring far more energy than would be used if all operations were performed locally on the processor, he said.\nSecond, many operations use an approach called speculation that consumes a lot of energy and, in many instances, are just plain useless, according to Torrellas.\n“Let’s say a program executes, and hits a branch. The program needs to check a condition to decide which way to go. But processors do not wait to figure out the outcome of the condition before moving on because it’s going to take some time,” he said. “Instead the processor follows one path. Then, if that’s wrong, the hardware scraps everything, and goes the other way.”\nAnd finally, using his own office laptop as a small-scale example as it idled nearby, “This guy is consuming a lot of energy not doing anything,” Torrellas said.\n“So the combination of these three things make a computer orders of magnitude less efficient than it should be.”\nTorrellas is the Saburo Muroga Professor of Computer Science and his research focuses on architecture, compilers, and parallel computing.\nHe and his collaborators are taking a four-pronged approach to the project:\n\nAdapting control theory – which is used across engineering to analyze systems and create feedback loops used to control those systems -- to computer architecture.\nDeveloping hardware controllers.\nExtending runtime systems to actuate on the hardware.\nUsing compilers to generate code that is optimal for a highly-controlled cluster or datacenter.\n\nControl theory, Torrellas explained, presents an early unknown in the project. It is often used in aeronautical engineering and mechanical engineering.\n“How can it be applied to computers? It is an open question,” he said. “Computers are very complicated; building a model of a computer is very hard.”\nThe key, he said, will be to take what he calls an integrated, cross-layer approach to the work.\n“There’s hardware, the operating system, the compiler, the application,” Torrellas said. “All these layers, if you optimize them together, you get a higher impact.”\nTorrellas will focus on the hardware.\n“You’re going to have a large machine built out of nodes, each node will have multiple chips, each chip will have multiple cores,” he said. “You have to build in a hierarchical manner. You control the core, then you control the chip that has multiple cores. Then you have a node that controls multiple chips, and so on.”\nKale, meanwhile, will work on the runtime system. Kale is the Paul and Cynthia Saylor Professor of Computer Science and leads the Parallel Programming Laboratory. His past work includes pioneering research to develop adaptive runtime systems in parallel computing.\n“Power, energy, and temperature are becoming very important issues in extreme-scale computing, even as they are important on cellphones and laptops,” Kale said. “It is an exciting prospect to combine our work on adaptive runtime systems with controllable adaptive hardware at the lower level and compiler support at higher level, via a common framework provided by a control system.”\nPadua is a Donald Biggar Willett Professor in Engineering and his research focus includes optimization strategies. He will focus on designing compilers.\nThe three professors also plan to compare the use of control theory to improve system efficiency with the use of machine learning.\n“Some people are trying to make the systems more efficient by using machine learning -- an algorithm that’s telling me ‘shut this hardware down now’ or ‘move this program here, change the frequency,’ as opposed to control theory, which is based on a more reactive approach,” Torrellas said.\nTorrellas, Kale and Padua also believe the project could serve as a catalyst for interdisciplinary research and education on clusters and data-center technology at Illinois.\n"}, {"source": "University of Illinois", "title": "Siebel Chair Gift Keeps Giving To Gropp And Illinois CS Researchers ", "link": "/news/siebel-chair-gift-keeps-giving-gropp-and-illinois-cs-researchers", "date": "October 12, 2018", "content": "\nAs a young researcher, Bill Gropp worked in a world where scientists with bright ideas could find the funding to explore them before they had any results in hand.\nThat world has radically changed, Gropp says, requiring researchers to have at least some promising findings before they can secure the money to see their ideas through.\nBut as the Thomas M. Siebel Chair in Computer Science, Professor Gropp has a tool that lets him sometimes turn back the clock.\nThe chair gives Gropp money he can use at his discretion to launch the kind of “curiosity-driven research” that he says often leads to truly transformative ideas.\n“It’s seed money – incredibly valuable seed money,” said Gropp, who is also director of the National Center for Supercomputing Applications. “This is what’s really valuable with the resources that come with the chair. It gives you this opportunity to explore without having to wedge it into your grant funding or finding some other way to do it on a shoestring.”\nThe Siebel Chair in Computer Science was established in 2013 with a $2 million gift from the Thomas and Stacey Siebel Foundation, the charitable organization established by Illinois Computer Science alumnus Thomas Siebel (BA History ’75, MBA ’83, MS CS ’85).\nSiebel, who is the chairman and CEO of enterprise software company C3 IoT and before that founded Siebel Systems, is an active philanthropist. The foundation supports efforts related to everything from energy solutions and public health to caring for the homeless.\nThe Siebel Chair reflects two of Siebel’s other philanthropic passions: research and education.\nDiscussing his long history of major gifts to the University of Illinois, Siebel told The News-Gazette in 2014 that the guiding philosophy for philanthropy is \"Make change happen.\"\nGropp became the first Siebel Chair after coming to the university from Argonne National Laboratory in 2007. He had a track record of pioneering the kind of change Siebel talked about. Gropp and collaborators designed the Message Passing Interface, or MPI, the standard that is essential to the parallel processing now at the heart of supercomputing.\nGropp came to Illinois Computer Science as the Paul and Cynthia Saylor Professor in Computer Science, a position that provided him with resources and possibilities beyond the typical faculty position.\nThe Siebel Chair gives Gropp even more, including links to Siebel’s other on-campus endeavors – the Siebel Scholars and the new Siebel Center for Design.\n“Part of having that chair is interacting with these other things,” Gropp said. “I’ve had some really good discussions with Rachel Switzky, the new head of the Siebel Design Center.”\nAnd, in the bottom-line research world Gropp talked about, the chair provided greater financial resources.\n“I do have more flexibility in saying I can absolutely afford a student on this for a couple of years. … I just don’t have to worry about it,” Gropp said.\nErin Molloy is one of several students now working on projects started at least in part with money from the Siebel Chair. Molloy is a CS PhD student being advised by both Gropp and Founder Professor of Engineering Tandy Warnow, whose primary research area is bioinformatics and computational biology.\nMolloy is working to scale species tree estimation to build out the tree of life, a problem that involves a lot of data, highly parallel computing, and algorithms that produce very precise results.\n“The work that Erin is doing I think is going to be really transformative,” Gropp said. “She was sort of marrying the algorithmic work that Tandy does with the high-performance computing work that I do to create new methods for going after very big and very difficult problems.”\nProjects like Molloy’s, he said, remind him of work that happens at companies like Google and 3M that give employees time and other resources to – as Gropp likes to say – just explore. Using the 3M example, he points out that Post-it Notes grew out of such freedom.\n“We’re lucky enough to have this flexibility, we can still do the curiosity-driven work that often is going to generate the most important ideas, I think,” Gropp said. “People who don’t have to run in the rat race of bringing in the funding don’t understand how much time we now spend chasing funding as opposed to working on developing new ideas.”\n \n"}, {"source": "University of Illinois", "title": "Professor Jiawei Han Joins Select Group With Funai Achievement Award ", "link": "/news/professor-jiawei-han-joins-select-group-funai-achievement-award", "date": "October 12, 2018", "content": "\nThe Funai Achievement Award is Japan’s highest honor for information science, and before 2018 only three non-Japanese researchers had ever won it.\nIllinois Computer Science Professor Jiawei Han last month became the fourth, when he was announced as the 2018 winner.\nThe Information Processing Society of Japan awarded Han “for his pioneering work on Data Mining, Information Network Analysis, Database Systems, and Data Warehousing.”\nHan, who is an Abel Bliss Professor in Engineering, described in understated fashion one of the primary reasons he was honored.\nIn the 1990s, “A lot of people in the U.S. and Japan were thinking about getting into data mining, and I was kind of an early bird.”\nIllinois Computer Science Interim Department Head Vikram Adve noted that, Han’s modesty aside, the award was both a remarkable honor and well deserved.\n“This is a highly prestigious award, and extraordinarily few outside Japan have received it,” Adve said. “Professor Han is the perfect choice for this award, because of his outstanding technical contributions in the field of data mining, his long-standing leadership of the community, and his mentoring of numerous leaders in the younger generation of data mining academics and researchers.”\nThe only other non-Japanese winners of the Funai Achievement Award are ACM Turing Award winners Alan Kay (2002) and Marvin Minsky (2003), as well as William J. Dally (2015), Nvidia Corporation’s chief scientist.\nProfessor Shojiro Nishio, the president of both Osaka University and the Information Processing Society of Japan, introduced Han at the society’s September conference with a long list of the Illinois CS professor’s accomplishments:\n\n  A founder of the data mining research field, and author of a textbook on the subject which has been widely adopted internationally for two decades.\n  One of the most cited authors in computer science (ranked top three among CS researchers, according to Google’s H Index).\n  The inventor of a set of influential frequent-pattern mining algorithms.\n  Creator of a subfield of mining heterogeneous information networks.\n  Recognized with numerous awards, including ACM Fellow, IEEE Fellow, ACM SIGKDD Innovation Award, IEEE Computer Society Technical Achievement Award, and IEEE Computer Society W. Wallace McDowell Award.\n  Advised a number of influential PhDs – 35 students have completed PhDs from Illinois CS under Han.\n\nHan said that his “early bird” status in data mining grew out of his PhD work at the University of Wisconsin between 1979 and ’85.\n“I was thinking, ‘In the future, the database must be integrated with artificial intelligence,’” Han said. “You have a huge amount of data. You want to make them into patterns and rules. If you really want to make good use of the data, you have to somehow make the data intelligent.”\nHis first paper on data mining, in 1989, actually predated the term and instead used the term KDD, knowledge discovery in databases.\nNow Han leads the Data Mining Group at Illinois Computer Science.\nHan also played a key role in creating the ACM SIGKDD Conference on Knowledge Discovery and Data Mining.\nThe gathering now draws several thousand people a year, but started as a small workshop on the sidelines of the International Joint Conference on AI in 1989.\nThe first drew 20-30 people, but the interest quickly grew along with the fascination in data mining and what it might make possible. The first KDD conference was held in 1995, and Han co-chaired the second the next year.\n“Now, everyone is talking about deep learning,” Han said. “Then, everyone was talking about data mining.”\n"}, {"source": "University of Illinois", "title": "Four From Illinois CS Chosen For 2018 Rising Stars In EECS Workshop ", "link": "/news/four-illinois-cs-chosen-2018-rising-stars-eecs-workshop", "date": "October 12, 2018", "content": "\nThree Illinois Computer Science PhD students and a post-doctoral researcher have been chosen to be part of the 2018 Rising Stars academic career-building workshop at the Massachusetts Institute of Technology.\nIllinois CS doctoral students Sangeetha Abdu Jyothi, Shadi Noghabi, and Mengjia Yan and post-doctoral researcher Qi Li were chosen to participate in this year’s workshop, which will be Oct. 28-30.\nRising Stars provides women graduate students with mentoring and practical information to help launch and sustain academic careers.\nA look at the four Illinois CS women who will be attending:\n \nSixth-year PhD student Sangeetha Abdu Jyothi expects to enter the job market this fall, and sees the workshop as an ideal way to get a glimpse of what life as an academic might be like.\n“It covers a wide range of topics ranging from faculty recruitment process to research funding, teaching, and mentoring. I believe that this would greatly help me when I go on the academic job market this year and in my career beyond,” said Jyothi, whose advisor is Associate Professor Brighten Godfrey.\nJyothi’s research is focused on networking and systems, with a goal of reducing the Internet’s latency.\nShe won both the Facebook Graduate Fellowship and the College of Engineering’s Mavis Future Faculty Fellowship. Jyothi also was a research intern at Microsoft Research in 2015 and a software engineering intern at Google in 2014.\nShe said she is looking forward to the opportunity to listening to senior faculty talk about their career experiences.\n“I believe that understanding the challenges they faced, their successes and pitfalls, can help me in planning my career ahead,” she said.\n\nShadi Noghabi is a fifth-year PhD student, closing in on her degree as she works at Microsoft Research.\nMIT Rising Stars, she says, is perfect preparation for her “ultimate” path, a research-driven academic career.\n“My passion is to work on cutting-edge and challenging problems. Generally, academic research is a perfect fit for what I am looking for as I get to work on emerging problems, continuously have the stimulation of exploring new areas, while also being able to have an impact and solve real-world problems,” said Noghabi, who is advised by Professors Indranil Gupta and Roy Campbell.\nNoghabi’s research interests are distributed systems, cloud computing, big data, and edge computing, with work focusing on geo-distributed large-scale objects stores and stream processing systems.\nHer work has been published in SIGMOD and VLDB, and her research has contributed to a number of production open-source projects. They including Ambry, LinkedIn’s geo-distributed object store; and Samza, an Apache project used by more than 15 companies. Noghabi also is a recipient of the Microsoft Research Dissertation Grant and the Mavis Future Faculty Fellowship.\n“This workshop is a unique opportunity to meet the top fellow students with a similar interest in academic research, along with learning from many successful academic professors about the challenges of an academic career path,” Noghabi said.\n\nMengjia Yan is a fifth-year PhD student who focuses on computer architecture with an emphasis on hardware support for security. She is particularly interested in cache-based covert side channel attacks, in which an attacker is able to stealthily monitor a system and steal information through cache vulnerabilities.\nYan is advised by Professor Josep Torrellas, and sees Rising Stars as an opportunity to learn from experienced faculty and to network, all in the pursuit of her goal of a career in academia.\n“I would like to keep doing research and contribute to the field of computer architecture and security as my career goal,” she said. “I am also determined to contribute in motivating and supporting more women to work in computer science and engineering.”\nYan has interned at NVIDIA research and has won both a Mavis Future Faculty Fellowship and Illinois Computer Science’s W.J. Poppelbaum Memorial Award.\n\nComing to Illinois CS in 2017 as a post-doctoral researcher, Qi Li is focused on data mining and machine learning, in particular the collection and aggregation of information from multiple data sources. She is working with Professor Jiawei Han.\nShe says she enjoys both teaching and research, and has started working as an adjunct instructor this fall. The workshop will give her an opportunity to take further steps toward the academic career she wants to pursue.\n“I want to introduce my work and myself to the fellow computer scientists and look for future collaborations,” Li said. “I am very looking forward to the panels and discussions.”\nLi has received awards for the Presidential Fellowship of University at Buffalo, where she earned her PhD, as well as the Best CSE Graduate Research Award, and the CSE Best Dissertation Award at Department of Computer Science and Engineering University at Buffalo.\n"}, {"source": "University of Illinois", "title": "Marinov Leads Team Trying to Speed Up, Improve Reliability of Continuous Integration ", "link": "/news/marinov-leads-team-trying-speed-improve-reliability-continuous-integration", "date": "October 1, 2018", "content": "\nContinuous integration (CI) has become an increasingly important part of software creation, but developers are often limited by its speed and reliability.\nAs part of a $1.2 million grant from the National Science Foundation, Illinois Computer Science Professor Darko Marinov and two collaborators will devote $437,000 to a project they hope will eventually provide a set of publicly available tools to improve CI.\nContinuous integration is the practice of regularly merging changes in software code into one shared version, not quite literally as they happen but typically multiple times a day. As the changes are integrated, regression tests are run to find out whether changes introduce bugs into the code.\n“Developers do these actions typically several times per day. It can take anywhere from five, 10 minutes to literally hours (for each),” Marinov said. “If this thing is going to take two hours to give them the result back, they’re just going to idle -- they’re going to start reading emails, go on the web. It’s hard for them to start on a new technical task because by the time this comes back it could tell them, ‘Oh, you broke something, go and revise that.’”\nDevelopers, he added, often face a tradeoff: speed versus quality.\n“In principle I can give you the answer almost immediately, but its (quality is) very bad: ‘I think you broke something but I don’t know what’,” Marinov said.\nTo improve the performance of CI, Marinov and his collaborators, Assistant Professor Jonathan Bell of George Mason University and Assistant Professor Lingming Zhang of the University of Texas at Dallas, will focus on three things.\nThey hope to improve test selection – learning what needs to be tested based on the changes that have been made in the code and what doesn’t need to be tested – to speed up regression testing.\n“It learns what we technically call dependencies – it learns some relationships between the test and the code. Then when you make the change, it simply asks, which of the tests have their dependencies changed?” Marinov said. “If a test had no dependency change, then it cannot change behavior.”\nThey also hope to improve reliability by focusing on so-called flaky tests – tests that themselves have bugs and incorrectly indicate problems in the code. And, finally, they hope to provide tools to help developers debug problems.\nMarinov, Bell, and Zhang all have experience building testing tools used both in academia and in industry for companies such as eBay, Google, Groupon, Microsoft, and Yahoo!\n"}, {"source": "University of Illinois", "title": "'Women and Ideas in Engineering: Twelve Stories From Illinois' ", "link": "/news/women-and-ideas-engineering-twelve-stories-illinois", "date": "September 27, 2018", "content": "\nBetween the point in 1879 when Mary Louisa Page became the first woman to graduate from the University of Illinois College of Engineering and 1905, four women earned degrees from the college.\nBut between those early decades and 2016, when 47 percent of the incoming freshmen in the Department of Computer Science were women, numerous influential women earned degrees from the college and helped shape its future. A new book tells the stories of 12 of them.\n“Women and Ideas in Engineering: Twelve Stories From Illinois” was written by Laura D. Hahn, the director of the university’s Academy for Excellence in Engineering Education, and Angela S. Wolters, director of Women in Engineering for the university.\nThe book includes stories of key figures from Computer Science, among them Google Director of Engineering for Chrome Parisa Tabriz, PhD graduate and former Adjunct Teaching Professor Cinda Heeren – who wrote her own reflections on computing and teaching -- and Professor Geneva Belford.\n\"Geneva was tough and practical, yet energetic and generous with her time,” said one of Belford’s most well-known students, C3 IoT CEO and founder Thomas M. Siebel.\nThe book is available from the University of Illinois Press. The authors also invite readers to follow as more stories of women engineers are posted at the college’s Women in Engineering website.\nExcerpts from the book:\n\nGeneva Belford \n1932-20l4, PhD Math ‘60\nShe advised more than 140 graduate students, and toward the end of her career, she helped scores of additional students through her role as the graduate program coordinator in the CS Department.\nAccording to CS Professor Roy Campbell, Geneva was unique because she regularly advised masters-level students while most faculty members preferred working with doctoral-level candidates. \"She was always very welcoming and provided support for many students [interested] in distributed systems and networking,” Campbell said. “She also took on a few atypical students, who didn't have a CS background.”\nOne of those students was Tom Siebel (BA History, 1975), who entered the CS master's program in 1983 while working on an MBA at Illinois. He earned his MS in CS in 1985 and went on to found Siebel Systems, a customer relationship management (CRM) firm that was later acquired by Oracle for $5.8 billion. In 2014, Siebel described his CS experience as a life-changing event. \"Geneva was tough and practical, yet energetic and generous with her time,” Siebel said in a video tribute to his advisor when she won a 2012 CS department service award. \"She encouraged exploration, experimentation and creativity. She was an important catalyst in my professional career.”\n\nCinda Heeren\nSenior instructor in Computer Science at the University of British Columbia, PhD CS ‘04\n“I've loved computing for decades but my perceptions of the craft of designing algorithms and writing code have changed in a very subtle way in just the last few years. …\n“A few years ago, partly because I missed my Grammy, I picked up my knitting needles and searched for a project of appropriate scope and beauty. What I found instead was a connection to computing that I didn’t expect: the language paradigms used to describe knitting patterns and procedures (are) composed of exactly the same elements as that of C++ or Python or any other modern computing language. Iteration, abstraction, conditionals, and the stitches themselves form a configuration analogous to some kind of data structure. I am not the first one to have made this observation, but it has created in me a new sensitivity to the ways in which handcraft is communicated, and most poignantly, it reinforces the idea that computing constructs are more general in their application to computing devices.\n“Somewhat later, in the summer of 2013, I spent one day in a textile museum in Guatemala City, Guatemala. My earlier observations about the knitting patterns were reinforced, and I was increasingly touched, because the art of weaving is hundreds of years old and yet the handicraft itself illustrates these same computing constructs. …\n“The computing of today has its roots in traditions of handcraft, art, and music, and the minute we all admit that fact, we have the ability to break down barriers. With this in mind, I will infuse my teaching with these connections and broaden the historical view of our field, primarily because I do not want artificial barriers to participation. Besides, arts and crafts are beautiful and expressive and human.”\n\nParisa Tabriz\nGoogle Director of Engineering for Chrome, BS CS ’04, MS ‘06\nWhen she needed to print business cards for a security conference she was attending in Japan, she chose Security Princess … not because Parisa is \"the princess type\" -- she's practical and down-to-earth -- but because it was “cute and a bit more whimsical.” There's irony there, too. Parisa proudly acknowledges being a woman in a field dominated by men. …\n…\nForbes included her on its 2013 “30 under 30” list of tech pioneers, Wired named her to the 2017 List of 20 Tech Visionaries who are Creating the Future, “CBS This Morning” has profiled her, and she's been featured in the popular media. Even so, she wasn't always confident in her role as a woman engineer. “I wasn't secure in college,” she reflects. “I switched majors. ... Every semester was like, 'Is this worth it? Am I doing this?' And I think women struggle with that [uncertainty] much more.”\nBy candidly sharing her college and career experiences, Paris a hopes to dispel some of the myths she feels exist about studying computer science and finding careers in high tech. “I didn't have this passion or this drive to know what I wanted to do, and I also didn't start programming until my freshman year. It's a myth that you need to have been doing this since childhood.”\n"}, {"source": "University of Illinois", "title": "'They’re Teaching The Same Material With The Same Academic Rigor'  ", "link": "/news/they-re-teaching-same-material-same-academic-rigor", "date": "September 19, 2018", "content": "\nIn a new special report, Inside Higher Ed focuses on online degree programs and other emerging means of delivering education to students.\nThe report includes portions of an interview with Professor John C. Hart, the director of Online and Professional Programs in Illinois Computer Science, and casts the department as a leader in online programs.\nThe full report, “On-Ramps and Off-Ramps: Alternative Credentials and Emerging Pathways Between Education and Work,” sits behind a pay wall, but in this excerpt, Hart discusses what students can expect from the online program:\n \nMuch of the action with alternative credentials and pathways is occurring with online graduate programs. The University of Illinois at Urbana-Champaign is at the forefront of this experimentation and now offers three master’s degrees through the online platform from Coursera, the MOOC provider. The university’s master’s of computer science and business administration (the iMBA) have the largest enrollments of any graduate program at the university.\nPotential students can take two open online courses on Coursera as an introduction to the degree programs, says John C. Hart, a professor of computer science at Illinois and director of online and professional programs in computer science. Those course bundles serve as an admissions funnel for capable working adults.\nThe three Coursera degree programs, which include elements of self-pacing for students who work full-time, are priced at $21,000 in total tuition and fees, roughly half the price of their campus-based equivalents. But faculty members teach the online version with equal rigor to the parallel campus-based version.\n“They’re teaching the same material at the same level with the same academic rigor,” says Hart.\n \nThe report also devotes some reporting to the Gies College of Business’ iMBA and its financial details:\nThe University of Illinois at Urbana-Champaign began its fully online iMBA with Coursera in 2016. The same university faculty members teach both the online and campus-based versions. But the iMBA’s total price is $22,000, with tuition of $250 per credit, compared to the more than $57,618 in tuition and fees that in-state students enrolled in the university’s residential M.B.A. program can expect to pay, and the $82,026 in tuition for out-of-state students. Applicants to the iMBA also are not required to take the GMAT or GRE.\nIllinois also offers online versions of master’s degrees in computer science and accountancy on Coursera. And earlier this year, a first cohort of 76 students graduated from the iMBA program, which enrolled 1,600 students this spring. The program’s retention rate was 92 percent, according to the university. Its average student is 37 years old with 12 years of work experience.  \n“They’re not going in debt,” says Ray Schroeder of the University of Illinois at Springfield, who is also founding director of the National Council for Online Education at the University Professional and Continuing Education Association (UPCEA).  He predicts substantial growth in MOOC-powered graduate programs because they are accessible, affordable and tend to be demand driven. \n“It’s really teaching at scale, using technology,” says Schroeder. “They’ve got all the pieces.”\nExperts say Coursera and edX can skim smaller percentage fees than traditional OPMs do from the online programs they run with colleges. Spruce Point Capital Management, an investment firm that has a short-selling position on 2U, used a public records request to find that Illinois pays a 40 percent tuition revenue fee to Coursera, less than the 60 percent or more OPMs historically have charged. MOOC platforms also will have a head start on short-term master’s programs if those credentials take off. So will highly selective universities, Schroeder says, both with alternative and more conventional online graduate programs. \n“The large universities have the resources to capitalize on these ventures,” he says, adding that a graduate degree market shift could be hard on vulnerable public and private colleges. “They’re the ones who are really going to be hurt.”\n \n"}, {"source": "University of Illinois", "title": "Illinois Computer Science Honors Achievements of 13 Alumni and Faculty ", "link": "/news/illinois-computer-science-honors-achievements-13-alumni-and-faculty", "date": "September 18, 2018", "content": "\nIllinois Computer Science will hold its eighth annual Alumni Awards Ceremony and Banquet on October 19, recognizing 13 alumni and faculty who have made professional, technical, educational, or service contributions that bring distinction to themselves, the department, and the university.\n\n\n \n\nIf you know of an outstanding CS alumnus who deserves recognition, make sure that the department knows! Join the tradition and make a nomination.\nSubmit a Nomination\n\n\n\nThis year's Keynote Speaker is Mark Tebbe (BS CS '83), who is currently the Chairman of ChicagoNEXT at World Business Chicago and an adjunct professor of entrepreneurship at the University of Chicago Booth School of Business. Join us for his talk on Friday, Oct. 19 at 3 p.m. in Siebel Center 1404.\nAs part of the awards weekend, the annual Women in Computer Science Alumni-Student Dinner will be at 7:30 p.m. on Thursday, Oct. 18 in Siebel Center 2405. Rita Patel Jackson (BS Math and CS, ’88) will be the keynote speaker. She is the head of global marketing for GE Healthcare’s new Healthcare Analytics organization.\n \nDistinguished Achievement Alumni Award\nDouglas MacGregor’s career has included key technical and executive roles in industry, and work in the academic world.\nMacGregor (MS CS ’80) joined Motorola as the microcoder and micromachine architect for the company’s MC68010 and MC68020 microprocessors. Based on his work, he was awarded 24 patents and the 1985 IEEE Browder J. Thompson Memorial Prize Paper Award (with David S. Mothersole).\nHe later earned a PhD at Kyoto University, one of the first Americans to earn an engineering degree from a leading Japanese university, and while there founded Solbourne Computer. The joint venture with Matsushita built Sun-compatible workstations and servers.\nIn 1993, MacGregor joined Dell Computer, where he was general manager of the desktop business, procurement, and the notebook business. He left Dell to become a fellow in a leadership initiative at Harvard Business School.\nNow, after completing an MS in cybersecurity from Johns Hopkins University last year, he is building a cybersecurity program as an adjunct professor at Western State Colorado University.\n\nEarly Career Achievement Alumni Award\nAs an entrepreneur, venture investor, and philanthropist, Vilas Dhar (BS ’04, along with a BS Bioengineering ’04) is a global leader in the field of social impact.  His commitment to creating broader access to justice, catalyzing the development and deployment of humanitarian technology, and to championing the work of nonprofit social leaders led him to found, scale, and exit two successful companies before the age of 35, and has made him a noted senior adviser to global companies and emerging-economy governments.  \nVilas developed his commitment to technology for good as an undergraduate in computer science and bio-engineering at the University of Illinois.  Vilas went on to receive a JD from New York University School of Law and a Masters in Public Administration from Harvard University.\nVilas has served as the Gleitsman Fellow on Social Change at the Harvard Kennedy School of Government, a trustee of a major global foundation, a member of the Board of Directors of several global technology companies, and continues to support and mentor social entrepreneurs, CEOs and policymakers. Through his private office and philanthropic activities, Vilas now focuses on finding, supporting, and championing global changemakers.\n\nDistinguished Educator Alumni Award\nWith research focused on parallel processing, static analysis, and automatic storage management, Professor Ron K. Cytron has had a long, productive career in both academia and the private sector.\nCytron (MS CS ’82, PhD CS ’84) is the associate chair of Computer Science & Engineering at Washington University. The school has recognized him with multiple teaching awards, including Northcutt-Coil Professor of the Year and the Founders Day Distinguished Faculty Award.\nCytron has been chair of the Association for Computing Machinery's special interest group on programming languages, SIGPLAN, and editor-in-chief of TOPLAS, the journal for reporting research advances in programming languages and systems. SIGPLAN recognized Cytron with its Distinguished Service Award.  In 2010, he was elected ACM Fellow “for contributions to algorithms and implementations of automatic program parallelization.”\nBefore joining Washington University in 1991, Cytron was a research staff member at IBM’s Thomas J. Watson Research Center.\nIn 2003, he co-founded Exegy, a St. Louis–based company that provides hardware-accelerated platforms for financial market trading and data analysis.\n \nWon Kim (PhD CS ’80) is a distinguished professor in the Department of Software at Gachon University in Seongnam, Korea, and managing director of the National Program of Excellence in Software.\nKim also has deep experience in industry and is considered a pioneer of object-oriented database technology, object-relational database technology, and information integration technology. He is also recognized as an expert in data management, knowledge discovery, and Internet technology.\nIn 2006, when he was recognized with the ACM SIGKDD Service Award, Kim was cited as instrumental in creating SIGKDD, including serving as its first chair.  He also served as the Chair of ACM SIGMOD for nearly a decade. In 1995, he was elected ACM Fellow “for fundamental insights into query optimization in relational databases, support for engineering applications, and functionality and architecture of object-oriented databases, and for extensive editorial service.”\nKim has worked as a researcher at IBM’s Almaden Research Center and at Microelectronics and Computer Corp. He was the founder and CEO of UniSQL, Inc. and Cyber Database, Inc., before becoming senior vice president and software advisor at Samsung Electronics.\nHe also later served as an advisor to a number of other companies, among them Zener Systems and LG Electronics.\n \nDavid Lassner (BA Economics ’76, MS CS ’81) is the president of the University of Hawai’i and also interim chancellor of the University of Hawaiʻi at Mānoa, the flagship research campus of the UH System.\nHe began his career at the university in 1977, and is focused on helping the state’s residents earn college credentials and developing an innovation sector to strengthen Hawai’i’s economy.\nLassner has served as principal investigator for $400 million in federal awards at the University of Hawaiʻi. He also led the federally funded project that interconnected all public schools, libraries and campuses on Hawai’i’s six islands with fiber optics, and is principal investigator for the Maui High Performance Computing Center and for the Pacific Disaster Center.\nIn addition, Lassner is a commissioner of the Western Interstate Commission on Higher Education, a board member and vice chair of the National Association of System Heads, and a member of the Board of Governors of the East-West Center.\n\nEarly Career Educator  Alumni Award\nEric Gilbert is the John Derby Evans Associate Professor in the University of Michigan’s School of Information and a professor of Electrical Engineering and Computer Science at the university.\nBefore coming to Michigan, Gilbert (BS Math and CS ’01, PhD CS ’10) led the comp.social lab at Georgia Tech.\nGilbert is a sociotechnologist, with a research focus on building and studying social media systems. His work has been supported by grants from Facebook, Samsung, Yahoo!, Google, the National Science Foundation, the U.S. Army Research Laboratory, and the Defense Advanced Research Projects Agency.\nGilbert's work also has been recognized with multiple best-paper awards. He is the recipient of an NSF CAREER Award and two teaching recognitions at Georgia Tech: the Young Faculty Award from the Sigma Xi chapter and the Class of 1969 Teaching Fellow.\n \nKarthik Pattabiraman (MS CS ’04, PhD CS ’09) is an associate professor of electrical and computer engineering at the University of British Columbia, where he has been since 2010.\nPattabiraman’s research is focused on “good enough computing” – building affordable error-resilient software systems – as well as software engineering and security.\nHe was recognized in 2015 with a Discovery Accelerator Supplement Award in 2015 from the Natural Sciences and Engineering Research Council, the Canadian federal agency that funds research in the natural sciences and engineering. His award was for his project, “Building Error Resilient Software on Next Generation Computing Platforms.” Pattabiraman’s work has also been recognized with multiple distinguished paper or runner-up awards.\nAt UBC, Pattabiraman received the 2016 Killam Faculty Research Fellowship.\nPattabiraman is a senior member of the IEEE, and a member of the International Federation for Information Processing Working Group on Dependable Computing.\n\nDistinguished Service Alumni Award\nRoss Erlebacher has spent most of his professional career as a management and technology consultant working with health insurance companies on their business and information technology strategies. He is now a senior director with Cognizant.\nErlebacher (BS CS ’88, MS CS ’89) started his career as a software engineer at AT&T Bell Laboratories, where he developed and designed real-time software solutions for graphical displays and networking platforms.\nHe also earned an MBA from Northwestern, and has worked for other consulting firms including Andersen Consulting (now Accenture) and Deloitte. \nErlebacher is a devoted alumnus and has served the university as a member of the Illinois Computer Science Alumni Advisory Board and the Illini Leadership Council, as well as being a mentor to Illinois Promise students. Ross and his wife, Susan Silver (BA Economics, ’88), also have long supported undergraduate scholarships at Illinois with gifts to Illinois Computer Science and Economics. They established the Susan Silver and Ross Erlebacher Scholarship.\n\nDistinguished Achievement Memorial Award\nWell known for creating algorithms and software that allowed researchers to run large engineering and scientific calculations effectively on computers, Gene Golub (BS Math '53, MA Stats '54, PhD Math '59) was a cofounder of the Stanford University Computer Science Department. He served on the Stanford faculty from 1962 until his death in 2007.\nIn 1964, Golub created the singular value decomposition (SVD) algorithm. It is used in a variety of applications, including search engines, signal processing, and data analysis.\nGolub was a member of both the National Academy of Science and the National Academy of Engineering.\nHis contributions to the engineering and computer science fields were internationally recognized, with 10 honorary degrees from institutions around the world. He also co-authored 18 books and about 250 papers.\nThe Gene Golub Fellowship, Franz Hohn and J.P. Nash Scholarship, and Gene Golub Computer Science Visionary Scholarship Fund were established because of his love for students and desire to support them. He also established the Paul and Cynthia Saylor Professorship in Computer Science in honor of his longstanding friendship with the Saylors.\n\nScott H. Fisher Computer Science Teaching Award\nCraig Zilles is an associate professor whose current research focuses on applying computing and data analytics to education, including the development of the Computer-Based Testing Facility.\nIn the past his research has focused on the interaction between compilers and computer architecture, especially in the context of managed and dynamic languages. He also developed the first algorithm that allowed the rendering of arbitrary three-dimensional polygonal shapes for haptic interfaces.\nZilles received the IEEE Education Society's 2010 Mac Van Valkenburg Early Career Teaching Award and is a recipient of an NSF CAREER Award, the College of Engineering's Rose Award and Everitt Award for Teaching Excellence, Illinois Student Senate Teaching Excellence Award, and Campus Award for Excellence in Undergraduate Teaching.\nHis research has been recognized by best-paper awards from ASPLOS in 2010 and 2013 and by selection for inclusion in the IEEE Micro Top Picks from the 2008 Computer Architecture Conferences.\n\nC.W. Gear Outstanding Junior Faculty Award\nRanjitha Kumar is an assistant professor and leads the Data Driven Design Group. She and her students use data mining and machine learning to address the central challenge of creating good user experiences: tying design decisions to desired outcomes.\nThis year alone she has received an Amazon Research Award for her project, “An Experimentation Engine for Personal Fashion,” an AWS Machine Learning Research Award for another project, “Using Fashion to Learn Material Similarities,” and an NSF CAREER Award for her work building a platform that aggregates design features and user interactions from existing mobile apps.\nEarlier in her career, Kumar was given a Google Faculty Research Award to “Design Mining Android Apps at Scale” and an Adobe Systems Research Award for “Probabilistic Generative Models for Mobile Design.”\nIn 2015 she was included as part of the university’s List of Teachers Ranked as Excellent by their Students.\n\nDavid J. Kuck Outstanding Thesis Awards\nAs a graduate student, Matthew Sinclair (PhD CS ’17) worked with Professor Sarita Adve on building efficient memory hierarchies for tightly coupled heterogeneous systems. This work improved the performance and energy efficiency of these systems by designing more efficient coherence protocols, consistency models, and memory organizations.\nSinclair’s doctoral thesis, “Efficient Coherence and Consistency for Specialized Memory Hierarchies,” also was recognized with an honorable mention as part of the first-ever group of ACM SIGARCH/IEEE CS TCCA Outstanding Dissertation Awards. Two papers on the topic also were recognized as IEEE Micro Top Picks Honorable Mentions.\nSinclair is now an assistant professor at the University of Wisconsin-Madison, after spending a year as a postdoctoral researcher at AMD Research.\n \nCurrently a PhD student at Illinois Computer Science, Dimitrios Skarlatos (MS CS ’16) focuses on building practical computer architectures and systems for cloud computing. His master’s thesis was on “Opportunistic Power Reassignment between Processor & Memory in 3D Stacks.”\nSkarlatos, whose advisor is Professor Josep Torrellas, is the recipient of the Illinois Computer Science Excellence Fellowship.\nSkarlatos also has a diploma in Electronic and Computer Engineering from the Technical University of Crete.\n"}, {"source": "University of Illinois", "title": "No Straight Lines: Influential Illinois CS Professors Helped MacGregor Chart Unconventional Course  ", "link": "/news/no-straight-lines-influential-illinois-cs-professors-helped-macgregor-chart-unconventional", "date": "September 18, 2018", "content": "\nWhen he arrived at Illinois Computer Science in 1979, Doug MacGregor was a man in a hurry.\nComing out of the U.S. Navy, MacGregor was already married and had a young child. He wanted to get an advanced degree and needed to get to work as soon as he could.\nBut in his 18 months at Illinois, MacGregor (MS CS ’80) found more than a path to a job. He found tools and support that would steer him onto the winding, rewarding road he’s still on today.\n“There aren’t too many straight lines,” MacGregor said, laughing about his unconventional path, one that as of this year includes an Illinois CS Distinguished Alumni Achievement Award.\nHe ventured to the then-developing tech hub in Austin, Texas, then to Japan – for school and work – and on to Colorado, Boston, and Austin (again), before landing in his current home, Western State Colorado University in the Rocky Mountains.\nAlong the way, he worked for Motorola and Dell Computer, co-founded a joint venture with Matsushita, and earned his PhD at Kyoto University, one of the first Americans to do so. He also co-owned an Arena Football League team (it failed), and went back to school in his 60s to add another master’s degree (he succeeded, graduating in 2017 from Johns Hopkins).\nTwo Illinois CS professors in particular helped MacGregor find his way, and he has never forgotten them and their key roles in his success.\nMacGregor provided the gift to Illinois Computer Science that endowed both the Saburo Muroga Professorship in Computer Science and the Michael Faiman Professorship in Computer Science.\nFaiman was MacGregor’s thesis advisor, and pointed him toward a project that involved Motorola’s 68000 series of microprocessors.\nBut when Motorola came to campus to recruit, the company mistakenly bypassed CS students, MacGregor said. That changed with a call from Muroga.\n“So his proactive concern about a student is actually how my whole career got launched,” MacGregor said.\nHe would eventually land a job and become the microcoder and micromachine architect for Motorola's MC68010 and MC68020. Based on that work, MacGregor was awarded 24 patents and the IEEE Browder J. Thompson Memorial Prize Paper Award.\nA few years later, when MacGregor was drawn to Japan with the idea that he would either work or go back to school, Muroga again offered a guiding hand, suggesting he do both.\n“He called up some professors at Kyoto University,” MacGregor said. “My oral exam and thesis presentation were five hours of the worst Japanese ever spoken.”\nAfter MacGregor returned to the United States he became a vice president of products and procurement at Dell back in Austin. When he left Dell, he joined Harvard Business School as a research fellow focused leadership, after which another sort of opportunity came along, part-ownership of the Austin Wranglers in the now-defunct Arena Football League.\nThe team folded after just a few seasons for a simple reason, according to MacGregor – “The expenses were greater than the revenue.”\nHe called the experience a lot of fun, and “a good lesson in humility for me.”\nMost recently, MacGregor found his own calling to teach. An adjunct professor, he created the cybersecurity program at Western State Colorado University in Gunnison.\nBut he believed he needed a technical refresher, and enrolled in the online master’s program at Johns Hopkins, studying cybersecurity.\nAfter years of working in management, “it doesn’t take long before you’re out of shape technically,” MacGregor said.\nNow at a school focused entirely on teaching, he looks back on the degree to which Muroga and Faiman, both serious researchers, made themselves available as teachers, too.\n“They were never stingy with their time in terms of the teaching aspect,” MacGregor said.\n \n"}]}