{"articles": [{"source": "Stanford University", "title": "​Tina Seelig receives the 2018 Lyman Award", "link": "/news/tina-seelig-receives-2018-lyman-award", "date": null, "content": "At an award dinner this evening, the Stanford Alumni Association will present the 2018 Richard W. Lyman Award to Tina Seelig, a professor of the practice in management science and engineering and a faculty director of the Stanford Technology Ventures Program, the entrepreneurship center in the School of Engineering.\nEach year, the alumni association presents the Lyman Award to an outstanding faculty member for extraordinary service to Stanford alumni. The association established the award in 1983 to honor Richard W. Lyman, Stanford’s seventh president.\n“A Stanford alumni favorite, Tina Seelig is a veritable academic force of nature whose infectious enthusiasm makes learning a true pleasure,” said Howard Wolf, vice president for alumni affairs and president of Stanford Alumni Association.\n“Her deep, experiential knowledge in the areas of innovation, creativity and entrepreneurship is of tremendous interest to our 230,000 alumni living around the world, and we are thrilled that Tina is the winner of this year’s Richard W. Lyman Award.”\nAlumni are very interested in entrepreneurship and Seelig, who explored the ability of entrepreneurs to make their own luck in the 2018 TED Talk, The Little Risks You Can Take to Increase Your Luck, is in high demand as a regional alumni speaker on the subject. She is the author of the 2015 book, Insight Out: Get Ideas Out of Your Head and into the World.\nThe alumni association said Seelig has contributed to its mission of reaching, serving and engaging alumni by participating in a variety of programs, including Stanford+Connects, a 2013–16 global event tour; Leading Matters, a 2008–11 global event tour; and “Classes Without Quizzes,” talks given by faculty during Reunion Homecoming.\nSeelig helped expand Stanford in the Wild from a creative writing retreat at Sierra Camp — a family camp located near South Lake Tahoe, California — into an interdisciplinary celebration of the Stanford experience that brings together alumni, faculty and students for a long weekend of in-depth learning and collaboration.\nSeelig, who earned a doctorate in neuroscience at Stanford Medical School in 1985, teaches at the Stanford d.school (Hasso Plattner Institute of Design).\nOne of the courses she teaches is Unlocking Creativity in Prison, which focuses on factors for unlocking innovation and entrepreneurship in prison in partnership with The Last Mile, a training program at San Quentin State Prison in northern California.\nSeelig leads three fellowships in creativity, innovation and entrepreneurship in the Stanford School of Engineering, including the Mayfield Fellows Program, an immersive entrepreneurship work/study program for Stanford undergraduate and co-term students.\nTina Seelig, professor of the practice in management science and engineering and a faculty director of the Stanford Technology Ventures Program.\n"}, {"source": "Stanford University", "title": "Through a critical lens: Students identify unmet healthcare needs", "link": "/news/through-critical-lens-students-identify-unmet-healthcare-needs", "date": null, "content": "For 10 weeks this summer, 12 undergraduate engineering students spent their free time shadowing physicians in the Stanford hospitals looking for problems in care that could potentially be addressed through technology innovation. They interviewed doctors and nurses to validate the issues they saw. They conducted research to understand stakeholder perspectives and the potential market opportunity around developing new solutions. And by the end of the Stanford Byers Center for Biodesign’s summer needs finding program, the students had completed an abbreviated version of “identify,” the first and most important phase of the biodesign innovation process.\nThe students were motivated to take the no-credit course by their interest in exploring the intersection of health care and engineering, the opportunity to “approach human health from a non-clinical perspective,” according to one student, and what another student described as “the chance to get exposure to the inner workings of the hospital and view the world of health care through a critical lens.”\nUltimately, the undergraduates uncovered needs that ranged from addressing process inefficiencies to improving clinical outcomes. Some highlights:\nDiabetes care in teenagers\nAbby McShane, a bioengineering sophomore, watched Stanford pediatric endocrinologist Dr. Priya Prahalad meet with a patient, a young man with type 1 diabetes in his first year in college. The patient regularly had a blood glucose level nearly twice the recommended maximum, and admitted that he frequently forgot to check his glucose around lunchtime. Asking questions and delving into secondary research, McShane learned that poor diabetes management was a recurring problem in young people transitioning to college. Not only can competing academic, economic and social priorities detract from a commitment to chronic disease management, but teenagers often don’t see the consequences of not being compliant. Adding to the problem, the transition from pediatric to adult care is awkward physicians tend to specialize in treating children or adults, with neither group well-equipped to manage the unique needs of young adults. The consequences of this gap in care are serious; men ages 20–29 with type 1 diabetes have a mortality rate three times higher than the general population. Within that group, 68% of diabetes-related deaths are due to acute complications of not closely controlling blood glucose.\nVascular access in obese patients\nJill Rogers and Saket Myneni, a sophomore and first-year student in bioengineering, respectively, were planning to observe a robotic surgery to remove a cancerous kidney from an obese patient. However, before the procedure even began, they watched surgical residents and nurses struggle for a full 90 minutes to place an arterial line into the patient. An arterial line is a thin, flexible catheter inserted into an artery in the arm or leg to closely monitor blood pressure in patients who have a high risk of rapid blood loss. The problem Rogers and Myneni observed was that layers of subcutaneous fat blocked access to the arteries, making it nearly impossible for the medical team to see or feel them. Even ultrasound guidance provided little help. Negative consequences included increased time under anesthesia for the patient, higher risk of complications and excess, expensive time in the operating room. Through research, Rogers and Myneni confirmed the magnitude of the problem; 1 in 3 Americans are considered obese by medical professionals, and there is an even higher prevalence in surgical patients due to associated health problems.\nDisposable equipment waste\nIn the course of her observations, Annie Brantigan, a junior in electrical engineering, was surprised by the amount of disposable medical equipment wasted during surgical procedures. The problem is that sterile supplies such as surgifoam, clips and sutures are opened in preparation for a procedure but often not used. Because these materials are no longer sterile, they then must be thrown away. Through research, Brantigan learned that roughly 13% of the cost of a surgical procedure comes from wasted disposable equipment, and that total, averaging around $1,000 per procedure, is often billed to the patient. The cost of the wasted equipment increases further as hospitals must pay by the pound to dispose of biohazard waste.\nPresenting the needs\nAt the end of the quarter, the students presented the final needs to the Stanford Biodesign teaching team: Lyn Denend, Richard Fan, Justin Huelman, Ross Venook, Alexei Wagner, MD, James Wall, MD, and Marta Zanchi. They were then given the choice to continue working on their needs or “donate” them for other students to work on in Biodesign’s project-based courses. According to Brantigan, who decided to share her need with others, “It was motivating to know that I had uncovered an important problem, and that other students would have the chance to think about how to potentially solve it during the coming academic year.”\nOther positive feedback from the students revolved around what they learned about themselves and their career aspirations as a result of the experience. One student observed “how many opportunities there are for improvement in medicine”; another found a “new appreciation for the power of engineering”; and a third reported, “It helped me understand that there are opportunities to be meaningfully involved in health care without having to be a doctor first.”\n"}, {"source": "Stanford University", "title": "How do we teach robots to do basic tasks?", "link": "/news/how-do-we-teach-robots-do-basic-tasks", "date": null, "content": "In the basement of the Gates Computer Science Building at Stanford University, a screen attached to a red robotic arm lights up.\nA pair of cartoon eyes blinks. “Meet Bender,” says Ajay Mandlekar, PhD student in electrical engineering.\nBender is one of the robot arms that a team of Stanford researchers is using to test two frameworks that, together, could make it faster and easier to teach robots basic skills. The RoboTurk framework allows people to direct the robot arms in real time with a smartphone and a browser by showing the robot how to carry out tasks like picking up objects. SURREAL speeds the learning process by running multiple experiences at once, essentially allowing the robots to learn from many experiences simultaneously.\n“With RoboTurk and SURREAL, we can push the boundary of what robots can do by combining lots of data collected by humans and coupling that with large-scale reinforcement learning,” said Mandlekar, a member of the team that developed the frameworks.\nThe group will be presenting RoboTurk and SURREAL Oct. 29 at the conference on robot learning in Zurich, Switzerland.\nHumans teaching robots\nYuke Zhu, a PhD student in computer science and a member of the team, showed how the system works by opening the app on his iPhone and waving it through the air. He guided the robot arm — like a mechanical crane in an arcade game — to hover over his prize: a wooden block painted to look like a steak. This is a simple pick-and-place task that involves identifying objects, picking them up and putting them into the bin with the correct label.\nTo humans, the task seems ridiculously easy. But for the robots of today, it’s quite difficult. Robots typically learn by interacting with and exploring their environment — which usually results in lots of random arm waving — or from large datasets. Neither of these is as efficient as getting some human help. In the same way that parents teach their children to brush their teeth by guiding their hands, people can demonstrate to robots how to do specific tasks.\nHowever, those lessons aren’t always perfect. When Zhu pressed hard on his phone screen and the robot released its grip, the wooden steak hit the edge of the bin and clattered onto the table. “Humans are by no means optimal at this,” Mandlekar said, “but this experience is still integral for the robots.”\nFaster learning in parallel\nThese trials — even the failures — provide invaluable information. The demonstrations collected through RoboTurk will give the robots background knowledge to kickstart their learning. SURREAL can run thousands of simulated experiences by people worldwide at once to speed the learning process.\n“With SURREAL, we want to accelerate this process of interacting with the environment,” said Linxi Fan, a PhD student in computer science and a member of the team. These frameworks drastically increase the amount of data for the robots to learn from.\n“The twin frameworks combined can provide a mechanism for AI-assisted human performance of tasks where we can bring humans away from dangerous environments while still retaining a similar level of task execution proficiency,” said postdoctoral fellow Animesh Garg, a member of the team that developed the frameworks.\nThe team envisions that robots will be an integral part of everyday life in the future: helping with household chores, performing repetitive assembly tasks in manufacturing or completing dangerous tasks that may pose a threat to humans.\n“You shouldn’t have to tell the robot to twist its arm 20 degrees and inch forward 10 centimeters,” said Zhu. “You want to be able to tell the robot to go to the kitchen and get an apple.”\n"}, {"source": "Stanford University", "title": "A new course teaches students the science of art materials", "link": "/news/new-course-teaches-students-science-art-materials", "date": null, "content": "If you walked the first floor of the Shriram Center for Bioengineering and Chemical Engineering at Stanford University in early September, you may have peered in on a lab full of students, decked out in lab coats, gloves, face masks and goggles. This would be no unusual sight in a chemistry lab, save for what the students were doing. With the utmost focus — and more than a little urgency — they were making art.\nFor three weeks, rising sophomores enrolled in the Sophomore College course, An Exploration of Art Materials: The Intersection of Art and Science, could be seen through the windows of Shriram 132 constructing canvases, making paper, mixing paints, sketching and painting. Through a combination of lectures, hands-on art labs and field trips, this course covers the history and science of art materials, starting with cave art from the Paleolithic era and addressing art forms from ancient Egypt and Greece, the Middle Ages, the Renaissance and modern times.\n“A lot of artists don’t have any idea about some of the things they’re working with. It comes pre-packaged, they just leap right in. Sometimes these things are pretty dangerous,” said instructor Sara Loesch-Frank, an artist and lecturer in chemical engineering at Stanford. “We felt like this was important to teach, not just for the medical aspects but for the history too.”\nThe course requires some exposure to chemistry, but the students vary in terms of their interests and experiences in art and science. The class is co-taught by Curt Frank, the W. M. Keck Sr. Professor in Engineering, who is married to Sara.\nLearning and doing\nOver a decade ago, another faculty member — who was familiar with Sara and Curt’s frequent discussions about the science behind some of her experimental art processes — challenged them to teach a class that combined their areas of expertise. Sara was ready to do it but Curt had his reservations.\n“The probability that I would really say something stupid was fairly high on my consciousness,” he recalled. \nA couple years later, after taking some time to learn about art history and brainstorm potential lectures, which now amount to 20 hours, Curt agreed to give it a go. The experience, he said, has been “a real growth process” for him. But his willingness to step outside his comfort zone has motivated others, including graduate students in his lab who have audited the class and done their own research on the science of art materials.\nGiven the various chemistry backgrounds of the students, Curt’s lectures are taught at an introductory level. However, they cover a broad range of topics, including why pigments and dyes have colors, what kinds of binders hold the pigments together, how paintings and murals can be cleaned and the technologies of making paper, glass and ceramics.\n“My expectation for the course is not that the students remember any of the details of the chemistry,” Curt said. “But the next time they go to a museum and look at a painting, I want them to have some idea that there’s something below the image and I want them to think about it.”\nEach art lab entails 90 minutes of concentrated work on a piece that matches a particular lecture topic. For the students and instructors alike, the time flies. Art forms include sketching on rough surfaces with graphite and pastels, making paper, painting with egg tempera on wood and oil paint on canvas, and learning how to marble paper. Students mixed their own paints — the egg tempera lab featured eggs from the instructors’ own chickens — and could grind their own pigments. Pigment ingredients included cochineal, an insect that’s long been a component in natural red dyes, and clays dug up by Sara and Curt during their travels.\n“I wanted to do an art intensive because I wanted to see what that would be like to make art in a rigorous, academic setting,” said Rachael Wang, ’20, a student in this year’s class. “It’s really cool having the lab portion where we can experiment and when I go into a museum or an exhibition, I’ll understand so much more about the materials.”\nField trips to Stanford’s Department of Special Collections and University Archives and the Cantor Art + Science Lab, as well as to the de Young Museum, Legion of Honor and Museum of Modern Art in San Francisco, round out the course. In the Special Collections, the class viewed illuminated lettering on vellum, parchment and paper. At the de Young, they went behind the scenes where conservators were restoring paintings and rebuilding frames. They even got to see how conservators wash pages of old books at the Legion of Honor, which Sara said scared her a bit the first time she saw it.\nBeing a better artist\nThe students complete an additional art project outside of class and write a paper explaining the science behind their art. Past projects have included stained glass, pottery, batik print (a dyeing process that relies on wax-resistance) and cyanotypes (a precursor to film photography).\nNone of the projects in the course are judged for artistic merit. Instead, Sara concerns herself with how the students engage with the materials. Still, by learning, thinking about, discussing, observing and experiencing how these art materials work, the students, of course, gain some new art skills.\n“Materials and the artist are basically inseparable,” said Arthur Morris, an exchange student from Oxford University who studies physics and took the course to combine his scientific and artistic interests. “So, if you have a good knowledge of the materials, then you’re definitely going to be a better artist.”\nCurt Frank, the W. M. Keck Sr. Professor in Engineering and professor, by courtesy, of materials science and engineering.\n"}, {"source": "Stanford University", "title": "New Chan Zuckerberg Biohub awards foster research collaborations", "link": "/news/new-chan-zuckerberg-biohub-awards-foster-research-collaborations", "date": null, "content": "Thirteen Stanford faculty are among the leaders of six research teams that received funding from the Chan Zuckerberg Biohub.\nCombined with a new Microbiome Initiative — which includes four Stanford faculty — the CZ Biohub is committing $13.7 million over three years to new collaborative research to enhance human health.\nThe Intercampus Research Awards were given to teams of researchers that include faculty from Stanford, UCSF and the University of California, Berkeley, with the goal of fostering scientific research collaboration across the Bay Area.\n“This new collaborative team-based funding allows investigators across the three campuses to tackle demanding problems to enhance health,” said Stephen Quake, co-president of CZ Biohub and professor of bioengineering and of applied physics at Stanford. “These research teams will shed new light on a diverse and challenging set of questions that will advance our understanding while developing technologies that open fresh avenues of research.”\nSteven Palumbi, professor of biology, is one of five leaders on a team that received funding to investigate genome evolution and cell biology in organisms that aren’t traditional laboratory animals. “Mice can’t regenerate limbs but we study worms that can, and corals can live thousands of years,” he said. “There are amazing things that these organisms do regularly that reveal the limits of our own cell biology.”\nPalumbi said that collaborations across institutions are how everyone knows science should be done, but it rarely happens. “We all know if you take different areas of science and put them together these intersections lead to insights,” he said. But it takes something like these grants to bring faculty together.\nThe CZ Biohub also announced funding to expand on the Microbiome Initiative that launched as a pilot program earlier this year. That initiative will carry out research on the community of microbes within the human body that influence many aspects of health, from nutrition and immune function to drug metabolism.\nFour Stanford faculty are among the eight investigators who will be leading the Microbiome Initiative: Michael Fischbach, associate professor of bioengineering; Kerwyn “KC” Huang, associate professor of bioengineering and of microbiology and immunology; David Relman, professor of medicine and of microbiology and immunology; and Justin Sonnenburg, associate professor of microbiology and immunology.\n“The human microbiome is incredibly complex, individual, and dynamic,” Sonnenberg said. “Hundreds of microbial species are a fundamental part of human biology, contributing to health and in some cases causing disease, so this is an important but difficult set of biomedical problems to address.”\nAs part of the Microbiome Initiative, CZ Biohub will establish a mass spectrometry facility for metabolomics at the Stanford-based Biohub site. They plan to make unused instrument time available to other members of the research community. They are also exploring the idea of making software tools, mentoring and training accessible to biologists and engineers who are not specialists in metabolomics.\nThe CZ Biohub encourages collaboration between Bay Area institutions with regular meetings and chances for their investigators to exchange ideas. Team leaders on the Intercampus Research Awards will be expected to participate in at least half of the biweekly meetings and to upload manuscripts reporting work supported by these awards to preprint servers such as bioRxiv.org or arXiv.org to accelerate the pace of scientific discovery.\nThe six awards and team leaders are:\nBeyond model systems: Insights into genome evolution and cellular innovations\n\tChristopher Lowe, Stanford University\n\tDaniel Rokhsar, UC Berkeley\n\tWallace Marshall, UCSF\n\tStephen Palumbi, Stanford University\n\tIrving Weissman, Stanford University\nSocial network analysis of neuroimmune interactions in the developing human brain\n\tTomasz Nowakowski, UCSF\n\tJimmie Ye, UCSF\n\tDavid Schaffer, UC Berkeley\n\tAlex Pollen, UCSF\n\tJames Zou, Stanford University\n\tAlice Ting, Stanford University\nMulti-scale deep learning and single-cell models of cardiovascular health\n\tRima Arnaout, UCSF\n\tEuan Ashley, Stanford University\n\tJ. Ben Brown, UC Berkeley\n\tAtul Butte, UCSF\n\tJames Priest, Stanford University\n\tBin Yu, UC Berkeley\nMachine learning for interpreting rare genetic variation in comprehensive newborn screening and pharmacogenetics\n\tSteven E. Brenner, UC Berkeley\n\tRuss B. Altman, Stanford University\n\tRenata C. Gallagher, UCSF\n\tMichael I. Jordan, UC Berkeley\n\tKathleen M. Giacomini, UCSF\n\tCarlos Bustamante, Stanford University\nDefining host responses of virus-infected and uninfected neighbor cells\n\tLaurent Coscoy, UC Berkeley\n\tKarla Kirkegaard, Stanford University\n\tMelanie Ott, UCSF, Gladstone Institutes\n\tPeter Sarnow, Stanford University\nImaging complex biological machines in action\n\tWah Chiu, Stanford University\n\tJohn C. Boothroyd, Stanford University\n\tCarolyn Larabell, UCSF\n\tJames A. Sethian, UC Berkeley\n"}]}