{"articles": [{"source": "University of Illinois", "title": "Center For Autonomy Launched To Develop Research, Education In Emerging Field ", "link": "/news/center-autonomy-launched-develop-research-education-emerging-field", "date": "12/6/2018", "content": "\nFrom self-driving cars to intelligent robotic assistants and remote surgical systems, autonomous technology promises to revolutionize the way we live, work, and play. In order to enable this revolution, however, advancements in foundational research and workforce development must first take place to provide assured and safe performance.\nThe University of Illinois at Urbana-Champaign has allocated $2.1 million in funds to create a new Center for Autonomy that will enable high-impact research and develop new educational programs for students and professionals. The center, which will include four Illinois Computer Science faculty and colleagues from across campus, will play an important role in designing innovative systems that can function without human intervention in a safe and reliable way. In addition, the College of Engineering is providing a $2.1 million match to recruit new faculty in robotics to continue growing expertise at Illinois.\n“We have achieved some measure of autonomy already,” said the Coordinated Science Lab’s Geir E. Dullerud, the W. Grafton and Lillian B. Wilkins Professor of Mechanical Science and Engineering, who is the director of the new center. “However, there’s a difference between a self-driving car that works most of this time and a self-driving car that works all of the time. When it comes to safety-critical activities, we need to be assured that autonomous systems will function in the intended way.”\nExperimental space for autonomy and robotics research is set to increase four-fold with the creation of the center, with the goal of applying fundamental theoretical advances to applications of the future.\nIllinois CS faculty who are part of the new center are: Associate Professor Derek Hoiem, Professor Alexander Kirlik, Research Assistant Professor Sibin Mohan, and Donald B. Gillies Chair in Computer Science Lui Sha.\nThe Center for Autonomy’s researchers are already pursuing distributed autonomous and robotic trustworthy systems (DARTS) for applications that are important to humanity and our economy, such as the farm of the future, information-rich IoT-driven autonomous manufacturing floors, and defensive systems that bring humans and robots together in operational teams that are unparalleled in their capacity to defend our nation. As part of this process, researchers will advance knowledge in artificial intelligence, robotics, digital hardware, and communications.\nThe center will also galvanize thinking on many critical issues associated with autonomous systems, such as:\n\nExploring the ethical considerations of using autonomous systems and the value judgements that these machines will make, potentially without human intervention,\nExpanding and modifying the law, business, and labor models to deal with such systems in the public domain and workplace,\nAnd understanding the psychological impact of these developments on humanity.\n\nIn addition to research, the center will develop new degree programs in autonomy and robotics, which would help prepare the next generation of students to tackle critical problems in this field. The first effort will be a master’s degree that will help students develop a holistic view of the issues pertinent to autonomous systems. There will also be opportunities for individuals to further focus on business, societal, and ethical dimensions. In addition, Dullerud and his colleagues plan to develop specialization certificates that would tackle similar issues.\nThe Center for Autonomy will build on the University of Illinois’ established track record in autonomy. The university was recently named No. 1 in Automation & Control by the Shanghai Ranking Consultancy’s Academic Ranking of World Universities.\nThe Center is funded through the competitive Investment for Growth program, sponsored by the Provost’s office.\n“Beyond our world-renowned research and contributions to control, autonomous systems, IoT and Big Data analytics, it is the excellence and breadth of our community’s interest in human-centric innovations and applications of technology that make us stand out,” said Provost Andreas Cangellaris. “Illinois will advance this field for the benefit of humanity and society in the coming decades.”\n"}, {"source": "University of Illinois", "title": "Illinois CS Professor Gul Agha Named ACM Fellow ", "link": "/news/illinois-cs-professor-gul-agha-named-acm-fellow", "date": "12/6/2018", "content": "\nGul Agha, professor of computer science, has been named a fellow of the Association for Computing Machinery. ACM Fellows are composed of an elite group that represents less than one percent of the Association’s global membership. ACM will formally recognize its 2018 Fellows at the annual Awards Banquet in San Francisco on June 15, 2019.\nAgha, the Director of the Open Systems Laboratory at the University of Illinois and a faculty member in the College of Engineering’s City Scholars program, is cited for “research in concurrent programming and formal methods, specifically the Actor Model.” His widely cited work, \"Actors: A Model of Concurrent Computing in Distributed Systems,\" provided a basis for a number of research projects in concurrent programming. Actor frameworks such as Scala/Akka, Erlang and Microsoft Orleans have been used to program Twitter, LinkedIn, Facebook Chat, the British National Health Service Portal, and hundreds of commercial cloud applications.\nResults of his research promise to lead to new ways for building and maintaining open distributed systems. Specifically, Agha's group is developing concurrent programming languages and systems which support applications with high-performance, fault-tolerance or real-time requirements.\nAgha said he was humbled by the recognition, and thankful for the research environment he has enjoyed at the University of Illinois since he joined the faculty in 1989.\n“It reflects well on the environment at Illinois, the different collaborations over the last 30 years. It really reflects the ability to flourish in an intellectually stimulating environment with great colleagues and students,” he said. “The major strength of Illinois is the collaborative atmosphere, that collegial strength.”\nAgha has pioneered research in an approach he calls statistical model checking with applications in diverse areas such as biological systems and cyberphysical systems.  He also developed new logics and algorithms for quantitative model checking of aggregate properties of systems.\n“The idea is to look the behavior of systems in the aggregate and behavior you can approximate. In a large scale system a lot of the behavior will be statistical in nature,” he said. “What we did is to combine statistical methods with logical methods so your specifications can be expressed precisely.”\nAgha’s group developed methods to automatically verify distributed systems during execution using decentralized monitoring.  It also developed novel methods to test programs using dynamic memory and concurrency. Those methods have been incorporated in popular software testing tools such as KLEE, Microsoft SAGE, and S2E, and widely used in companies including Micro Focus Fortify, NVIDIA, and IBM, and by numerous security companies to find security vulnerabilities.\nAgha, together with B.F. Spencer, Jr., professor of civil and environmental engineering at Illinois, is co-director of the Illinois Structural Health Monitoring Group. The project pioneered research applying wireless sensor networks and distributed computing to continuously monitor the structural health of civil infrastructure such as bridges.  The project implemented the world's largest sensor network with over 700 sensors on the Jindo bridge. The technology has also been used to monitor the world largest Ferris wheel during its construction in Dubai--the first time such monitoring was done.  Agha is a Founder of Embedor Technologies, which is transferring the technology to the real-world.\nProfessor Agha earned a PhD in computer and communications science from the University of Michigan at Ann Arbor in 1985. After a four-year stint as a research scientist and lecturer at MIT, he joined Illinois. He has advised 30 PhD and 16 MS theses at Illinois. His advisees include professors at universities such as the University of California at Berkeley, Rochester Polytechnic Institute, and UC Irvine. Others have gone to industry, including two vice presidents at Google, a vice president and general manager at Goldman-Sachs, and several other successful entrepreneurs--one of whom was a founder of Netscape.\nAgha is currently editor-in-chief of Computing Now, which covers emerging technologies. Previously, he was editor-in-chief of ACM Computing Surveys from 2000 to 2007, a major cross-cutting journal in computer science, and editor-in-chief of IEEE Parallel and Distributed Technology.\n \n"}, {"source": "University of Illinois", "title": "Hutter's Work On Communication Costs Leads to DOE Computational Science Graduate Fellowship ", "link": "/news/hutters-work-communication-costs-leads-doe-computational-science-graduate-fellowship", "date": "12/4/2018", "content": "\nAs an undergraduate student in computer engineering, Edward Hutter didn’t just get by in an advanced graduate-level course on communication-cost analysis. He excelled, according to Assistant Professor Edgar Solomonik.\nAnd Hutter (BS CompE ’17) put what he learned to immediate use. He led a project that produced a new communication-avoiding algorithm for obtaining an orthogonal factorization of a matrix. He also created a way to employ that algorithm, showing for the first time how additional memory can be used to speed execution time over state-of-the-art libraries for what is a near-universal problem, Solomonik said.\nNow a second-year computer science PhD student, Hutter’s work has earned him a Computational Science Graduate Fellowship from the U.S. Department of Energy. The CSGF is the most prestigious and competitive computational science fellowship available from the federal agency, according to Solomonik, who is Hutter’s advisor.\nHutter was one of the two University of Illinois students to win one this fall, along with biochemistry PhD student Anda Trifan. Fewer than 6 percent of applicants are chosen each year.\nThe fellowships are administered by the Krell Institute in Ames, Iowa. They support PhD students focused on using high-performance computers to solve science and engineering problems that are of national importance. In Hutter’s case, that means using high-performance computing to improve the scalability of existing methods in quantum chemistry.\n“The Department of Energy recognizes the importance of applying high performance computing to the field of quantum chemistry,” he said. “Improving existing algorithms to reduce communication will lead to computational methods that achieve higher accuracy at less cost.”\nHutter, who is from Geneva, Ill., plans to use his fellowship to develop practical algorithms to minimize communication costs of QR and eigenvalue factorizations conducted over a network. He also plans to investigate tensor factorizations for representing high-accuracy wave functions necessary in many electronic structure calculations.\n“My research seeks to improve the scalability of electronic structure calculations in both theory and practice through the development of communication-avoiding tensor factorizations,\" Hutter said.\nSolomonik said the fellowship should provide Hutter with a demanding and closely guided experience.\nThe DOE CSG Fellowship “exposes students to a wide network of alumni from a diverse set of disciplines in sciences and computation, who are present at every major national research lab and at most top universities,” Solomonik said.\nHutter, who called being chosen for the fellowship “an honor and a privilege,” echoed Solomonik on the uniqueness of the opportunity ahead of him.\n“This fellowship provides the opportunity to explore electronic structure calculations from a computer science background that would not have been possible otherwise,” including spending part of a summer at Oak Ridge National Laboratory in Tennessee.\n"}, {"source": "University of Illinois", "title": "Kudaligama’s Service to Grad Students, Illinois CS Earns Graduate College Recognition ", "link": "/news/kudaligama-s-service-grad-students-illinois-cs-earns-graduate-college-recognition", "date": "11/29/2018", "content": "\n“Ask Viveka.”\nInterim Department Head Vikram Adve says going to Viveka Kudaligama, the coordinator of graduate programs for Illinois Computer Science, is the default answer to any number of questions related to being a grad student in the department.\nSome of those questions are routine. Some are anything but.\nIn 2015, Kudaligama was asked to figure out how to help when an Illinois CS PhD student was barred from returning to the United States after attending a conference. Helping, as it turned out, required months of navigating complex federal rules, helping the student, Motahhare Eslami, navigate a process that was evolving based on international politics, and just plain being there for Eslami.\nFor those efforts and others, Kudaligama has been honored with the 2018 Graduate College Excellence Award for Graduate Contacts.\n“Not knowing whether or not I would be able to return to campus was a very scary situation, but Viveka’s guidance kept me optimistic and calmer than I would have been without her,” Eslami wrote in a letter supporting Kudaligama’s nomination.\nThe award, Kudaligama said, came as a pleasant surprise.\n“Absolutely, given the number of people who work with the graduates on campus,” she said. “There are people who've been in their current positions or been in the system for many, many years and doing great things.”\nBut Kudaligama, according to all of those involved in nominating her, stands out.\nBoth Adve and Professor Chandra Chekuri credit her for putting in long hours and playing a key role in the launch of the successful Master of Computer Science in Data Science program.\nAnd Chekuri says his three years as director of Graduate Studies started with his own concerns about his new position and, at the time, her new role as coordinator.\n“My concerns were unwarranted,” he said in his own letter backing Kudaligama’s nomination. “I couldn’t have asked for a better person to work with.”\nShe also brings expertise based on her own experience as a grad student. She has a master’s degree in agricultural and resources economics from the University of Hawai’i at Manoa and was a PhD student in agricultural economics at the University of Illinois.\n“I still miss sometimes not being able to be in the classrooms. I really enjoyed the TA appointments I had -- probably too much,” she said. “Now I'm telling students, ‘You might really, really, really like this, but you have to focus on getting the degree completed.’”\nBut of all the work that the award recognized, Eslami’s predicament is the most dramatic.\nEslami, a student from Iran, was trying to re-enter the United States in March 2015 after attending a conference in Vancouver. Her visa was revoked for reasons that still aren’t clear, and she was forced to spend a month in Canada trying to clear up her status.\nShe had difficulties getting paid for the research assistant work she had already done on campus, and, as she discovered, no immediate way back.\nKudaligama worked with the Graduate College, the International Student and Scholar Services office, and campus legal counsel – which also worked with an outside immigration lawyer -- trying to resolve the situation. She also found an emergency fund that allowed Eslami to apply for some short-term financial help.\nEslami eventually was forced to return to Iran. while her husband, Illinois CS PhD student Amirhossein Aleyasen, stayed on campus.\nThere, she could no longer work with her advisor, Professor Karrie Karahalios. The services of a professor, they discovered, fall under the embargo against trade with Iran.\n“I know about trade embargoes, I know about the trade sanctions,” Kudaligama said, noting her agricultural background. “But I always thought of trade sanctions in terms of your wheat and the corn and hogs, soybeans.”\nThe two stayed in regular contact over the months that followed while Eslami worked through the extensive background checks required to regain her visa.\n“During that year I was writing to her almost every day, perhaps more than once a day sometimes when things were happening,” Kudaligama said.\nAnd in February of 2016 Eslami did get her visa back, re-enrolling and rejoining her husband.\nShe’s on track to graduate in May.\nThe bond Kudaligama says the two developed is no doubt stronger because of what happened, but not out of the ordinary, she aid.\n“I feel like I've gotten to know her a little bit more,” she said. “But that is part of being a student here, too.”\n"}, {"source": "University of Illinois", "title": "Gropp Named AAAS Fellow ", "link": "/news/gropp-named-aaas-fellow", "date": "11/27/2018", "content": "\nIllinois Computer Science Professor William D. Gropp has been named a Fellow of the American Association for the Advancement of Science (AAAS).\nAs part of the Information, Computing and Communication section, Gropp, who is Director and Chief Scientist of the National Center for Supercomputing Applications (NCSA) and the Thomas M. Siebel Chair in the Department of Computer Science at Illinois, was elected as an AAAS Fellow for his distinguished contributions to scalable algorithms and software for high performance computing.\nElection as an AAAS Fellow is an honor bestowed upon AAAS members by their peers. This year, 416 members have been awarded this honor by AAAS because of their scientifically or socially distinguished efforts to advance science or its applications. New Fellows will be presented with an official certificate and a gold and blue (representing science and engineering, respectively) rosette pin at the AAAS Fellows Forum during the 2019 AAAS Annual Meeting in Washington, D.C. this February and will be announced in the \"AAAS News & Notes\" section of the journal Science on November 29, 2018.\n\nThroughout his nearly 40-year career, Gropp has explored parallel computing, software for scientific computing, numerical methods for partial differential equations, and the development of efficient and scalable parallel algorithms for the solution of linear and nonlinear equations. He has played a major role in the development of the MPI message-passing standard and was one of the designers of the PETSc parallel numerical library. Gropp is also recognized as a fellow of the ACM, IEEE, SIAM, and an elected a member of the National Academy of Engineering.\n“The AAAS is the premier society representing all of science, and it is a leader in communicating science to the public. I’m proud to be a member and I am honored by this recognition,” said Gropp.\nOther 2018 Fellows from the University of Illinois at Urbana-Champaign include Dr. Narayana Aluru of the Department of Mechanical Science and Engineering in the Engineering section, for outstanding contributions to computational, physical, and engineering aspects of nanofluidics and micro/nanoelectromechanical systems including the development of novel multiphysics and multiscale methods; Dr. Andrew D.B. Leakey of the Department of Crop Sciences in the Agriculture, Food and Renewable Resources section, for distinguished contributions to plant science, particularly for advancing integrative understanding of crop carbon and water relations in the context of global environmental change; and Dr. Ray Ming of the School of Integrative Biology, also in the Agriculture, Food and Renewable Resources section, for distinguished contribution to the field of sex chromosome evolution, particularly using genomic technologies to study early stages of sex chromosomes relevant to crop improvement.\nThe tradition of AAAS Fellows began in 1874. Currently, members can be considered for the rank of Fellow if nominated by the steering groups of the Association’s 24 sections, or by any three Fellows who are current AAAS members (so long as two of the three sponsors are not affiliated with the nominee’s institution), or by the AAAS chief executive officer. Fellows must have been continuous members of AAAS for four years by the end of the calendar year in which they are elected. AAAS Fellow’s lifetime honor comes with an expectation that recipients maintain the highest standards of professional ethics and scientific integrity.\n\nEach steering group reviews the nominations of individuals within its respective section and a final list is forwarded to the AAAS Council, which votes on the aggregate list. The Council is the policymaking body of the Association, chaired by the AAAS president, and consisting of the members of the board of directors, the retiring section chairs, delegates from each electorate and each regional division, and two delegates from the National Association of Academies of Science.\n \n\n\nABOUT AAAS\nThe American Association for the Advancement of Science (AAAS) is the world’s largest general scientific society and publisher of the journal Science (www.sciencemag.org) as well as Science Translational Medicine, Science Signaling, a digital, open-access journal, Science Advances, Science Immunology, and Science Robotics. AAAS was founded in 1848 and includes nearly 250 affiliated societies and academies of science, serving 10 million individuals. Science has the largest paid circulation of any peer-reviewed general science journal in the world. The non-profit AAAS is open to all and fulfills its mission to “advance science and serve society” through initiatives in science policy, international programs, science education, public engagement, and more. For the latest research news, log onto EurekAlert! (www.eurekalert.org), the premier science-news Web site, a service of AAAS.\n"}, {"source": "University of Illinois", "title": "Preventing the Spread of Misinformation Online ", "link": "/news/preventing-spread-misinformation-online", "date": "11/26/2018", "content": "\nSocial media bot accounts have been a hot topic around the country since Russian-controlled accounts were suspected to have influenced the 2016 election. These accounts, regardless of origin, share inaccurate and often politically divisive information.\nIllinois Computer Science Professor and Willett Faculty Scholar Tarek Abdelzaher is working with his students on a unique way to identify these bots among millions of existing Twitter accounts. Rather than focus on individual account actions, Abdelzaher looks at the larger picture of misinformation campaigns.\n“Sometimes if you look at one account by itself it looks normal, but if you look at it compared to others in you realize it’s a bot,” said Abdelzaher, who is also a member of the Coordinated Science Laboratory. “You realize, geez for some reason the groups of accounts tweet exactly the same things at exactly the same time. The odds of humans being so in sync that they tweet the exact same thing at the exact same time is impossible. It’s a race against escalating attacker sophistication, where more complex statistical analysis is used to expose more complex bot group behaviors”\nThe intentions of the bot controllers vary, but they are frequently used to intimidate, motivate, or recruit people, or to change people’s minds via mass messaging. This is what prompted Abdelzaher to look at groupings of identical tweets rather than single accounts to identify bots. The strategy led Abdelzaher’s team to assist with uncovering an ISIS information campaign last year, showing that there are significant military applications to this technology as well as social.\n“The goal of the research was to identify these types of propaganda sources and isolate them,” Abdelzaher said. “We wanted to expose them for what they are. Or at least show that the information they are sharing isn’t genuine, it’s coming from a set of bots coming from such and such foreign country.”\nOriginally, the technology behind the bot detection was used for communicating social events. The tool, Apollo – also created by Abdelzaher, would gather information about an event on social media and provide a summarized and condensed version of what was happening. Of course, not everything on the internet is true, so additional research was necessary to determine the credibility of information.\nThe technology – which has so far only been used on the Twitter platform – uses only public information. Any information collected by the tool is already searchable by any twitter user and is collected using Twitter’s public interface in compliance with the company’s user agreements. But the hope is that is can be used across multiple social media platforms.\n“The main value-added function is that it cleans up the information a bit, sort of like a spam filter for your email or a Brita for your water,” Abdelzaher said. “That's where all the research is. So, for example, if a disaster occurs and people publicly ask for help by posting on Twitter, Apollo can report that, but it'll be smart enough to detect if something does not seem genuine, in which case it may discard it as misinformation/spam.”\nSocial media platforms and the people who use them for malicious purposes aren’t going away anytime soon. With better detection research and technology, identifying the real users from the bots will make it more difficult for the nonhuman users to spread their message.\nThis project is funded by the Army Research Lab’s Internet of Battlefield Things project.\n\nSee the original CSL story.\n"}, {"source": "University of Illinois", "title": "Cohens Give Back Because of Opportunities Illinois CS Provided, Hope Others Will Follow ", "link": "/news/cohens-give-back-because-opportunities-illinois-cs-provided-hope-others-will-follow", "date": "11/15/2018", "content": "\nOn campus in October for the Illinois Computer Science Celebration of Excellence Student Awards Ceremony, Debra and Ira Cohen had a chance to see their own generosity at work.\nIra Cohen (BS CS ’80) is an Illinois CS graduate and he and Debra Cohen have long donated – funding three scholarships and a fellowship -- to help students finance the kind of education that he received, and give them the ability to take full advantage of the department and the university around them. The couple regularly enjoy the chance to meet with the students they help, and see how that help can transform those students and their trajectories.\n“These kids become mentors to other students,” Ira Cohen said. “That’s really what our goal is: not just set somebody up for life but to allow them to not work 40 hours while they’re going to school.”\nThe Cohens said they see themselves as part of a living and, they hope, growing cycle – people who gain from and then give back to the university and the Department of Computer Science.\n“Our hope going forward is that those people who have received the awards will hopefully will look back at their time at the university and say, ‘Hey, I was given an opportunity, let me do the same thing.’ Pay it forward,” Debra Cohen said.\nThe Cohens have been doing just that for years.\nIn 2005 they established the Ira & Debra Cohen Graduate Fellowship in Computer Science, primarily supporting graduate research in bioinformatics.\nThree years later, the Sara and Louis Cohen Undergraduate Scholarship was first awarded. It was established to honor Ira Cohen’s grandparents.\nAnd the next year, 2009, the Cohens added the William and Ruth Witt Scholarship in honor of Debra Cohen’s parents.\nThe Cohens also served on the Advisory Board when the Engineering Visionary Scholarship Initiative was launched.\nIn 2011, Ira Cohen was recognized among the department’s Alumni Award winners, taking home the Distinguished Service Award.\n“If we can provide impact, that’s the best thing,” Debra Cohen said.\nThe Cohens are also regulars on campus, holding season tickets for both football and basketball and supporting the golf program.\nTheir ties to the university run deep, and started, for Ira, almost the moment he graduated from high school in Wilmette in the Chicago suburbs.\n“About 37 of my high school class wound up going to Illinois,” he said, as well as a sister and cousin who were already on campus when he enrolled.\nOnce at Illinois Computer Science, Cohen found himself immersed in CS in ways he couldn’t have imagined, including exposure to legendary faculty like numerical analysis pioneer Bill Gear.\nBefore that, “I had a programmable calculator -- that was my computer experience,” Cohen said. “My first class was taught by Bill Gear. I still have the textbook.”\nEventually Cohen went on to cofound Advanced Systems Concepts, in Schaumburg, Illinois, and to meet Debra.\nShe graduated from Robert Morris University, but says she, too, found a home at Illinois.\n“I have a lot of orange and blue in my wardrobe,” she said. “I think a lot of it is that everybody has welcomed me.”\nFor Ira Cohen, a driving factor remains the challenging, dynamic environment he found around him as an Illinois CS student.\n“MOSAIC, I got exposed to email for the first time,” he said, remembering the revolution that was happening around him at the time. “It was kind of nice be networked into that and be exposed to the innovation that was going on.”\n“This revolution has happened in the last 30-plus years,” he added, “and a lot of it came out of Illinois.”\n \n"}, {"source": "University of Illinois", "title": "Solomonik Recognized for Early Career Work Aimed at Improving HPC Performance ", "link": "/news/solomonik-recognized-early-career-work-aimed-improving-hpc-performance", "date": "11/14/2018", "content": "\nAs a high school student, Edgar Solomonik was already focused on a career in computer science, working as an intern at a downtown Chicago trading firm.\nCommuting by train back and forth between home in the Chicago suburbs and the office in the Loop, he learned about the sort of dedication and thinking it takes to work and succeed.\n“I already had a mindset for how to debug codes and kind of solve problems by myself, and how to work independently, the kind of work ethic that is associated with that,” said Solomonik, now an assistant professor at Illinois Computer Science and a graduate of the department (BS CS ’10).\nSolomonik’s focus also has guided his research, which last month was recognized with the IEEE Computer Society’s TCHPC Award for Excellence for Early Career Researchers in High Performance Computing.\nThe award recognizes the 28-year-old Solomonik for research that “has developed more scalable numerical algorithms and high-performance computing libraries. His research group, the Laboratory for Parallel Numerical Algorithms, leads the development of the CYCLOPS library for tensor computations, which encapsulates optimized communication-avoiding algorithms using a high-level language for tensor algebra. CYCLOPS has enabled groundbreaking simulations of electronic structure and quantum circuits, while also being applied to graph and data analysis.”\nSolomonik was nominated for the TCHPC Award by Professor James Demmel, the chair of Electrical Engineering and Computer Sciences at the University of California, Berkeley, and Solomonik’s PhD advisor.\nIn nominating his former student, Demmel noted the motivation of Solomonik’s work, and the advances for which he is responsible.\n“Edgar’s work … is motivated by avoiding communication, i.e. minimizing data movement, since moving data (between levels of memory or over networks) is more expensive in time and energy than arithmetic,” Demmel wrote, noting that in some cases his work led to operations that improved efficiency by many times and that CYCLOPS is widely used in computational chemistry.\nSolomonik noted that communication avoidance is a common theme in high performance computing.\n“My research is especially focused on supercomputers and large clusters where you have many, many nodes connected across a large network and they’re sending a little bit of data from one machine to another, which can cost a few orders of magnitudes more than doing some on that machine,” he said. “So that kind of changes the perspective on how algorithms should be designed and also how software should be designed.”\nSolomonik, as Demmel noted, created the first algorithms for fundamental matrix computations that achieve minimal communication cost.\nThe TCHPC Award is the second in just over a year recognizing Solomonik as a promising young scientist. He won the Householder Prize in 2017.\nThe latest honor, he said, both feels good and adds to the drive and focus that have so far characterized his career.\n“I think adds drive, to try to do more and succeed more,” Solomonik said. “If people are recognizing what you’re doing is valuable, it makes you want to do more.”\n \n"}, {"source": "University of Illinois", "title": "Jacobson Recognized for Research That Transformed Passenger Screening After 2001 Attacks ", "link": "/news/jacobson-recognized-research-transformed-passenger-screening-after-2001-attacks", "date": "11/12/2018", "content": "\nAs Professor Sheldon Jacobson watched the September 2001 terrorist attacks unfold, he was among the many Americans who realized that life was about to change.\nWhat he did not know was that a National Science Foundation-funded research project he began just days before would be part of that change, creating the groundwork for The Transportation Security Administration’s PreCheck system. Precheck uses risk profiles to try to focus air security resources on higher-risk passengers.\nThe work Jacobson and three of his PhD students carried out while he was part of Department of Mechanical & Industrial Engineering has now been recognized with an IMPACT Prize from The Institute for Operations Research and the Management Sciences. The IMPACT Prize is awarded every two years and recognizes operations research that has had widespread impact.\nThe award highlights work whose effects have played out over a generation, from the morning of Sept. 11, 2001, through PreCheck’s adoption in 2011 to the recognition of the prize itself this month.\n“It's a real tribute to a number of people. The students did a phenomenal job in implementing this. (And) Ken Fletcher -- without him, we wouldn't be getting the award because someone had to make it into reality and we didn't have the power to do that,” Jacobson said, referring to the now-retired chief risk officer of the TSA who used the research to design PreCheck. “This is something that really has changed a lot of people's lives.”\nAnd their taxes.\nUsing his own research and the work of other researchers, Jacobson put what he calls a conservative estimate of the amount of money saved by the program at more than $350 million a year in direct costs alone.\nThe key is the roughly 1 million airline-passenger screenings a day that are PreCheck-qualified passengers. They use dedicated lanes available at more than 200 U.S. airports that require fewer TSA staff members than enhanced screening lanes.\n\n\n\nResoundingly Human podcast\n\n\nDuring the The Institute for Operations Research and the Management Sciences' conference, Professor Sheldon Jacobson also appeared on the organizatioon's \"Resoundingly Human\" podcast. You can listen here.\n\n\n\nFor the first decade after the attacks, the TSA essentially assumed that all passengers carried the same potential security risks and screened them all accordingly. That situation required either an expensive commitment of resources and time or, assuming that the agency would never have enough of either, the probability that some passengers would inevitably be underscreened.\nThe NSF-funded work that Jacobson had just begun when the attacks happened included a cost-benefit analysis of whether all baggage should be screened using essentially the same technology used in CAT scans.\n“We can't treat everybody like a terrorist. You have to treat people commensurate with their risk and that was the kind of nascent idea of what became risk-based security,” Jacobson said. “How can we take security resources and passenger risk and bring them together in an optimal way? So we used optimization models to analyze systems.”\nThe three students Jacobson worked with over a period of years and who share in the award were Laura Albert, who is now an associate professor of Industrial and Systems Engineering and assistant dean for Graduate Affairs, at the University of Wisconsin, Madison; Alexander Nikolaev, now an associate professor of Industrial and Systems Engineering at University at Buffalo; and Adrian Lee, who is president of Central Illinois Technology and Education Research Institute.\nAlbert, Jacobson said, was part of what he called the “Ah ha! moment” when the use of dynamic rather than static models for passenger screening – looking at passenger risk over a period of time rather than focusing on any particular moment – started to make sense.\nLater, Nikolaev came up with the policies that would be best for implanting the system. And Lee, whose background was in control theory, worked to sort out a balance between underscreening and overscreening passengers.\n“How do you do that? Every person has a risk profile,” Jacobson said.\nThe prize represents a form of validation, not so much for Jacobson or his former students as for the power and reach of a major research university, he said.\n“So often we're criticized in academia, that we're not doing anything relevant,” he said. “The prize recognizes the fact that this institution, the University of Illinois, can facilitate things like this, and I'm just one of 2,000 faculty members doing things, working hard, and serving.”\n"}, {"source": "University of Illinois", "title": "Acun’s Focus on HPC Energy Efficiency Leads to Dissertation Recognition from SIGHPC ", "link": "/news/acun-s-focus-hpc-energy-efficiency-leads-dissertation-recognition-sighpc", "date": "11/9/2018", "content": "\nAs an undergraduate, Bilge Acun was drawn to supercomputers and the scientific discovery they made possible. But as she learned more about the tremendous amounts of power they consume, Acun focused on ways to make them more energy efficient, eventually writing her PhD dissertation on the subject.\nAcun’s dissertation has been recognized with an honorable mention in the inaugural Doctoral Dissertation Award competition of the Association for Computing Machinery Special Interest Group on High Performance Computing (SIGHPC).\nAcun (PhD CS ’17) said the recognition of her dissertation, “Mitigating Variability in HPC Systems and Applications for Performance and Power Efficiency,” is a gratifying reflection of the increasing importance of efficiency in high-performance computing.\n“It is great to see a work on energy efficiency being recognized with this award,” she said. “The HPC community is traditionally solely focused on performance, but metrics beyond execution time are becoming increasingly important, including energy and power, and the award signifies that importance to me.”\nImproving energy efficiency is important to Acun, she said, because of concerns about climate change and the growing need for energy to power high-performance computers. As noted in her dissertation, a petaflop supercomputer requires millions of dollars’ worth of machine and cooling power each year.\n“(And) the size of the data-centers and supercomputers keeps growing,” she said.\nAcun, who is now a researcher at IBM’s Thomas J. Watson Research Center in New York, began working on processor variability as a PhD student following a suggestion by a fellow student, Phil Miller (PhD ’16 and now the owner of a computing consultancy firm). Miller and Acun were both part of Professor Laxmikant “Sanjay” Kale’s Parallel Programming Laboratory.\nIn her dissertation, Acun analyzed frequency, temperature, power, and application-level variations in large-scale HPC systems, identifying their causes and proposing solutions:\n\nFrequency variations, she found, were a result of differences in the power efficiency of chips because of the manufacturing process. She proposed speed-aware dynamic load balancing strategies to mitigate those variations.\nThe manufacturing process was also the culprit behind power variations, leading Acun to propose variation-aware node-assembly methods.\nAcun pointed to inefficiencies in fan-based cooling systems as the cause of temperature variations, and settled on decoupled fan-control mechanisms with a learning-based temperature prediction model as a solution.\nAnd finally she pinpointed characteristics of the applications themselves (such as different kernel types) as the source of variance at the application level. Her solution was a fine-grained runtime based technique to mitigate those variations.\n\n“Energy and performance efficiency improvements are historically enabled by hardware improvements, however I see runtime systems as a big opportunity for computer scientists to help,” she said.\nAt IBM Research, Acun is continuing to work on improving the power efficiency as well as the performance of heterogeneous systems.\nFor inspiration she draws on the scientific applications that current large-scale computers and future exascale systems could make possible – new ways to treat cancer, for instance, and giving doctors a better understanding of the brain and heart through simulations.\nAcun says she finds inspiration in her experience in the Parallel Programming Laboratory, where Kale – her PhD advisor – fostered a culture of collaboration and respect.\n“Professor Kale has a wealth of technical knowledge in parallel computing and HPC area,” she said. “He allowed me to grow as an independent researcher and work on the topics that I cared about.\"\n"}, {"source": "University of Illinois", "title": "SENSELET Provides Sensory-Driven IoT Network for Scientific Instruments ", "link": "/news/senselet-provides-sensory-driven-iot-network-scientific-instruments", "date": "11/8/2018", "content": "\nWhen fabricating new semiconductors for computer chips, the external environment – such as the humidity, temperature, or vibration from nearby machines – can make or break the experiment. That holds true for many types of research involving scientific instruments, including the discovery of new materials or biomedical processes.\nA team of researchers at the University of Illinois is building a wireless and scalable sensory infrastructure that will help scientists better understand the conditions under which their experiments succeed or fail, with the idea of accelerating scientific discovery and the introduction of new technology to the marketplace. The National Science Foundation is funding the two-year, $500,000 project, titled “SENSELET: Sensory Network Infrastructure for Scientific Laboratory Environments.\"  \n“Our goal is to help scientists not have to repeat experiments so many times to find the winning formula,” said principal investigator Klara Nahrstedt, director of the Coordinated Science Lab and the Ralph and Catherine Fisher Professor of Computer Science at Illinois. “Ultimately, we want to speed up the discovery cycle for new innovations.”\nThe team’s goal is to deploy a diverse wireless and sensory infrastructure that collects data and sends it to the cloud, where it will be correlated and synched with instrument data in real-time and on demand.  Along with providing valuable information to researchers, the technology will also help lab managers better understand conditions in the facilities they are in charge of maintaining.\n“Lab environment data gives present status, information on changes and trends, and conditions during a process or measurement,” said Mark J. McCollum, principal research engineer at the Micro & Nanotechnology Laboratory. “Having this history and using it with 4CeeD provides important meta-data as well as a predictive path for management and operational needs in a physical device laboratory. It is exciting how SENSELET will make this conveniently available.”\nSENSELET builds on previous NSF-funded work, which includes the development of the 4CeeD Distributed Data Infrastructure, a Web-based distributed capture, curation, and coordination tool that bridges the network and computing gap between scientific instruments and the remote cloud infrastructure. As part of the work, researchers also developed BRACELET, an edge device infrastructure that enhances security and performance issues that arise when connecting old instruments with the modern 4CeeD cloud infrastructure. 4CeeD operates on a cloud-based smart data management system called Clowder, developed by Illinois’ National Center for Supercomputing Applications.\nIn addition to Nahrstedt, the research team includes Roy Campbell (Computer Science), Kenton McHenry (NCSA), John Dallesasse (MNTL), and Tracy Smith (Campus IT).\n\nSee the original CSL story.\n"}, {"source": "University of Illinois", "title": "Illinois CS Alumni Awards Recipients Talk Chicago, Teamwork, and Procrastination ", "link": "/news/illinois-cs-alumni-awards-recipients-talk-chicago-teamwork-and-procrastination", "date": "11/6/2018", "content": "\nIllinois Computer Science graduates being honored during October’s Alumni Awards celebration spent more than an hour on October 19 talking about their own experiences and answering student questions.  The panel discussion, moderated by Chair of the Association for Computing Machinery Caren Zeng, touched on, among other things, procrastination, teamwork, and whether it’s best to start a career in Chicago or elsewhere (spoiler: there is no single right answer).\n\n\n\n\n\nIllinois Computer Science Alumni Awards\n\n\nThirteen distinguished Illinois Computer Science alumni were recognized for their professional, technical, educational, or service contributions during the department’s annual Alumni Awards Ceremony and Banquet.\nThe list of awards and honorees included (for more information on each, see our earlier story):\nDistinguished Achievement Alumni Award, Douglas MacGregor (MS CS ’80).\nEarly Career Achievement Alumni Award, Vilas Dhar (BS ’04, along with a BS Bioengineering ’04).\nDistinguished Educator Alumni Awards, Professor Ron K. Cytron, (MS CS ’82, PhD CS ’84), Professor Won Kim (PhD CS ’80), and University of Hawai’i President David Lassner (BA Economics ’76, MS CS ’81).\nEarly Career Educator Alumni Awards, Associate Professor Eric Gilbert (BS Math and CS ’01, PhD CS ’10) and Associate Professor Ron. K. Cytron (MS CS ’04, PhD CS ’09).\nDistinguished Service Alumni Award, Ross Erlebacher (BS CS ’88, MS CS ’89).\nDistinguished Achievement Memorial Award, Professor Gene Gene Golub (BS Math '53, MA Stats '54, PhD Math '59).\nScott H. Fisher Computer Science Teaching Award, Associate Professor Craig Zilles.\nC.W. Gear Outstanding Junior\nFaculty Award, Assistant Professor Ranjitha Kumar.\nDavid J. Kuck Outstanding Thesis Awards, Assistant Professor Matthew Sinclair (PhD CS ’17) and Dimitrios Skarlatos\n(MS CS ’16).\n\n\nMembers of the panel included Douglas MacGregor (MS CS ’80, who is building a cybersecurity program as an adjunct professor at Western State Colorado University); Vilas Dhar (BS ’04, along with a BS Bioengineering ’04, now an investor, entrepreneur, and lawyer); Professor Ron K. Cytron (MS CS ’82, PhD CS ’84, associate chair of Computer Science & Engineering at Washington University); Professor Won Kim (PhD CS ’80, a distinguished professor in the Department of Software at Gachon University in Seongnam, Korea); David Lassner (BA Economics ’76, MS CS ’81, president of the University of Hawai’i); Associate Professor Eric Gilbert (BS Math and CS ’01, PhD CS ’10, John Derby Evans Associate Professor in the University of Michigan’s School of Information); Associate Professor Karthik Pattabiraman (MS CS ’04, PhD CS ’09, University of British Columbia); Ross Erlebacher (BS CS ’88, MS CS ’89, a senior director with Cognizant); and Dimitrios Skarlatos (MS CS ’16, currently a PhD student at Illinois CS).\nRita Patel Jackson (BS Math and CS, ’88, head of global marketing for GE Healthcare’s Healthcare Analytics) also joined the panel. She delivered the keynote address at the previous night’s Women in Computer Science Alumni-Student Dinner.\nSome of the highlights from the panel:\nHOW VIABLE IS CHICAGO AS A PLACE TO BEGIN A TECH CAREER?\nERLEBACHER (who lives and works in the Chicago area): “I think the city’s committed to doing more. Many of the universities – Illinois, Northwestern, (the University of) Chicago – come help build Chicago. I’d say it’s definitely on the upswing.”\nGILBERT: “I’m from Chicago, I think Chicago’s great. … I think for most of my career, I’ve felt the inexorable pull of the Bay Area. And I feel like that’s changing. So in Ann Arbor where I (live), you saw Duo Security get (started), stay there, exit, and continue to stay there. That was unthinkable 10 years ago.”\nMACGREGOR: “I guess my job today is to be the contrarian. … The bigger question’s not where you’re going to go, but what you’re going to be doing through the first 10 years of your career. Work your butt off. The idea that you can just go in and spend eight hours and ‘I’m balanced and I’m more productive’ is total baloney.\n“Go wherever that best opportunity is. And then when you get into your mid-30s and you want to have a family, you want more balance, you want to spend time with kids, that’s great. But you’ve got your career foundation built.”\nLASSNER: “You can do great work anywhere,” citing the example of University of Hawaii Emeritus Professor Norman Abrahamson, who led the development of the ALOHAnet, the first wireless packet network, after beginning his career at Stanford University and the University of California-Berkeley.\n“He decided he wanted to move to Hawaii because he wanted to surf more, joined the Electrical Engineering Department, and invented the ALOHAnet.”\n\n\n\n\n\n\nAlumni Awards Week\n\n\nIn addition to the panel and dinner and awards ceremony, honorees and students enjoyed a keynote address by Mark Tebbe (BS CS '83). (Watch the video.) He is chairman of ChicagoNEXT at World Business Chicago and an adjunct professor of entrepreneurship at the University of Chicago Booth School of Business.\nAward winners enjoyed a working breakfast at the University of Illinois Research Park and your of the National Center for Supercomputing Applications’ National Petascale Computing Facility.\nAs part of the awards weekend, the annual Women in Computer Science Alumni-Student Dinner was also held, including a keynote address by Rita Patel Jackson (BS Math and CS, ’88). (Watch the video.) She is the head of global marketing for GE Healthcare’s Healthcare Analytics organization.\n\n\nWHAT IS YOUR BEST METHOD FOR AVOIDING PROCRASTINATION?\nCYTRON: “You want a healthy balance in life, right? My son, who is now 20 years old, would get up from dinner, go play the piano, go play the ukulele, go play ‘Fortnite’ for a while. So the problem is you do that indefinitely to the effect of never getting your work done. The goal in life is, what you want to do and have to do become the same thing eventually.”\nERLEBACHER: “Usually the things that I procrastinate on were the things that were too big, they were daunting. So my suggestion is find a way to break it down into bits so you can have that satisfaction of, ‘Oh, step one of five, I’ve completed step one.’ Just break it down into smaller problems. That’s what we teach in computer science, right?”\nPATEL JACKSON: “Sometimes (procrastination is) OK. I know how long physically, mentally it’s going to take me to get things done, and I work well under pressure. And not everybody does. … So if you work good under pressure and you can get it done, it’s good quality work, have at it.”\n\nWHAT IS THE KEY TO PRODUCTIVE AND HAPPY TEAMWORK?\nGILBERT: “I think it’s a lot of psychology, actually. Go south of Green Street, take a psychology class.\n“You have to have a shared goal, you have to buy into the goal, you have to have trust with the people who are working that you’re going to have their back – that if I need help you’ll pitch in and help me, but it’s going to be reciprocal.”\nDHAR: “I had an internship when I was a CS student here. I was pretty young, I think it was my first job ever. So I had an assignment and one day, I worked until around 6:30 or so, and most of the people had left. I decided ‘OK, I’m going to go home now.’\n“I walked back in the next morning and I had one of those moments that defined the rest of my career, where the person who was supervising me asked me to come in and we sat down. He said ‘Is this thing done yet?’ I said ‘No, I’m going to do it today.’ He said, ‘Listen, you didn’t get your thing done, so nobody else on the team was able to do their work. Now they’re waiting for you.’\n“And I didn’t go home before 9 p.m. one more night that summer. But more to the point, what happens on teams is you let people own their work. If you really think about them as the owners, the people who make the team succeed, then you don’t have to manage anybody. You let people manage themselves and everybody comes together and gets something done.”\n"}, {"source": "University of Illinois", "title": "Adve’s Research on Memory Consistency Models, Influence on Hardware and Software Worlds Recognized with Kennedy Award ", "link": "/news/adve-s-research-memory-consistency-models-influence-hardware-and-software-worlds-recognized", "date": "10/31/2018", "content": "\nIllinois Computer Science Professor Sarita Adve has been named the recipient of the 2018 ACM/IEEE-CS Ken Kennedy Award by the Association for Computing Machinery and IEEE Computer Society. The award recognizes her influential work and leadership at the interface of hardware and software.\nAdve is the third Illinois CS professor to win the prestigious award in the past nine years, joining 2010 winner David J. Kuck and 2016 winner William D. Gropp.\nThe 2018 Kennedy Award, which was announced Oct. 31, recognizes Adve “for research contributions and leadership in the development of memory consistency models for C++ and Java, for service to numerous computer science organizations, and for exceptional mentoring.”\nAdve, who is the Richard T. Cheng Professor of Computer Science, said the research behind the award began in her earliest work, at the University of Wisconsin-Madison, where she earned a PhD in 1993.\n\n\n\n“This is an area I started working on as a grad student and continue to work on. That’s quite unusual, but just happened to be a problem that was a really hard problem,” she said. “One of the reasons that it’s hard is that this problem affects both hardware and software. … It’s at the heart of the notion of correct behavior of a computer, and yet this is a part of that puzzle that has been really hard to solve.”\nAdve co-developed the memory models for C++ and Java (with Hans Boehm, Bill Pugh, and others), based on her early work on data-race-free (DRF) models (with her PhD advisor, Mark Hill).  The memory model specifies what value a read of a memory address will return, and is key to the correctness and performance of threaded programs, languages, compilers, and hardware. By impacting the models of the most widely used programming languages, Adve’s work has influenced the worldwide software community and hardware design.\nBut she notes the idea did not take hold overnight.\n“We wrote the first paper in 1990,” she said. “It was very well received. But it took a long time for people to really understand our idea that a memory model should be viewed as a contract between hardware and software where software obeys certain rules (data-race-free) and hardware promises sequential consistency. That this idea struck the sweet spot between programmability and performance took over a decade to really take hold.”\nMore recently, with her students, Adve questioned the conventional wisdom for memory models for heterogeneous systems and showed that DRF is a superior model even for such systems.\nOne of the students who played a key role in that research was Matt Sinclair (PhD CS ’17), now an assistant professor at the University of Wisconsin.\n“Sarita is an excellent mentor, and I've benefited tremendously from the opportunity to work with her and learn from her,” Sinclair said. “In particular, Sarita is really good at treating each person uniquely, and identifying the best way to mentor them and bring out their best.  This is something I strive to emulate in my post-graduate career.”\nAdve’s broader research interests are at the hardware-software interface and span the system stack from hardware to applications. She is also known for her innovations in cache coherence, hardware reliability, and power management.\nPennsylvania State University Emeritus Professor and Illinois Computer Science graduate Mary Jane Irwin (MS CS ’75, PhD ’77) nominated Adve for the award and called her \"a natural and right choice,\" based on her teaching, mentoring, and community service, as well as the impact of her research.\n\"Sarita’s long-term and impactful work on designing and formally specifying memory consistency models has had profound, real-world impact on programmability and productivity in computing,\" Irwin wrote. \"The memory consistency model lies at the heart of the semantics of any threaded software or hardware. Arguably, it has been one of the most challenging and contentious areas in concurrent hardware and software specification for many years.\"\nThe award also recognizes Adve, in part, for her extensive service to the computing community.\n“To be a good researcher is not sufficient in my mind, we need to give back,” she said.\nHer service includes working as the current chair of the ACM Special Interest Group on Computer Architecture (SIGARCH), where she instituted changes that have inspired new energy in the executive committee, leading to new programs in communications, research visioning, and mentoring. With colleagues, she also has made diversity and inclusion a key focus and led the creation of CARES, a committee to provide support to those who experienced harassment at SIGARCH and SIGMICRO sponsored events.\nAdve also serves on the ACM Council and the DARPA ISAT study group and previously served on the board of the Computing Research Association and the NSF CISE advisory committee.\nAdve is a recipient of the Anita Borg Institute Women of Vision award in innovation, the ACM SIGARCH Maurice Wilkes award, and an Alfred P. Sloan Research Fellowship. She is a Fellow of the ACM and IEEE and was named a University Scholar by the University of Illinois.\nThe award will be presented at SC 18: The International Conference for High Performance Computing, Networking, Storage and Analysis, in Dallas, Texas on Nov. 13.\nKuck, who is an emeritus professor, won the 2010 Kennedy Award for “pioneering contributions to compiler technology and parallel computing, the profound impact of his research on industry, and the widespread and long-lasting influence of his teaching and mentoring.” Gropp, who is both the director of the National Center for Supercomputing Applications and the Thomas M. Siebel Chair in Computer Science, was recognized with the 2016 award for “highly influential contributions to the programmability of high-performance parallel and distributed computers, and extraordinary service to the profession.”\nACM and IEEE-CS co-sponsor the Kennedy Award, which was established in 2009 to recognize substantial contributions to programmability and productivity in computing and significant community service or mentoring contributions. It was named for the late Ken Kennedy, founder of Rice University’s computer science program.\n"}, {"source": "University of Illinois", "title": "ThinkChicago Brings City’s Tech Message and Leaders to Illinois CS Students ", "link": "/news/thinkchicago-brings-city-s-tech-message-and-leaders-illinois-cs-students", "date": "10/31/2018", "content": "\nFrom his office in downtown Chicago, Steve Benni leads a team of technologists for JP Morgan Chase & Co. When it’s time to hire, he loves to compete with his colleagues in New York and Silicon Valley.\nHis edge? Chicago.\n“You talk to people who work in New York, they live in Jersey City. You talk to people who live in Silicon Valley and they’re on the bus an hour and a half,” Benni, the financial firm’s executive director of global technology, said during the ThinkChicago Roadshow on Oct. 25. “I love competing against my peers in JP Morgan. We can beat them on all these metrics.”\nBenni (BS CS ‘00) was part of a panel of tech executives and entrepreneurs who talked to students during the Roadshow stop at Illinois Computer Science.\nThe Roadshow holds events at college campuses around the state and beyond, working to spread the message of ThinkChicago – the public-private partnership that works to develop the city’s technology sector -- and encouraging students to explore the professional possibilities the city holds.\nThe Roadshow stop at Illinois CS offered students the chance to connect with representatives of a number of top Chicago-area companies and the opportunity to listen to a panel of tech leaders talk about the city and the resources it offers.\nIn Benni’s case, he told students that Chicago gives him both the career he wants with JP Morgan and the ability to live nearby with his family.\n“I live about a mile and a half from our office in downtown Chicago, and I’m very much a Chicagoan at heart,” he said. “I’ve raised my kids in the city.”\nLike Benni, Chicago is both home and a professional advantage for Joe Jablonski.\nJablonski (BS EE ‘93) is the co-founder and CTO of Ocient, a data analytics startup, and a veteran of other area tech startups.\n“We hire a ton of young engineers, and they all walk or bike to work,” he told students. “That is an amazing lifestyle.”\nBut Chicago provides advantages to the company beyond a nice way of life for employees, Jablonski said.\nThe past successes of Jablonski and his co-founders – including the $1.3 billion sale of Cleversafe, which two of them were part of -- meant they could have started Ocient anywhere, but chose Chicago, he said.\n“There’s one overwhelming reason, and that’s because of the talent that’s in Chicago,” he said. “It’s worth working there and living there for that reason.”\nAnd Ocient is making the most of the region’s talent. About 75 percent of the 21 employees and interns it hired last summer came from the University of Illinois.\nChicago also has a strong track record of founders who have chosen to remain in the city, and a pool of financing that makes more possible, Jablonski said.\n“In 2004, me and some buddies started a poker game,” he said. “That group (included) the founders of Grubhub, the founders of Groupon, the founders of Cleversafe, and myself,” he said. “At Ocient we probably had 50 venture capitalists begging us to put money into Ocient. It really isn’t a problem.”\nMuch of the discussion also focused on hiring. Most of the members of the panel emphasized that they’re looking for people who are skilled technologists and data scientists, but also have broader aspirations.\n“Are you a good cultural fit? Are you passionate? I don’t want somebody who chose engineering just because they wanted to make a lot of money,” said Miranda Kemp, who is director of AARP’s technology labs at the University of Illinois Research Park. She is also a University of Illinois MBA student.\nLong Hei, who is director of Data Science for CCC Information Services in Chicago, said data science comes first when he hires, but “I’m looking for people who want to put on other hats, not just data science hats, but think about the users -- what do they want?”\n“A good data scientist should be trilingual,” he added, able to dive into math, technology, and business.\nBeth Ladd, who is analytics R&D manager and director of the Caterpillar Data Innovation Lab and CAT Digital Lab at the Research Park, looks for students with a similarly varied skill set.\n“We want folks who are curious, love technology, who are interested in human-centered design,” she said.\nBut at Benni’s group, he said, a love of technology is key.\n“What I’m looking for is somebody who really wants a career in technology, 10 years from now is still going to be doing something technical.”\n"}, {"source": "University of Illinois", "title": "New Center to Accelerate Quantum Information Science and Engineering ", "link": "/news/new-center-accelerate-quantum-information-science-and-engineering", "date": "10/29/2018", "content": "\nThe University of Illinois at Urbana-Champaign is making a $15 million investment in the emerging area of quantum information science and engineering, a field poised to revolutionize computing, communication, security, measurement and sensing by utilizing the unique and powerful capabilities of quantum mechanics.\nThe centerpiece of the campus effort will be the formation of the Illinois Quantum Information Science and Technology Center.  This will include a major hiring initiative to expand the number of quantum science experts at Illinois across multiple departments throughout the College of Engineering and the campus.  The center will also enable the development of a focused program to educate the next-generation quantum workforce.  The investment will also include state-of-the-art equipment for the fabrication of quantum materials and devices. \nThe center will bring together Illinois’ physicists, engineers, computer scientists and many others to develop new paradigms in quantum information science and technology. They will discover and develop novel quantum algorithms, materials and devices. One of the center’s key projects will be the construction of a multi-node quantum testbed, enabling researchers to explore and implement new ideas for distributed quantum processing and applications of quantum networks. This work will continue the legacy of the contributions of the University of Illinois to the digital information revolution.\n“Quantum science and technology researchers are bold, and they face immense and difficult challenges – like any trailblazer,” said Rashid Bashir, who will become dean of Illinois’ College of Engineering on Nov. 1. “IQUIST will serve as the launching pad of innovations in quantum science and engineering. Building on our past and our current strengths, our scientists and engineers will lead the quantum information revolution to develop a new paradigm in computing and information processing.”\nWith IQUIST, the College of Engineering will also launch new educational initiatives to train the future leaders of quantum scientists and engineers at the graduate and undergraduate levels.  “The New York Times reported on the lack of quantum science and technology talent just last week. It’s crucial, as one of the largest and best engineering and physics programs in the country, to address both the technical and research challenges and the educational and workforce challenges that we face,” Provost Andreas Cangellaris said.\nIQUIST will foster and expand collaborations with industry, national labs and other academic institutions, such as the University of Chicago, Argonne National Laboratory and Fermilab.  As a participant in the Discovery Partners Institute’s Illinois Innovation Network, IQUIST will contribute to strengthening Illinois’ economy through high-tech workforce and next-generation technology development.\n“Our campus has a legacy of groundbreaking contributions to fundamental science and the development of technologies that have shaped society over the past century, including the first automatic computer, magnetic resonance imaging, light-emitting diodes and the first modern internet browser. Not to mention the first computer built and owned by an educational institution,” Chancellor Robert Jones said. “Today, we are pleased to announce near-term concrete actions that will advance this critical area of national need and importance.”\n\nSee the original Illinois News Bureau story.\n"}, {"source": "University of Illinois", "title": "Illinois CS Professors Win NSF Grant To Target Improvements In Computer Efficiency ", "link": "/news/illinois-cs-professors-win-nsf-grant-target-improvements-computer-efficiency", "date": "10/15/2018", "content": "\nFor many researchers, the quest to continue improving computational speed as Moore’s Law winds down focuses on finding an alternative to the silicon chip. But three Illinois Computer Science professors believe improvements could be found in the inefficiencies of computing systems, and the National Science Foundation believes their idea holds some promise.\nThe NSF has awarded a $1.2 million, four-year grant to Professors Josep Torrellas, Laxmikant V. Kale, and David Padua to work on ways to make existing systems consistently more efficient, which they believe could exponentially improve performance of large servers and data centers. Torrellas is the principal investigator for the project, for which the three will collaborate with chip-maker Advanced Micro Devices.\nThe bottom line, Torrellas said, is CMOS-based computers use energy very inefficiently, for a variety of reasons.\nData has to be gathered from the memory, other chips, or the disk, requiring far more energy than would be used if all operations were performed locally on the processor, he said.\nSecond, many operations use an approach called speculation that consumes a lot of energy and, in many instances, are just plain useless, according to Torrellas.\n“Let’s say a program executes, and hits a branch. The program needs to check a condition to decide which way to go. But processors do not wait to figure out the outcome of the condition before moving on because it’s going to take some time,” he said. “Instead the processor follows one path. Then, if that’s wrong, the hardware scraps everything, and goes the other way.”\nAnd finally, using his own office laptop as a small-scale example as it idled nearby, “This guy is consuming a lot of energy not doing anything,” Torrellas said.\n“So the combination of these three things make a computer orders of magnitude less efficient than it should be.”\nTorrellas is the Saburo Muroga Professor of Computer Science and his research focuses on architecture, compilers, and parallel computing.\nHe and his collaborators are taking a four-pronged approach to the project:\n\nAdapting control theory – which is used across engineering to analyze systems and create feedback loops used to control those systems -- to computer architecture.\nDeveloping hardware controllers.\nExtending runtime systems to actuate on the hardware.\nUsing compilers to generate code that is optimal for a highly-controlled cluster or datacenter.\n\nControl theory, Torrellas explained, presents an early unknown in the project. It is often used in aeronautical engineering and mechanical engineering.\n“How can it be applied to computers? It is an open question,” he said. “Computers are very complicated; building a model of a computer is very hard.”\nThe key, he said, will be to take what he calls an integrated, cross-layer approach to the work.\n“There’s hardware, the operating system, the compiler, the application,” Torrellas said. “All these layers, if you optimize them together, you get a higher impact.”\nTorrellas will focus on the hardware.\n“You’re going to have a large machine built out of nodes, each node will have multiple chips, each chip will have multiple cores,” he said. “You have to build in a hierarchical manner. You control the core, then you control the chip that has multiple cores. Then you have a node that controls multiple chips, and so on.”\nKale, meanwhile, will work on the runtime system. Kale is the Paul and Cynthia Saylor Professor of Computer Science and leads the Parallel Programming Laboratory. His past work includes pioneering research to develop adaptive runtime systems in parallel computing.\n“Power, energy, and temperature are becoming very important issues in extreme-scale computing, even as they are important on cellphones and laptops,” Kale said. “It is an exciting prospect to combine our work on adaptive runtime systems with controllable adaptive hardware at the lower level and compiler support at higher level, via a common framework provided by a control system.”\nPadua is a Donald Biggar Willett Professor in Engineering and his research focus includes optimization strategies. He will focus on designing compilers.\nThe three professors also plan to compare the use of control theory to improve system efficiency with the use of machine learning.\n“Some people are trying to make the systems more efficient by using machine learning -- an algorithm that’s telling me ‘shut this hardware down now’ or ‘move this program here, change the frequency,’ as opposed to control theory, which is based on a more reactive approach,” Torrellas said.\nTorrellas, Kale and Padua also believe the project could serve as a catalyst for interdisciplinary research and education on clusters and data-center technology at Illinois.\n"}, {"source": "University of Illinois", "title": "Siebel Chair Gift Keeps Giving To Gropp And Illinois CS Researchers ", "link": "/news/siebel-chair-gift-keeps-giving-gropp-and-illinois-cs-researchers", "date": "10/12/2018", "content": "\nAs a young researcher, Bill Gropp worked in a world where scientists with bright ideas could find the funding to explore them before they had any results in hand.\nThat world has radically changed, Gropp says, requiring researchers to have at least some promising findings before they can secure the money to see their ideas through.\nBut as the Thomas M. Siebel Chair in Computer Science, Professor Gropp has a tool that lets him sometimes turn back the clock.\nThe chair gives Gropp money he can use at his discretion to launch the kind of “curiosity-driven research” that he says often leads to truly transformative ideas.\n“It’s seed money – incredibly valuable seed money,” said Gropp, who is also director of the National Center for Supercomputing Applications. “This is what’s really valuable with the resources that come with the chair. It gives you this opportunity to explore without having to wedge it into your grant funding or finding some other way to do it on a shoestring.”\nThe Siebel Chair in Computer Science was established in 2013 with a $2 million gift from the Thomas and Stacey Siebel Foundation, the charitable organization established by Illinois Computer Science alumnus Thomas Siebel (BA History ’75, MBA ’83, MS CS ’85).\nSiebel, who is the chairman and CEO of enterprise software company C3 IoT and before that founded Siebel Systems, is an active philanthropist. The foundation supports efforts related to everything from energy solutions and public health to caring for the homeless.\nThe Siebel Chair reflects two of Siebel’s other philanthropic passions: research and education.\nDiscussing his long history of major gifts to the University of Illinois, Siebel told The News-Gazette in 2014 that the guiding philosophy for philanthropy is \"Make change happen.\"\nGropp became the first Siebel Chair after coming to the university from Argonne National Laboratory in 2007. He had a track record of pioneering the kind of change Siebel talked about. Gropp and collaborators designed the Message Passing Interface, or MPI, the standard that is essential to the parallel processing now at the heart of supercomputing.\nGropp came to Illinois Computer Science as the Paul and Cynthia Saylor Professor in Computer Science, a position that provided him with resources and possibilities beyond the typical faculty position.\nThe Siebel Chair gives Gropp even more, including links to Siebel’s other on-campus endeavors – the Siebel Scholars and the new Siebel Center for Design.\n“Part of having that chair is interacting with these other things,” Gropp said. “I’ve had some really good discussions with Rachel Switzky, the new head of the Siebel Design Center.”\nAnd, in the bottom-line research world Gropp talked about, the chair provided greater financial resources.\n“I do have more flexibility in saying I can absolutely afford a student on this for a couple of years. … I just don’t have to worry about it,” Gropp said.\nErin Molloy is one of several students now working on projects started at least in part with money from the Siebel Chair. Molloy is a CS PhD student being advised by both Gropp and Founder Professor of Engineering Tandy Warnow, whose primary research area is bioinformatics and computational biology.\nMolloy is working to scale species tree estimation to build out the tree of life, a problem that involves a lot of data, highly parallel computing, and algorithms that produce very precise results.\n“The work that Erin is doing I think is going to be really transformative,” Gropp said. “She was sort of marrying the algorithmic work that Tandy does with the high-performance computing work that I do to create new methods for going after very big and very difficult problems.”\nProjects like Molloy’s, he said, remind him of work that happens at companies like Google and 3M that give employees time and other resources to – as Gropp likes to say – just explore. Using the 3M example, he points out that Post-it Notes grew out of such freedom.\n“We’re lucky enough to have this flexibility, we can still do the curiosity-driven work that often is going to generate the most important ideas, I think,” Gropp said. “People who don’t have to run in the rat race of bringing in the funding don’t understand how much time we now spend chasing funding as opposed to working on developing new ideas.”\n \n"}, {"source": "University of Illinois", "title": "Professor Jiawei Han Joins Select Group With Funai Achievement Award ", "link": "/news/professor-jiawei-han-joins-select-group-funai-achievement-award", "date": "10/12/2018", "content": "\nThe Funai Achievement Award is Japan’s highest honor for information science, and before 2018 only three non-Japanese researchers had ever won it.\nIllinois Computer Science Professor Jiawei Han last month became the fourth, when he was announced as the 2018 winner.\nThe Information Processing Society of Japan awarded Han “for his pioneering work on Data Mining, Information Network Analysis, Database Systems, and Data Warehousing.”\nHan, who is an Abel Bliss Professor in Engineering, described in understated fashion one of the primary reasons he was honored.\nIn the 1990s, “A lot of people in the U.S. and Japan were thinking about getting into data mining, and I was kind of an early bird.”\nIllinois Computer Science Interim Department Head Vikram Adve noted that, Han’s modesty aside, the award was both a remarkable honor and well deserved.\n“This is a highly prestigious award, and extraordinarily few outside Japan have received it,” Adve said. “Professor Han is the perfect choice for this award, because of his outstanding technical contributions in the field of data mining, his long-standing leadership of the community, and his mentoring of numerous leaders in the younger generation of data mining academics and researchers.”\nThe only other non-Japanese winners of the Funai Achievement Award are ACM Turing Award winners Alan Kay (2002) and Marvin Minsky (2003), as well as William J. Dally (2015), Nvidia Corporation’s chief scientist.\nProfessor Shojiro Nishio, the president of both Osaka University and the Information Processing Society of Japan, introduced Han at the society’s September conference with a long list of the Illinois CS professor’s accomplishments:\n\n  A founder of the data mining research field, and author of a textbook on the subject which has been widely adopted internationally for two decades.\n  One of the most cited authors in computer science (ranked top three among CS researchers, according to Google’s H Index).\n  The inventor of a set of influential frequent-pattern mining algorithms.\n  Creator of a subfield of mining heterogeneous information networks.\n  Recognized with numerous awards, including ACM Fellow, IEEE Fellow, ACM SIGKDD Innovation Award, IEEE Computer Society Technical Achievement Award, and IEEE Computer Society W. Wallace McDowell Award.\n  Advised a number of influential PhDs – 35 students have completed PhDs from Illinois CS under Han.\n\nHan said that his “early bird” status in data mining grew out of his PhD work at the University of Wisconsin between 1979 and ’85.\n“I was thinking, ‘In the future, the database must be integrated with artificial intelligence,’” Han said. “You have a huge amount of data. You want to make them into patterns and rules. If you really want to make good use of the data, you have to somehow make the data intelligent.”\nHis first paper on data mining, in 1989, actually predated the term and instead used the term KDD, knowledge discovery in databases.\nNow Han leads the Data Mining Group at Illinois Computer Science.\nHan also played a key role in creating the ACM SIGKDD Conference on Knowledge Discovery and Data Mining.\nThe gathering now draws several thousand people a year, but started as a small workshop on the sidelines of the International Joint Conference on AI in 1989.\nThe first drew 20-30 people, but the interest quickly grew along with the fascination in data mining and what it might make possible. The first KDD conference was held in 1995, and Han co-chaired the second the next year.\n“Now, everyone is talking about deep learning,” Han said. “Then, everyone was talking about data mining.”\n"}, {"source": "University of Illinois", "title": "Four From Illinois CS Chosen For 2018 Rising Stars In EECS Workshop ", "link": "/news/four-illinois-cs-chosen-2018-rising-stars-eecs-workshop", "date": "10/12/2018", "content": "\nThree Illinois Computer Science PhD students and a post-doctoral researcher have been chosen to be part of the 2018 Rising Stars academic career-building workshop at the Massachusetts Institute of Technology.\nIllinois CS doctoral students Sangeetha Abdu Jyothi, Shadi Noghabi, and Mengjia Yan and post-doctoral researcher Qi Li were chosen to participate in this year’s workshop, which will be Oct. 28-30.\nRising Stars provides women graduate students with mentoring and practical information to help launch and sustain academic careers.\nA look at the four Illinois CS women who will be attending:\n \nSixth-year PhD student Sangeetha Abdu Jyothi expects to enter the job market this fall, and sees the workshop as an ideal way to get a glimpse of what life as an academic might be like.\n“It covers a wide range of topics ranging from faculty recruitment process to research funding, teaching, and mentoring. I believe that this would greatly help me when I go on the academic job market this year and in my career beyond,” said Jyothi, whose advisor is Associate Professor Brighten Godfrey.\nJyothi’s research is focused on networking and systems, with a goal of reducing the Internet’s latency.\nShe won both the Facebook Graduate Fellowship and the College of Engineering’s Mavis Future Faculty Fellowship. Jyothi also was a research intern at Microsoft Research in 2015 and a software engineering intern at Google in 2014.\nShe said she is looking forward to the opportunity to listening to senior faculty talk about their career experiences.\n“I believe that understanding the challenges they faced, their successes and pitfalls, can help me in planning my career ahead,” she said.\n\nShadi Noghabi is a fifth-year PhD student, closing in on her degree as she works at Microsoft Research.\nMIT Rising Stars, she says, is perfect preparation for her “ultimate” path, a research-driven academic career.\n“My passion is to work on cutting-edge and challenging problems. Generally, academic research is a perfect fit for what I am looking for as I get to work on emerging problems, continuously have the stimulation of exploring new areas, while also being able to have an impact and solve real-world problems,” said Noghabi, who is advised by Professors Indranil Gupta and Roy Campbell.\nNoghabi’s research interests are distributed systems, cloud computing, big data, and edge computing, with work focusing on geo-distributed large-scale objects stores and stream processing systems.\nHer work has been published in SIGMOD and VLDB, and her research has contributed to a number of production open-source projects. They including Ambry, LinkedIn’s geo-distributed object store; and Samza, an Apache project used by more than 15 companies. Noghabi also is a recipient of the Microsoft Research Dissertation Grant and the Mavis Future Faculty Fellowship.\n“This workshop is a unique opportunity to meet the top fellow students with a similar interest in academic research, along with learning from many successful academic professors about the challenges of an academic career path,” Noghabi said.\n\nMengjia Yan is a fifth-year PhD student who focuses on computer architecture with an emphasis on hardware support for security. She is particularly interested in cache-based covert side channel attacks, in which an attacker is able to stealthily monitor a system and steal information through cache vulnerabilities.\nYan is advised by Professor Josep Torrellas, and sees Rising Stars as an opportunity to learn from experienced faculty and to network, all in the pursuit of her goal of a career in academia.\n“I would like to keep doing research and contribute to the field of computer architecture and security as my career goal,” she said. “I am also determined to contribute in motivating and supporting more women to work in computer science and engineering.”\nYan has interned at NVIDIA research and has won both a Mavis Future Faculty Fellowship and Illinois Computer Science’s W.J. Poppelbaum Memorial Award.\n\nComing to Illinois CS in 2017 as a post-doctoral researcher, Qi Li is focused on data mining and machine learning, in particular the collection and aggregation of information from multiple data sources. She is working with Professor Jiawei Han.\nShe says she enjoys both teaching and research, and has started working as an adjunct instructor this fall. The workshop will give her an opportunity to take further steps toward the academic career she wants to pursue.\n“I want to introduce my work and myself to the fellow computer scientists and look for future collaborations,” Li said. “I am very looking forward to the panels and discussions.”\nLi has received awards for the Presidential Fellowship of University at Buffalo, where she earned her PhD, as well as the Best CSE Graduate Research Award, and the CSE Best Dissertation Award at Department of Computer Science and Engineering University at Buffalo.\n"}, {"source": "University of Illinois", "title": "Marinov Leads Team Trying to Speed Up, Improve Reliability of Continuous Integration ", "link": "/news/marinov-leads-team-trying-speed-improve-reliability-continuous-integration", "date": "10/1/2018", "content": "\nContinuous integration (CI) has become an increasingly important part of software creation, but developers are often limited by its speed and reliability.\nAs part of a $1.2 million grant from the National Science Foundation, Illinois Computer Science Professor Darko Marinov and two collaborators will devote $437,000 to a project they hope will eventually provide a set of publicly available tools to improve CI.\nContinuous integration is the practice of regularly merging changes in software code into one shared version, not quite literally as they happen but typically multiple times a day. As the changes are integrated, regression tests are run to find out whether changes introduce bugs into the code.\n“Developers do these actions typically several times per day. It can take anywhere from five, 10 minutes to literally hours (for each),” Marinov said. “If this thing is going to take two hours to give them the result back, they’re just going to idle -- they’re going to start reading emails, go on the web. It’s hard for them to start on a new technical task because by the time this comes back it could tell them, ‘Oh, you broke something, go and revise that.’”\nDevelopers, he added, often face a tradeoff: speed versus quality.\n“In principle I can give you the answer almost immediately, but its (quality is) very bad: ‘I think you broke something but I don’t know what’,” Marinov said.\nTo improve the performance of CI, Marinov and his collaborators, Assistant Professor Jonathan Bell of George Mason University and Assistant Professor Lingming Zhang of the University of Texas at Dallas, will focus on three things.\nThey hope to improve test selection – learning what needs to be tested based on the changes that have been made in the code and what doesn’t need to be tested – to speed up regression testing.\n“It learns what we technically call dependencies – it learns some relationships between the test and the code. Then when you make the change, it simply asks, which of the tests have their dependencies changed?” Marinov said. “If a test had no dependency change, then it cannot change behavior.”\nThey also hope to improve reliability by focusing on so-called flaky tests – tests that themselves have bugs and incorrectly indicate problems in the code. And, finally, they hope to provide tools to help developers debug problems.\nMarinov, Bell, and Zhang all have experience building testing tools used both in academia and in industry for companies such as eBay, Google, Groupon, Microsoft, and Yahoo!\n"}]}